{
  "title": "Ask Us Anything about Singapore",
  "description": "A place for all your Singapore related questions.",
  "link": "",
  "items": [
    {
      "title": "Is it just me, or does Singapore seriously lack creative spaces for making things",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pc8lz0/is_it_just_me_or_does_singapore_seriously_lack/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pc8lz0/is_it_just_me_or_does_singapore_seriously_lack/",
      "pubDate": "Tue, 2 Dec 2025 13:36:06 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pc8lz0/is_it_just_me_or_does_singapore_seriously_lack/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I feel like if youre in secondary school, dnt is  so rigid. In poly youre as creative as your group mates let you be and uni idk ah but once you get to adulthood its just you don&#39;t have time to make your ideas into actual products.</p>\n\n<p>If any of yall have ideas that has been put on hold cause of work. Let me know I wanna hear your ideas and mabey we can make it real</p>\n\n<p>Edit: what im trying to say is if you have projects you never started because you&#39;re busy and tired, I want to help.I studied engineering, own a 3D printer and am really interested in product design.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What am I missing from Singapore? Why is it not an amazing place to consider living?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbwk9j/what_am_i_missing_from_singapore_why_is_it_not_an/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbwk9j/what_am_i_missing_from_singapore_why_is_it_not_an/",
      "pubDate": "Tue, 2 Dec 2025 02:28:13 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbwk9j/what_am_i_missing_from_singapore_why_is_it_not_an/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I visited Singapore recently and really impressed intentional the city feels in its design. I’m not assuming it is perfect, so I’m really curious what locals and long-term expats think I might be missing.</p>\n\n<p><strong>TL;DR</strong> With the (mostly sunny) weather, the affordable hawker stall food, the safety, the efficiency and the urban planning, Singapore feels like an amazing place to live. What downsides or realities am I not seeing? I&#39;m assuming it&#39;s a mix of humidity, high cost of living and size of the country. </p>\n\n<p><strong>1. Transit and rush hour</strong>\nI expected the kind of packed &amp; overwhelming rush hours you see in Tokyo or parts of China given the density and size of the city. Instead, everything felt calm and manageable... From what I understand, offices are spread across the country rather than concentrated in one downtown core. This seems to reduce the pressure on any single area and creates more balanced, bi-directional commuting. Since everything is about 30 minutes away, commuting felt surprisingly stress-free.</p>\n\n<p><strong>2. Cars</strong>\nCars seem intentionally positioned as a luxury. The licensing system means paying around ~$100K for a license just for the right to own a car, and something like a Toyota Corolla can cost $150K+. This results in fewer cars on the road, smoother traffic, and safer driving conditions. I relied on public transit and Grab, which felt cheap and convenient. It makes sense to me, even if it looks extreme at first glance.</p>\n\n<p><strong>3. Punishment and surveillance</strong>\nFrom a Western perspective, Singapore’s punishments (like caning) and strict laws seem harsh. But as a &quot;regular&quot; person who does not plan on breaking the law, I didn’t feel personally affected. What I did notice was a complete feeling of safety as I never saw police, guns, or conflict. I saw cameras and well-lit public spaces. It felt like a place where crime is genuinely deterred, in part because of canings. </p>\n\n<p><strong>4. Housing and religion</strong>\nI was struck by the themes of respect and balance and I know these are a strange thing to pair together. Housing-wise, I think ~80% of the population live in public housing where the gov&#39;t assigns housing based on the country’s demographic mix which prevents the formation of super ethnic neighborhoods. In the west, it&#39;s super common to see neighborhoods that are predominantly one ethnic group, which this seems to &#39;solve&#39;. While I don&#39;t think it&#39;s a problem per se, my guess is that it helps reduce racial tensions and ensures kids grow up side by side with other groups. Religiously, I also walked past a street with a church, mosque, and temple all next to each other in Chinatown. The idea of peaceful coexistence of religions felt very intentional and I found that really thoughtful.</p>\n\n<p><strong>5. Safety and homelessness</strong>\nI didn&#39;t see any homeless people during my visit. I did see migrant workers and people doing physically demanding jobs, but no one who appeared unhoused. Compared to many US/Canadian cities that struggle with homelessness, drug issues, and unsafe public spaces (SF, LA, NYC, Toronto etc.), Singapore felt incredibly safe. I’m not sure how homelessness is addressed behind the scenes though. Are people rehoused, supported, relocated, or managed in some other way?</p>\n\n<p><strong>6. Mandatory military service</strong>\nMandatory military service seems intense from a Western standpoint, where military service is usually a last resort for people with fewer options (this is my personal opinion lol). In Singapore, it seems like a rite of passage for men - it builds fitness, discipline, brotherhood, and leadership skills (specifically the brotherhood one sticks out to me because of the loneliness epidemic, this is also coming from someone without many friends that wants stronger male role models and brothers in my life). Since the country is small, some training even happens abroad I think, which seems like a pretty unique experience.</p>\n\n<p><strong>7. Politics</strong>\nFrom the outside, having one dominant political party appears to create stability and allow for long-term planning. I think there&#39;s debate to be had here on whether that&#39;s good or not since China and North Korea have a single party system. I&#39;d say in US/Canada, we pride ourselves on having democracy and ability to vote... but, in practice, as of late, it really just feels we have two parties to choose from and that has its own problems. Leadership changes every four years and major projects often stall or get reversed, I can&#39;t imagine a public/private company having leadership changes that frequently and being able to make any meaningful progress. Singapore’s consistency looks like a big part of why the city functions so well.</p>\n\n<p>Overall, with the weather, food, safety, and sense of order, Singapore feels extremely livable to me. But as a visitor, I know there are things I probably missed or oversimplified. <strong>What am I missing? Why should I not try to live here (aside from cost of living)?</strong></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Night-shift workers: How do you balance work-life?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pc59lg/nightshift_workers_how_do_you_balance_worklife/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pc59lg/nightshift_workers_how_do_you_balance_worklife/",
      "pubDate": "Tue, 2 Dec 2025 10:39:31 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pc59lg/nightshift_workers_how_do_you_balance_worklife/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi fellow Singaporeans!</p>\n\n<p>As a graduate who might start working shift work, I was wondering if there are any seniors who can give advice for having an outside-of-work life. </p>\n\n<p>Most of my internships so far have been during regular work hours where there are many opportunities to join fellow co-workers after work in activities (e.g. sports, dinner, drinks etc). However, I might need to consider doing shift work (early morning/afternoon to midnight shift, rotating once a month).</p>\n\n<p>I am however pretty dissatisfied with my current lifestyle; I do have a few close friends that I meet 2-3 times a week at night to complain about life and rokok, but I would like to have more purpose and things to look forward to in life. No girlfriend unfortunately so that is off the table :&lt; </p>\n\n<p>Would appreciate any advice from seniors with experience navigating this quarter life crisis!</p>\n\n<p>(edit: i would like to avoid shift work, but given that i have been unemployed for a while, i’m not sure if i can afford to be choosy. </p>\n\n<p>this is for the semicon industry and the shift hours would be early morning - afternoon, afternoon - midnight, rotating once a month.</p>\n\n<p>the pros is that its really close to home (10min bike ride) but I’ll likely have to work paid OT on some weekends every month)</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Cockroaches - why are there so many even on the 6th floor HDB???",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pccpaz/cockroaches_why_are_there_so_many_even_on_the_6th/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pccpaz/cockroaches_why_are_there_so_many_even_on_the_6th/",
      "pubDate": "Tue, 2 Dec 2025 16:19:46 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pccpaz/cockroaches_why_are_there_so_many_even_on_the_6th/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Freaking hate them especially seeing one in middle of night in kitchen while on way together a drink </p>\n\n<p>How to totally get rid of them????</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What is the cycling scene like in Singapore?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pcik8z/what_is_the_cycling_scene_like_in_singapore/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pcik8z/what_is_the_cycling_scene_like_in_singapore/",
      "pubDate": "Tue, 2 Dec 2025 19:52:38 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pcik8z/what_is_the_cycling_scene_like_in_singapore/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>What is it like cycling in Singapore? </p>\n\n<p>Is cycling something lots of people in the city do? </p>\n\n<p>Does Singapore have lots of people who commute by cycling? </p>\n\n<p>Is it safe to cycle in Singapore? Or do you have to worry a lot about vehicles running you over? </p>\n\n<p>Is there lots of infrastructure for cyclists, like bike paths or mutli-use paths?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Why don’t MRT operators/telcos install more cellular equipment to handle peak-hour congestion underground?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pc5en7/why_dont_mrt_operatorstelcos_install_more/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pc5en7/why_dont_mrt_operatorstelcos_install_more/",
      "pubDate": "Tue, 2 Dec 2025 10:48:10 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pc5en7/why_dont_mrt_operatorstelcos_install_more/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I get that network congestion is a real technical limitation around the world where thousands of commuters crowding into the same underground space will naturally saturate the available bandwidth. But given how reliant people are on mobile data (work messages, transport apps, payments, etc.), I’m wondering:</p>\n\n<p>Why can’t train operators or telcos deploy more infrastructure (e.g., small cells, repeaters, or additional distributed antenna systems) in tunnels and stations to improve capacity during peak hours?</p>\n\n<p>Is it because of\n• technical limitations,\n• cost of installation/maintenance,\n• regulatory constraints, or\n• something else?</p>\n\n<p>Also, doesn’t IMDA have minimum QoS requirements for mobile networks, even underground? If so, how is the current situation during peak hour considered compliant?</p>\n\n<p>Would love to hear from anyone working in telcos, transport engineering, or who knows the backend of how MRT connectivity is actually managed.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "what and how to buy things in wet market?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbzh2a/what_and_how_to_buy_things_in_wet_market/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbzh2a/what_and_how_to_buy_things_in_wet_market/",
      "pubDate": "Tue, 2 Dec 2025 04:47:10 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbzh2a/what_and_how_to_buy_things_in_wet_market/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>hi i’ve never bought groceries from wet markets before but i think it’s relatively cheaper than ntuc n giant? want to start going here also to #support local lol</p>\n\n<p>but i a bit scared the ppl start throwing tomatoes at me if i say smth or do smth wrong 😭 </p>\n\n<p>can you guys let me know what to take note of and what you guys usually buy from the markets so i have a better idea on what to expect and buy? i’ve walked around some a few times but nvr bought anyth. will they ever up the prices or alw fair one? </p>\n\n<p>thanks! </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Anyone choose to be a Paramedics SCDF or a Nurse?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pc2r8v/anyone_choose_to_be_a_paramedics_scdf_or_a_nurse/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pc2r8v/anyone_choose_to_be_a_paramedics_scdf_or_a_nurse/",
      "pubDate": "Tue, 2 Dec 2025 07:56:22 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pc2r8v/anyone_choose_to_be_a_paramedics_scdf_or_a_nurse/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I enjoy helping people and want a fulfilling job where I can make a difference. I’m wondering if anyone has ever had to choose between these two roles, and why you would choose one over the other?</p>\n\n<p>Thank you in advance 🙏🏻</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "i want to use native flowers for wedding in SG",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pccv6v/i_want_to_use_native_flowers_for_wedding_in_sg/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pccv6v/i_want_to_use_native_flowers_for_wedding_in_sg/",
      "pubDate": "Tue, 2 Dec 2025 16:25:44 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pccv6v/i_want_to_use_native_flowers_for_wedding_in_sg/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>are there any florist recommendations for local/South East Asian bouquets and floral decorations </p>\n\n<p>also open to growing my own flowers at home !! please share any flowers that grow well in Singapore that you would love to use in a bouquet  </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How to deal with family member's bad temper?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbvj4j/how_to_deal_with_family_members_bad_temper/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbvj4j/how_to_deal_with_family_members_bad_temper/",
      "pubDate": "Tue, 2 Dec 2025 01:41:55 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbvj4j/how_to_deal_with_family_members_bad_temper/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>My brother (late twenties) temper has been getting from bad to worse. He is angry most of the time, stomping at home, glaring at us, slamming things, hostile tone. When he really explodes he would threaten me to teach me a lesson, or hit me (rarely as I would lock the door to protect myself).</p>\n\n<p>This bad temper started during NS and gotten worse in his new job which requires shift work. </p>\n\n<p>I&#39;m walking on eggshells and on a verge of a panic attack when he&#39;s at home. When confronted he would deny that he is angry or wouldn&#39;t tell us the reason he is angry. </p>\n\n<p>To add on, he can be egoistic and delusional making it hard for us and others to communicate with him. Parents have tried talking things out with him, suggesting him to go for counselling but he feels that he does not have a problem, sustaining the issue.</p>\n\n<p>What should me and my parents do? I&#39;m not sure how long I can tahan his behaviour. Moving out is not an option now. If you have or know of someone with bad temper and managed to overcome it please feel free to share as well. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "secondhand and thirdhand smoke are causing my child and our whole family immense suffering",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbet8k/secondhand_and_thirdhand_smoke_are_causing_my/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbet8k/secondhand_and_thirdhand_smoke_are_causing_my/",
      "pubDate": "Mon, 1 Dec 2025 14:55:03 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbet8k/secondhand_and_thirdhand_smoke_are_causing_my/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>For the past few years, my entire neighbourhood has smelled like one giant ashtray after 8pm. People smoke at the park, the void deck, and even right outside the food court. Most of these areas are supposed to be non-smoking zones, but the rules are completely ignored. </p>\n\n<p>My child was born with underdeveloped lungs and a weak heart, so the situation affects us even more. Our clothes keep picking up secondhand smoke, and we’re exposed to it every time we enter or leave the house. Because of that, my child has been having more frequent asthma attacks, trouble breathing, and just last week even coughed up blood. I had to take her to the hospital. The doctor diagnosed my child with acute bronchitis, caused by long-term exposure to secondhand smoke and clothes contaminated with thirdhand smoke. and the doctor also advised us not to hang our clothes outside and to keep the windows closed. But we are a low-income family, the elderly at home already have health issues that are expensive to manage. We can’t afford a dryer, an air purifier, or the extra electricity anymore. And still every single day, we have to walk through smoke just to get around our own neighbourhood. I’ve been in so much pain because of this. Sometimes I can’t help but think if only I could have given my child fully developed lungs during my pregnancy, maybe she wouldn’t be suffering like this now.</p>\n\n<p>We’ve reported this many times, but nothing has changed. NEA always gives us a very standard reply and says the issue has been “resolved” but I can tell you the situation has only gotten worse in the past few months, maybe it’s because many vapers quit vaping and went back to cigarettes. Last month, I once requested an uncle who was riding the lift with my child and me, to not smoke in the lift. Then he verbally abused me, nearly hit me, and even blew smoke directly at my child, leaving me carrying fear all the way home. </p>\n\n<p>Secondhand and thirdhand smoke are far more serious than people realize. For a financially strained family like ours, life is already hard enough. Without proper enforcement and legal protection, we can’t even have something as basic as clean air, one of the most fundamental things everyone should be able to rely on.</p>\n\n<p>If smokers stayed in the designated smoking areas, no one would be affected and there would be no problem. But now they’ve become increasingly reckless and inconsiderate. My family and I are living in constant discomfort, and I don’t think I’m the only one struggling with this secondhand smoke issue. We’re just an ordinary financially strained household as we can’t even afford a dryer to protect our clothes from the smoke. I’m not asking for the world to feel sorry for us, but it’s hard to watch my child suffer from asthma and breathing problems because of something we have no control over. </p>\n\n<p>I understand that the government strictly regulate vaping, but I hope they also realize that after banning vapes, smokers start lighting up freely in non-smoking areas, and that this situation needs stronger enforcement. What can I do to make the government take this seriously and enforce stronger laws to stop this secondhand smoke problem?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Got ghosted after a verbal offer. Should I contact the hiring manager?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pc2zj8/got_ghosted_after_a_verbal_offer_should_i_contact/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pc2zj8/got_ghosted_after_a_verbal_offer_should_i_contact/",
      "pubDate": "Tue, 2 Dec 2025 08:10:32 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pc2zj8/got_ghosted_after_a_verbal_offer_should_i_contact/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been interviewing with the company since September, and received a verbal offer a month ago. I got back to her stating that I have another offer and  she told me she could match (about a 30% increase) and said she would speak to the partner regarding a higher increase. During the conversation, she even offered me to speak to the partner and the hiring manager to discuss career prospects in the company as a means to convince me to choose them instead.</p>\n\n<p>I haven’t heard from her since and it’s been close to 3 weeks. I followed up with her twice only to get no response. I understand that things might have changed and/or they chose a cheaper candidate but to be ghosted after receiving an offer and corresponding for months is an insane and dick move. It shows a complete disregard for that person.</p>\n\n<p>Not sure if HR is going rogue and treating candidates like shit the moment it doesn’t serve them, but I was thinking if I could reach out to the hiring manager thanking for his time and expressing interest, while also throwing it out there that I’ve been waiting to hear from HR since before I move on to the next company.</p>\n\n<p>What do you guys think?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Tip of my tongue - need help remembering the name of this one old channel 8 show with a catchy tune",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbyo9p/tip_of_my_tongue_need_help_remembering_the_name/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbyo9p/tip_of_my_tongue_need_help_remembering_the_name/",
      "pubDate": "Tue, 2 Dec 2025 04:07:02 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbyo9p/tip_of_my_tongue_need_help_remembering_the_name/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hey folks, I was wondering if some of the older folks and elder millennials might help me out on this question. It’s going to be challenging because I only remember bits and fragments of information. </p>\n\n<p>Here’s what I remember</p>\n\n<ol>\n<li>It’s a local Chinese drama from the 90s (probably circa 1992-1997)</li>\n<li>It might have had chew chor Meng starring it this (but I can’t confirm)</li>\n<li>The main title song had a chorus that repeated 为什么 (Wei Shen Me / or “why”) as part of the lyrics. </li>\n</ol>\n\n<p>My mandarin is bad and I really can only remember the 为什么 part but it’s been nagging at me for a long time now that I’ve not been able to find the song haha. </p>\n\n<p>It had a intro song</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Moving into commodities as a career",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pcayvh/moving_into_commodities_as_a_career/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pcayvh/moving_into_commodities_as_a_career/",
      "pubDate": "Tue, 2 Dec 2025 15:13:44 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pcayvh/moving_into_commodities_as_a_career/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>[Cross-posting here for more exposure]</p>\n\n<p>Hi all, I am currently exploring a move into commodities &amp; am hoping to seek some advice. \nMy current background (just the high-level info as I do not want to be outed):</p>\n\n<ul>\n<li>Data sci degree from NUS</li>\n<li>Recently graduated, currently working at an ecommerce tech company as a data analyst</li>\n<li>Most relevant exp: data analyst internship at a small commodities-related startup </li>\n</ul>\n\n<p>I understand that this sort of bg is rare-ish in commodities &amp; I cldn’t rly find any posts that had similar situations (&amp; also within SG context). However, I don’t think I want to work in ecommerce in the long term &amp; I thought back abt my previous internship exp, and realised that I’d like to explore a potential career if possible. </p>\n\n<p>Currently, I hope to start off from trade operations/trading analyst related roles and eventually move to the trading desk. I think these kind of starting roles are the closest to my current internship &amp; full-time experience.</p>\n\n<p>Two questions:</p>\n\n<ol>\n<li><p>I understand that the commodities market is quite dependent on experience and knowledge - if I don’t have full-time work experience, what’s a good way to show on my resume that I am truly interested?</p></li>\n<li><p>How could I make my previous data analyst experiences more relevant? I tried putting the descriptions through ChatGPT but honestly it still seems quite different from what a typical analyst role requires. </p></li>\n</ol>\n\n<p>Eg: I don’t have any experience in PnL reporting as what I currently do is very far away from those aspects of the business. </p>\n\n<p>Would really appreciate any advice! TIA :-)</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What happens to flare when a SC spouse dies with no family behind and only has a foreign spouse on LTV?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pcjykd/what_happens_to_flare_when_a_sc_spouse_dies_with/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pcjykd/what_happens_to_flare_when_a_sc_spouse_dies_with/",
      "pubDate": "Tue, 2 Dec 2025 20:45:05 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pcjykd/what_happens_to_flare_when_a_sc_spouse_dies_with/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>What will HDB do if a Singapore citizen who owns a HDB passes on, and has no family except a foreign spouse who is listed as an occupier? Will HDB gain possession of the flat and liquidate and pass it own to the spouse, assuming the citizen left a will bequeathing everything to the foreign spouse living in Singapore? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What’s the best cheese from the supermarket to make cheesy toast?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pc6laf/whats_the_best_cheese_from_the_supermarket_to/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pc6laf/whats_the_best_cheese_from_the_supermarket_to/",
      "pubDate": "Tue, 2 Dec 2025 11:57:33 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pc6laf/whats_the_best_cheese_from_the_supermarket_to/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Want to find a cheese that’s easy to toast with bread in the oven. Any recommendations from either cold storage or NTUC?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Does anyone know what happened to Mr Mystery?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pc12ic/does_anyone_know_what_happened_to_mr_mystery/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pc12ic/does_anyone_know_what_happened_to_mr_mystery/",
      "pubDate": "Tue, 2 Dec 2025 06:12:42 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pc12ic/does_anyone_know_what_happened_to_mr_mystery/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Their last book was published in 2020. Since then, crickets. I even emailed Flame of the Forest to ask but was met with even more crickets. Has it been discontinued? If so, does anyone know why? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "what is normal working hours in singapore, how to find a actual 9-5... most are over those times",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbem4n/what_is_normal_working_hours_in_singapore_how_to/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbem4n/what_is_normal_working_hours_in_singapore_how_to/",
      "pubDate": "Mon, 1 Dec 2025 14:46:49 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbem4n/what_is_normal_working_hours_in_singapore_how_to/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Are entry level jobs supposed to be longer than 9-6 pm .... like 9-6:45 which is basically 9-7 pm... it seems really long and added with travel time is so much longer than expected especially compared to Australia... its literally 50 hours instead of 38 hours... </p>\n\n<p>Is this normal? Or its possible to have shorter hours in office job.. This is design job btw</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How to extend visa for former helper who is visiting?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pc64g3/how_to_extend_visa_for_former_helper_who_is/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pc64g3/how_to_extend_visa_for_former_helper_who_is/",
      "pubDate": "Tue, 2 Dec 2025 11:30:08 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pc64g3/how_to_extend_visa_for_former_helper_who_is/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone, i need advice regarding visa for someone visiting SG. My family and I flew my retired helper of 24 years to SG from the Philippines to visit us and be there for the birth and 1st month of my niece. She’s pretty much me and my sibling’s godmother at this point as she sacrificed 24 years of her life to raise us.</p>\n\n<p>We have applied for invitation letter from the Philippines embassy for her to visit family and friends in Singapore for 2 months from 22/11/25 to 31/01/26 which was approved. </p>\n\n<p>On the day of her flight, at Manila airport check in. She was told by the check in counter to book an earlier return flight because she is only allowed to stay for 30 days which we are not aware of. In order for her to get on her flight we had to book a return flight for 21/12/25.</p>\n\n<p>We are wondering since the Philippines embassy has approved for her to stay till the 31/01/26. Are we able to extend her stay till the 31/01/26 so she can be there for the infant’s 1st month party? And if so, how do we apply for extension?</p>\n\n<p>Any advice would be appreciated!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What are the precautions and contingency plans when driving into Malaysia?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbtdgw/what_are_the_precautions_and_contingency_plans/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbtdgw/what_are_the_precautions_and_contingency_plans/",
      "pubDate": "Tue, 2 Dec 2025 00:07:55 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbtdgw/what_are_the_precautions_and_contingency_plans/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hello, what are the precautions and contact points y’all have when driving up north?</p>\n\n<p>Example, say when car tyre puncture / car breakdown along highway or in carpark, who do you call? And to tow where? I presume if it’s a battery you will get it settled at nearby workshop instead of towing to SG.</p>\n\n<p>Also, if car is undrivable, how do you all get back into SG? Really just take a taxi to the customs?</p>\n\n<p>Any other precautions and contingency plans to share?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Lacking behind and feeling burnout",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbcbmr/lacking_behind_and_feeling_burnout/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbcbmr/lacking_behind_and_feeling_burnout/",
      "pubDate": "Mon, 1 Dec 2025 13:07:58 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbcbmr/lacking_behind_and_feeling_burnout/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys! 32M and single here with a new job role with only 3k pay. It feels like I am lacking behind in life so much already as compared to others. All my younger colleagues were asking me why I took up this role because I seem educated and deserved so much better. This got me to question myself if I am doing this right. </p>\n\n<p>Backstory: </p>\n\n<p>1) Took longer time to graduate due to bad mental health. Mental state has cause me to suffered a lot. Not even a local uni grad. </p>\n\n<p>2) Did sales role but didn’t last. Jobs like ops and contract job didn’t last long either. I am too scattered.</p>\n\n<p>3) Did a swimming instructor part time job in the weekend for extra income and setting it as a backup for the long run. Recently completed a freelance coding instructor role under MOE going around primary school to teach coding and AI. </p>\n\n<p>4) Not much savings due to the fact that I have closed myself off so much in my 20s due to my failure and mentally ill mother influence. Covid lockdown didn’t help either.</p>\n\n<p>Current state:</p>\n\n<p>1) New role with only 3k but it’s very tiring due to the demands of being a backend support. </p>\n\n<p>2) Got an offer to continue the freelance coding trainer with a 50% bump in rate but unsure if I can commit to it due to me having a full time now. </p>\n\n<p>3) Mental state is still in a burnout state and feeling like a constant blur on a daily basis. Even my colleagues noticed this and are concerned about me. </p>\n\n<p>TDLR; I am way behind in life. I am burning out while looking at how screwed my career is now. I can only blame myself for not being strong enough and let my environment influence me and now I am suffering for it. My resume is screwed too so at this point in time, I wasn’t sure how I can keep this up all the time. I envy how others are able to do it while I don’t have the capacity to even be able to fake a smile and keep my heads up. </p>\n\n<p>I don’t have a lot of people to talk to either since most of my friends have their own family and talking to my own family would only make me feel worst because I don’t feel heard at all. </p>\n\n<p>I used to be ambitious and I want to give my family a better life by changing things. Nobody listens to the advices I shared despite my warnings on how I see certain things coming. In the end we all suffered because nobody listens and I don’t know when I got into this mental spiralling even though I suspected I have anxiety issues since young.  </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Deep cleaner recommendations for new resale flats",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbtvjo/deep_cleaner_recommendations_for_new_resale_flats/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbtvjo/deep_cleaner_recommendations_for_new_resale_flats/",
      "pubDate": "Tue, 2 Dec 2025 00:28:54 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbtvjo/deep_cleaner_recommendations_for_new_resale_flats/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hello! My partner and I are getting the keys to our resale flat soon and we don&#39;t plan on doing any major reno, because the previous owner left a lot of in built features that can still be used. But we want to hire some professionals to do a 1 time deep clean of everything before we move in. Has anyone used these services before? Any to recommend or avoid? What did they clean for you? What did they not clean?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Is drilling work allowed at night in mixed residential units?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pccqy7/is_drilling_work_allowed_at_night_in_mixed/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pccqy7/is_drilling_work_allowed_at_night_in_mixed/",
      "pubDate": "Tue, 2 Dec 2025 16:21:23 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pccqy7/is_drilling_work_allowed_at_night_in_mixed/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I stay in a mixed residential unit where level 1 has restaurants and other shops.\nI woke up at midnight to drilling noise and found out the source to be a renovation work in one of the restaurants at level 1. </p>\n\n<p>They were carrying out drilling and renovation without a notice stuck on the front. When I asked them why are they drilling at midnight, the contractor told me it’s approved by management.</p>\n\n<p>I looked up and found only about noise levels <a href=\"https://www.oneservice.gov.sg/docs/default-source/default-document-library/noise-infosheet.pdf\">https://www.oneservice.gov.sg/docs/default-source/default-document-library/noise-infosheet.pdf</a></p>\n\n<p>I want to know if this is permissible before bringing this up with apartment admin.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Issue with Starhub Prepaid Plan and Card",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pccnbg/issue_with_starhub_prepaid_plan_and_card/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pccnbg/issue_with_starhub_prepaid_plan_and_card/",
      "pubDate": "Tue, 2 Dec 2025 16:17:47 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pccnbg/issue_with_starhub_prepaid_plan_and_card/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi, so the past few years I have been using the prepaid app to top up my mobile data plan each month. Recently they sent me SMS saying I have been upgraded to 5GB plan and the first month is free. All was well, though the prepaid app said invalid number so I went ahead and set up the new Starhub app. But then I tried to top up and it says you need to be atleast 18 or above(because it also asks to verify Singpass) I got debit card to my name and they never asked for my age in the former app?? The AXS machines in the mall also say invalid number too when I try to top up. What can I do? The card has been prepaid from the start, and there was no changes that I did or my dad did to the card or converted it to Postpaid. Please respond if you had similar issues!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Community for delivery work in sg?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pcb2b0/community_for_delivery_work_in_sg/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pcb2b0/community_for_delivery_work_in_sg/",
      "pubDate": "Tue, 2 Dec 2025 15:17:32 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pcb2b0/community_for_delivery_work_in_sg/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Planning to start doing grab delivery by bicycle, and im wondering if theres a community for delivery work in sg where i can ask for insight and general advice? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    }
  ],
  "group": "country",
  "url": "https://redlib.perennialte.ch/r/askSingapore.rss",
  "lastFetched": "2025-12-02T22:36:24.367Z"
}