{
  "title": "Mothership.SG - News from Singapore, Asia and around the world",
  "description": "Mothership.SG - News from Singapore, Asia and around the world",
  "link": "https://mothership.sg",
  "items": [
    {
      "title": "Afghan man shoots 2 National Guard soldiers near the White House",
      "link": "https://mothership.sg/2025/11/afghan-national-shoots-national-guard-white-house/",
      "guid": "https://mothership.sg/2025/11/afghan-national-shoots-national-guard-white-house/",
      "pubDate": "2025-11-27T16:18:43",
      "description": "It is not known if the White House was a target.",
      "content": "<img class=\"type:primaryImage\" src=\"https://static.mothership.sg/1/2025/11/white-house-down.jpg\"/> <p><a href=\"https://bit.ly/3qgqzHg\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/07/telegram-button.png\" alt=\"Telegram\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872229\" /></a><a href=\"https://bit.ly/3KjTj94\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/07/whatsapp-button.png\" alt=\"Whatsapp\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872230\" /></a>\r</p><p>Two members of the United States National Guard have been shot near the White House, prompting U.S. President Donald Trump to call for the reexamination of the immigration statuses of all Afghan refugees.\r</p><p><h2>2 blocks from the White House</h2>\r</p><p>On Nov. 26, two members of the West Virginia National Guard were attacked by a lone shooter, who was himself shot.\r</p>\n<p>All three men are in critical condition.\r</p><p>The attack, which was described by Jeffrey Carrol, the executive assistant chief of the Washington D.C. police, as an ambush, according to <a href=\"https://www.washingtonpost.com/dc-md-va/2025/11/26/national-guard-shooting-white-house-washington/\" target=\"_blank\" rel=\"noopener noreferrer\"><em>The Washington Post</em></a>.\r</p><p>Carrol said that the attacker had come “around the corner” and “immediately started firing a firearm”, and was shot several times in return.\r</p><p>It has not yet been confirmed who shot the assailant, but local media reported that other guardsmen in the area responded to the attack quickly.\r</p><p>The <em><a href=\"https://www.bbc.com/news/articles/c3r7qpqddnro\" target=\"_blank\" rel=\"noopener noreferrer\">BBC</a></em> reported that the attack occurred about “two blocks” from the White House, or about 500 metres.\r</p><p><h2>Afghan national</h2>\r</p><p>The suspect in the shooting has been identified as Rahmanullah Lakanwal, an Afghan national who entered the U.S. as part of the previous U.S. president Joe Biden’s policy of allowing entry to Afghans who had aided the U.S. military, during its two-decade-long occupation.\r</p><p>Biden himself released a statement on social media saying that \"violence of any kind is unacceptable\", and he and his wife are praying for the service members and their families.\r</p><p>FBI director Kash Patel said that the attack was “targeted”, but it has not been confirmed whether Rahmanuallah intended to attack other targets.\r</p><p>The attack prompted a furious response from Trump, who called the suspect “an animal”, a “foreigner who entered our country from Afghanistan, which he called a “hellhole on earth”.\r</p><p>He called the attack “heinous” and an act of hatred and terror.\r</p><p>He blamed the Biden-era policy as the cause of the attack, saying that the attack \"underscores the single greatest national security threat facing our nation”.\r</p><p>Trump said that all Afghans who had entered the U.S. as part of Biden’s policy should be \"reexamined\", saying that “and we must take all necessary measures to ensure the removal of any alien from any country who does not belong here or add benefit to our country”.\r</p><p><h2>Additional troops</h2>\r</p><p>The National Guard is a type of reserve unit of the U.S. military, and in the past two decades it has been deployed to fight in various conflicts around the world, such as the occupation of Afghanistan and Iraq.\r</p><p>But in the past year, Trump has taken the controversial move of deploying the guard to U.S. cities, ostensibly to fight criminality in those cities.\r</p><p>The cities, which include Washington D.C. and Chicago, are often politically Democratic and usually oppose such deployments.\r</p><p>The crime rate in Washington D.C. has been in decline in recent years, but has more steeply <a href=\"https://www.bbc.com/news/articles/c3r7qpqddnro\" target=\"_blank\" rel=\"noopener noreferrer\">declined</a> since the deployment of the National Guard.\r</p><iframe class='post-embed title='Afghan man shoots 2 National Guard soldiers near the White House' style='min-height: 350px;' clip: rect(1px, 1px, 1px, 1px);' src='/2025/06/trump-sends-over-2000-national-guards-700-marines-to-quell-immigration-protests-in-los-angeles/embed/' width='600' frameborder='0' marginwidth='0' marginheight='0' scrolling='no'></iframe><p>These guardsmen are usually used to patrol the streets of the Capitol.\r</p><p>In reaction to the shooting, Trump has ordered an additional 500 guardsmen to be deployed, adding to a task force of about 2,375 troops.\r</p><p>The attack also occurred on the eve of Thanksgiving, the U.S.’s largest secular national holiday, causing significant disruptions as major roads were shut down, and the Ronald Reagan Washington National Airport, a central air travel hub, was briefly shut down.\r</p><p><em>Top image via AFP</em></p></p>",
      "thumbnail": "https://static.mothership.sg/1/2025/11/white-house-down.jpg"
    },
    {
      "title": "Grab driver allegedly slapped by BYD driver after getting honked outside State Courts",
      "link": "https://mothership.sg/2025/11/byd-driver-slaps-grab-driver-honk/",
      "guid": "https://mothership.sg/2025/11/byd-driver-slaps-grab-driver-honk/",
      "pubDate": "2025-11-27T15:20:01",
      "description": "He has lodged a police report.",
      "content": "<img class=\"type:primaryImage\" src=\"https://static.mothership.sg/1/2025/11/photo_2025-11-27-13.56.38.jpeg\"/> <p><a href=\"https://bit.ly/3qgqzHg\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/07/telegram-button.png\" alt=\"Telegram\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872229\" /></a>\r</p><p><a href=\"https://bit.ly/3KjTj94\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/08/wa-button.png\" alt=\"Whatsapp\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872230\" /></a>\r</p><p>On Oct. 31, a Grab driver was allegedly slapped by the driver of the car in front of him.\r</p><p>According to a <a href=\"https://www.facebook.com/reel/2055809548592411\" target=\"_blank\" rel=\"noopener noreferrer\">video</a> posted on SGRV's Facebook page, the incident happened at around 6:24pm along Park Crescent, near the State Courts at 1 Havelock Square.\r</p>\n<p>In the muted video, a man dressed in a white shirt could be seen getting out of the driver's seat of a black BYD car while raising his arms.\r</p><p>He then walked over to the car behind him, stayed there for a few seconds, before walking back to his car.\r</p><p>The video did not depict the altercation, if any, between the two drivers.\r</p><p>Speaking to <em>Mothership,</em> the Grab driver who only wants to be known as \"Mr G\" explained that he was sending a passenger to their destination when the BYD stopped for \"no reason\".\r</p><p>Mr G then pressed his horn when the BYD driver got out of his car and approached his car.\r</p><p>He then wound down his window to ask the BYD driver why he stopped his car, since there were no cars in front of him.\r</p><p>Instead, he allegedly received two slaps.\r</p><p>\"I was shocked and told him I have witnesses in my car. He challenged me to go out but I did not,\" Mr G said.\r</p><p>He added: \"My parents don't even slap me, so who is he to do so?\"\r</p><p>Mr G lodged a police report.\r</p><p><em>Mothership</em> has reached out to the police for more information.\r</p><p><em>Top image from SGRV.</em></p></p>",
      "thumbnail": "https://static.mothership.sg/1/2025/11/photo_2025-11-27-13.56.38.jpeg"
    },
    {
      "title": "S'pore embassy in Bangkok getting vans to evacuate S'poreans affected by Hat Yai floods",
      "link": "https://mothership.sg/2025/11/spore-embassy-bangkok-hat-yai/",
      "guid": "https://mothership.sg/2025/11/spore-embassy-bangkok-hat-yai/",
      "pubDate": "2025-11-27T14:31:21",
      "description": "More updates.",
      "content": "<img class=\"type:primaryImage\" src=\"https://static.mothership.sg/1/2025/11/fas-cover-pics-75.jpg\"/> <p><a href=\"https://bit.ly/3qgqzHg\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/07/telegram-button.png\" alt=\"Telegram\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872229\" /></a>\r</p><p><a href=\"https://bit.ly/3KjTj94\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/08/wa-button.png\" alt=\"Whatsapp\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872230\" /></a>\r</p><p>The Singapore Embassy in Bangkok is arranging for vans to evacuate Singaporeans affected by the Hat Yai floods.\r</p><p>In a Facebook post on Nov. 27, the embassy shared that land transportation from Central Hat Yai and Hat Yai International Airport is now possible as current ground conditions have \"improved\".<div class='fb-post' data-href='https://www.facebook.com/SingaporeEmbassyBangkok/posts/pfbid02BSod545qMw4ZcpVwEj3Yz3HThb4HXjf3xDjwNw37djEuiiHacvJg38tzKKwRpRYal'></div>The embassy strongly encouraged Singaporeans to make their way to Central Hat Yai if they can.\r</p>\n<p>Due to the uncertain traffic conditions, the vans may take some time before reaching Central Hat Yai.\r</p><p>The embassy will provide more updates as soon as possible.\r</p><p><h3>Related stories</h3>\r</p><iframe class='post-embed title='S'pore embassy in Bangkok getting vans to evacuate S'poreans affected by Hat Yai floods' style='min-height: 350px;' clip: rect(1px, 1px, 1px, 1px);' src='/2025/11/hat-yai-flood-singaporeans-stranded/embed/' width='600' frameborder='0' marginwidth='0' marginheight='0' scrolling='no'></iframe><iframe class='post-embed title='S'pore embassy in Bangkok getting vans to evacuate S'poreans affected by Hat Yai floods' style='min-height: 350px;' clip: rect(1px, 1px, 1px, 1px);' src='/2025/11/people-trapped-hat-yai-hotel-sos-signals/embed/' width='600' frameborder='0' marginwidth='0' marginheight='0' scrolling='no'></iframe><p><em>Top image from Bangkok Community Help Foundation.</em></p></p>",
      "thumbnail": "https://static.mothership.sg/1/2025/11/fas-cover-pics-75.jpg"
    },
    {
      "title": "Police NSF, 19, offers 3 underage boys cash to give them blowjobs, gets rejected each time",
      "link": "https://mothership.sg/2025/11/police-nsf-lewd-acts-rejected/",
      "guid": "https://mothership.sg/2025/11/police-nsf-lewd-acts-rejected/",
      "pubDate": "2025-11-27T12:37:19",
      "description": "He also borrowed money from one of the boys.",
      "content": "<img class=\"type:primaryImage\" src=\"https://static.mothership.sg/1/2025/11/cash-for-lewd-acts.png\"/> <p><a href=\"https://bit.ly/3qgqzHg\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/07/telegram-button.png\" alt=\"Telegram\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872229\" /></a>\r</p><p><a href=\"https://bit.ly/3KjTj94\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/08/wa-button.png\" alt=\"Whatsapp\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872230\" /></a>\r</p><p>A 19-year-old Singaporean man offered cash to three underaged boys and asked to perform lewd acts on them.\r</p><p>The boys, aged 15 and 16, all rejected his offers.\r</p>\n<p>Muhammad Shafirul Danish Bin Muhammad Shaffie was a full-time National Serviceman in the Singapore Police Force (SPF) at the time.\r</p><p>He pleaded guilty on Nov. 27 to two counts of attempting to obtain sexual services from a minor, and another count of harassment.\r</p><p><em>Mothership</em> has reached out to SPF to confirm if he is still with the force.\r</p><p><h2>Asked to perform lewd acts</h2>\r</p><p>Shafirul reached out to the first victim in November 2024, according to court documents viewed by <em>Mothership</em>.\r</p><p>He befriended the teen on Instagram, and communicated with him on various social media platforms.\r</p><p>During this time, the boy told Shafirul that he was 16 years old.\r</p><p>In March 2025, Shafirul met up with the boy and borrowed S$45 from him.\r</p><p>But when he tried to get his money back, Shafirul repeatedly asked if he could \"suck\", or fellate, the boy for S$200.\r</p><p>The boy rejected his offer and asked for his S$45 back.\r</p><p>In response, Shafirul said he would not return the money unless he accepted the offer.\r</p><p>On Apr. 10, 2025, the teen lodged a police report. Shafirul was arrested on Jul. 28 and released on bail on Aug. 15.\r</p><p><h2>Asked another boy</h2>\r</p><p>But when out on bail, Shafirul messaged another boy, aged 15.\r</p><p>He had befriended the teen on TikTok in May that year, but did not ask his age.\r</p><p>During their text conversation, he asked to perform a blowjob on the minor, offering him S$279 to do so.\r</p><p>The boy rejected his offer. He did so again when Shafirul repeated his request.\r</p><p><h2>Harassed another teen</h2>\r</p><p>In November 2024, Shafirul came across a third teen and began messaging him on TikTok.\r</p><p>The teen repeatedly told him that he was 16 years old.\r</p><p>In March 2025, Shafirul asked to give the boy a blowjob and offered him S$200 to S$290.\r</p><p>He also offered the boy S$50 for a photo of his penis.\r</p><p>The teen rejected both offers.\r</p><p>In response, Shafirul began spamming the boy with messages, scolding him and pressuring him to accept his offer.\r</p><p>When the boy told him to stop messaging him, Shafirul threatened to expose his face on TikTok to shame him.\r</p><p>Afraid, the teen agreed to meet up with him.\r</p><p><h2><em>\"Sini settle boi\"</em></h2>\r</p><p>Eventually, the teen blocked Shafirul and shared his messages in a Telegram group chat that both he and Shafirul were part of.\r</p><p>He intended to warn others about Shafirul.\r</p><p>Angered, Shafirul obtained a photo of the teen's face and posted them in the same chat, demanding that he \"sini settle boi\".\r</p><p>He told the teen to delete his posts in the Telegram group chat. The teen complied to avoid further harassment.\r</p><p><h2>Threatened again</h2>\r</p><p>But the harassment didn't stop.\r</p><p>Shafirul posted another video on TikTok with a picture of the boy's face, taunting him.\r</p><p>When the boy learnt about the post, he unblocked Shafirul to ask him to stop posting about him.\r</p><p>In response, Shafirul called the teen on Telegram and repeated his offer to give him a blowjob for cash.\r</p><p>When the boy rejected him again and asked him to take down the TikTok video, Shafirul refused and told him to look for other people that he could fellate.\r</p><p>He said he was specifically looking for boys who were handsome and looked like the victim.\r</p><p><h2>Police report lodged</h2>\r</p><p>In desperation, the boy asked his older 20-year-old sister for help.\r</p><p>The woman told Shafirul to delete the posts, to which he replied that he would not do so until the boy found someone he could engage in lewd acts with.\r</p><p>She then lodged a police report on Jun. 5.\r</p><p>The court has since called for a report to assess Shafirul's suitability for reformative training. He will be sentenced on Dec. 29.\r</p><p>For attempting to obtain sexual services from a minor, he could be jailed up to two years, fined, or both.\r</p><p>For intentionally causing harassment, he could be jailed up to six months, fined up to S$5,000, or both.\r</p><p><em>Top image from Canva</em></p></p>",
      "thumbnail": "https://static.mothership.sg/1/2025/11/cash-for-lewd-acts.png"
    },
    {
      "title": "'Ayah loves you': M'sian reporter dies while on his way home from reporting on Hat Yai floods",
      "link": "https://mothership.sg/2025/11/malaysia-reporter-die-hatyai-flood/",
      "guid": "https://mothership.sg/2025/11/malaysia-reporter-die-hatyai-flood/",
      "pubDate": "2025-11-27T12:27:53",
      "description": "RIP.",
      "content": "<img class=\"type:primaryImage\" src=\"https://static.mothership.sg/1/2025/11/fas-cover-pics-6.png\"/> <p><a href=\"https://bit.ly/3qgqzHg\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/07/telegram-button.png\" alt=\"Telegram\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872229\" /></a>\r</p><p><a href=\"https://bit.ly/3KjTj94\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/08/wa-button.png\" alt=\"Whatsapp\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872230\" /></a>\r</p><p>A Malaysian reporter has died while on his way back from reporting at Hat Yai, Thailand.\r</p><p>Mohamad Asri Shafii, a reporter from Malaysia's <em>Astro Awani</em>, was in Hat Yai to report on the evacuation of Malaysians following the floods.\r</p>\n<p>He is believed to have died from a heart attack, <a href=\"https://www.astroawani.com/berita-malaysia/wakil-astro-awani-asri-shafii-meninggal-dunia-selepas-buat-liputan-banjir-549203\" target=\"_blank\" rel=\"noopener noreferrer\"><em>Astro Awani</em></a> reported.\r</p><p>Asri was 49.\r</p><p>His wife, Norhanani Ahmad, said the last voice note he sent her was: \"Ayah loves all of you, take care of yourselves.\"\r</p><p>Norhanani said that in their last conversation, Asri said that he intended to return to their home in Perlis as he was worried that the house would be affected by rising waters.\r</p><p>She added that her husband has a history of heart disease.\r</p><p><blockquote><p>\"While on his way back, my husband's car was stalled and couldn't start because of the flood.\r</p><p>He got out of his car and tried to push it, but perhaps he collapsed due to a heart attack.\"</p></blockquote>\r</p><p>He leaves behind six children, the youngest of whom is 11 years old.\r</p><p><em>Top image from Astro Awani.</em></p></p>",
      "thumbnail": "https://static.mothership.sg/1/2025/11/fas-cover-pics-6.png"
    },
    {
      "title": "3 construction company executives arrested after Hong Kong apartment fires kills at least 44",
      "link": "https://mothership.sg/2025/11/3-men-arrested-hong-kong-fire/",
      "guid": "https://mothership.sg/2025/11/3-men-arrested-hong-kong-fire/",
      "pubDate": "2025-11-27T12:27:30",
      "description": "45 are hospitalised and 279 people are missing.",
      "content": "<img class=\"type:primaryImage\" src=\"https://static.mothership.sg/1/2025/11/hk-fire.jpg\"/> <p><a href=\"https://bit.ly/3qgqzHg\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/07/telegram-button.png\" alt=\"Telegram\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872229\" /></a><a href=\"https://bit.ly/3KjTj94\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/07/whatsapp-button.png\" alt=\"Whatsapp\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872230\" /></a>Hong Kong police have arrested three construction company executives in connection with the devastating Nov. 26 fire that saw eight housing blocks catch fire and burn for nearly 18 hours.\r</p><p>The fire has been confirmed to have claimed the lives of at least 44 people, including one firefighter, with 45 people hospitalised in critical condition.\r</p><p>279 people are still missing.\r</p><p><h2>Three arrests</h2>\r</p>\n<p>The <em><a href=\"https://www.bbc.com/news/articles/cdxe9r7wjgro\" target=\"_blank\" rel=\"noopener noreferrer\">BBC</a></em> reports that three construction company executives, two directors and an engineering consultant, have been arrested on suspicion of manslaughter.\r</p><p>A Hong Kong police spokesperson was quoted as saying that the police had reasons to suspect that those in the company were “grossly negligent”.\r</p><p>The actions of the three men are believed to have led to the accident that caused the fire, and allowed it to “spread uncontrollably”, resulting in major casualties.\r</p><p>It is suspected that polystyrene, which is highly flammable, had been used around the buildings’ windows, leading to the fire’s unusually quick spread.\r</p><p>In addition, Hong Kong Authorities have discovered that the protective material and mesh covering the outside of the buildings, installed since renovations started in mid-July 2024, do not appear to be fireproof.\r</p><p><h2>Blazed through the night</h2>\r</p><p>Around 3pm on Nov. 26, Hong Kong’s emergency services were alerted to a fire in a housing complex in the Tai Po district of Hong Kong, in the New Territories.\r</p><p>The housing complex, called Wang Fuk Court, consisted of eight 31-storey tall tower blocks, with 1,984 apartments and housed about 4,600 residents.\r</p><p>The 42-year-old buildings were undergoing renovations, and as is common in Hong Kong, the buildings were clad in bamboo scaffolding and green netting.\r</p><p>A fire that had broken out in one of the blocks spread quickly to the other nearby buildings, eventually resulting in a devastating blaze that claimed all eight blocks.\r</p><p>The BBC reports that the fire spread quickly through the bamboo, and a preliminary investigation had called the speed of the fire’s spread “unusual”.\r</p><p>The fire blazed through the night, and even after dawn, several firefighting cranes could be seen pouring water onto the smouldering remains of the towers, with a few units still on fire.\r</p><p>However, as of 1:20am, the fire was considered “gradually under control”.\r</p><p><h2>Dedicated and gallant fireman</h2>\r</p><p>More than 800 firefighters and paramedics, as well as 140 fire engines, have been on the scene fighting the fire, which has burned for over 18 hours.\r</p><p>A 37-year-old firefighter, Ho Wai Ho, collapsed at the scene of the fire and was taken to the hospital, where he subsequently died.\r</p><p>Hong Kong’s director of fire services described Ho’s performance as “valiant”, and that he mourned the loss of “this dedicated and gallant fireman.”\r</p><p><h2>Condolences</h2>\r</p><p>China’s president Xi Jinping has sent his condolences, as reported by the <a href=\"https://www.scmp.com/news/hong-kong/society/article/3334217/major-fire-hong-kongs-tai-po-leaves-2-severely-burned-residents-trapped\" target=\"_blank\" rel=\"noopener noreferrer\"><em>South China Morning Post</em></a>.\r</p><p>Xi called for an “all-out effort” to extinguish the fire and minimise casualties and loss from the blaze.\r</p><p>Hong Kong’s chief executive John Lee has thanked Xi for his concern, support, and offer of assistance.\r</p><p>He also thanked Liaison Offices for Hong Kong and for Macau for their support, as he said that several neighbouring cities have also reached out to offer help.\r</p><p><em>Top image via Reuters</em></p></p>",
      "thumbnail": "https://static.mothership.sg/1/2025/11/hk-fire.jpg"
    },
    {
      "title": "S'pore beats Switzerland to become world's most talent-competitive country, 1st time in history",
      "link": "https://mothership.sg/2025/11/spore-beats-switzerland-talent-ranking/",
      "guid": "https://mothership.sg/2025/11/spore-beats-switzerland-talent-ranking/",
      "pubDate": "2025-11-27T11:09:04",
      "description": "Swiss standard of talent.",
      "content": "<img class=\"type:primaryImage\" src=\"https://static.mothership.sg/1/2025/11/swiss-singapore.png\"/> <p><a href=\"https://bit.ly/3qgqzHg\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/07/telegram-button.png\" alt=\"Telegram\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872229\" /></a>\r</p><p><a href=\"https://bit.ly/3KjTj94\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/08/wa-button.png\" alt=\"Whatsapp\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872230\" /></a>\r</p><p>Singapore, not Switzerland, is now the world's most talent-competitive country, according to a new report.\r</p><p>It took the top spot in Insead's Global Talent Competitiveness Index (GTCI) for the first time since the ranking was launched in 2013.\r</p>\n<p>In a Nov. 26 <a href=\"https://www.insead.edu/articles/newsroom/singapore-no-1-global-competition-talent\" target=\"_blank\" rel=\"noopener noreferrer\">press release</a>, the business school published its findings, which showed Switzerland slipping to second place.\r</p><p>The GTCI report covers 77 indicators across 135 countries, representing over 97 per cent of global GDP.\r</p><p>It is audited by the European Commission's Joint Research Centre.\r</p><p>Singapore was the only Asian country that made it to the top 20, with the upper rankings largely dominated by European economies.\r</p><p>Among other high-ranking Asian countries were Japan, at number 28, and South Korea, at 31.\r</p><p><h2>Why Singapore</h2>\r</p><p>The report pointed to Singapore's education system and adaptive workforce as the factors that drove it to the top spot.\r</p><p>It was ranked first for Generalist Adaptive Skills, including soft skills, digital literacy, and innovation-oriented thinking.\r</p><p>Paul Evans, co-editor of the report, also noted that economies that cultivate adaptable and AI-literate workforces tend to be better able to sustain long-term competitiveness.\r</p><p><blockquote><p>Lily Fang, Insead's dean of research and innovation, added:\r</p><p>\"This year’s report should be seen as much more than a race between nations.\r</p><p>It offers leaders thoughtful points of reflection on how to integrate powerful technologies, such as AI, into the grand pursuit of human progress.\"</p></blockquote>\r</p><p><em>Top image via Canva</em></p></p>",
      "thumbnail": "https://static.mothership.sg/1/2025/11/swiss-singapore.png"
    },
    {
      "title": "Gavin Lee to become Lions head coach, 1st local in last decade",
      "link": "https://mothership.sg/2025/11/gavin-lee-head-coach/",
      "guid": "https://mothership.sg/2025/11/gavin-lee-head-coach/",
      "pubDate": "2025-11-27T10:28:04",
      "description": "Local talent.",
      "content": "<img class=\"type:primaryImage\" src=\"https://static.mothership.sg/1/2025/11/gavin-lee-lions.png\"/> <p><a href=\"https://bit.ly/3qgqzHg\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/07/telegram-button.png\" alt=\"Telegram\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872229\" /></a>\r</p><p><a href=\"https://bit.ly/3KjTj94\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/08/wa-button.png\" alt=\"Whatsapp\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872230\" /></a>\r</p><p>Local football coach Gavin Lee, 35, is set to become the Lions' permanent head coach, reported local media.\r</p><p>Lee, who brought the Singapore national team to a historic Asian Cup qualification on Nov. 18, was previously interim head coach.\r</p>\n<p>He will be the Football Association of Singapore's (FAS) first permanent local coach since 2016.\r</p><p><h2>Historic win</h2>\r</p><p>Lee was appointed interim head coach after former head coach Tsutomu Ogura departed in June this year.\r</p><p>The Nanyang Technological University (NTU) alumnus was previously head coach of the BG Tampines Rovers.\r</p><p>During the Asian Cup qualifier, he led the Lions to a 2-1 win against Hong Kong, sending Singapore to the Asian Cup on merit for the first time in its history.\r</p><p>This led to calls for him to be appointed permanent head coach, despite earlier rumours of the FAS courting another foreign talent.\r</p><iframe class='post-embed title='Gavin Lee to become Lions head coach, 1st local in last decade' style='min-height: 350px;' clip: rect(1px, 1px, 1px, 1px);' src='/2025/11/comment-gavin-lee-full-time-head-coach/embed/' width='600' frameborder='0' marginwidth='0' marginheight='0' scrolling='no'></iframe><p><h2>Accepted offer</h2>\r</p><p>The interim head coach was offered the full-time role and has accepted the offer, <a href=\"https://www.channelnewsasia.com/sport/football-gavin-lee-set-be-named-permanent-lions-head-coach-5492166\"><em>CNA</em></a> reported.\r</p><p>He is scheduled to sign the contract on Nov. 27.\r</p><p>An official announcement will follow the signing of the 18-month contract, according to <a href=\"https://www.straitstimes.com/sport/football/gavin-lee-set-to-be-announced-as-lions-coach\" target=\"_blank\" rel=\"noopener noreferrer\"><em>The Straits Times</em></a>.\r</p><p>\"Nothing’s been signed yet, but to be even considered in the first place, it’s a privilege, something I’ve mentioned many times before.\r</p><p>And ultimately, just like when I first started (as interim coach), all I want is the best for the national team and to continue the progress that I think we’ve made in the last few windows,\" he said.\r</p><p>As part of his new role, he is expected to lead the Lions to the 2026 Asean Championship and the 2027 Asian Cup.\r</p><p><h2>Related story</h2>\r</p><iframe class='post-embed title='Gavin Lee to become Lions head coach, 1st local in last decade' style='min-height: 350px;' clip: rect(1px, 1px, 1px, 1px);' src='/2025/11/lion-city-sailors-million-payout/embed/' width='600' frameborder='0' marginwidth='0' marginheight='0' scrolling='no'></iframe><p><em>Top image from Mothership and FAS/Singapore</em></p></p>",
      "thumbnail": "https://static.mothership.sg/1/2025/11/gavin-lee-lions.png"
    },
    {
      "title": "She deserves it: S'pore cat groomer who called customer 'stingy b*tch' says she won't tolerate bullying",
      "link": "https://mothership.sg/2025/11/cat-groomer-stingy-bitch/",
      "guid": "https://mothership.sg/2025/11/cat-groomer-stingy-bitch/",
      "pubDate": "2025-11-27T10:27:47",
      "description": "Luwi added that she has been in the business since 2016 and does not tolerate \"bullying behaviour\" from customers who seek to ruin her shop's reputation.",
      "content": "<img class=\"type:primaryImage\" src=\"https://static.mothership.sg/1/2025/11/stingy-btch-cat-groomer.png\"/> <p><a href=\"https://bit.ly/3qgqzHg\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/07/telegram-button.png\" alt=\"Telegram\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872229\" /></a>\r</p><p><a href=\"https://bit.ly/3KjTj94\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/08/wa-button.png\" alt=\"Whatsapp\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872230\" /></a>\r</p><p>The groomer behind a spiel of controversial customer interactions has spoken up in her defence.\r</p><p>Luwi, who runs Furries Inc cat grooming in Clementi, recently came under fire after she responded to a customer's Google review with a flurry of angry expletives.\r</p>\n<p>This included calling her a \"stingy b*tch\".\r</p><p>The customer, Sherni, had sent her cat, Gemok, for grooming and was upset after being charged a S$50 \"fierce cat\" fee.\r</p><p><h2>Not fierce: Owner</h2>\r</p><p><span style=\"box-sizing: border-box; margin: 0px; padding: 0px;\">Luwi posted their correspondence in a <a href=\"https://www.facebook.com/vetprincess/posts/pfbid0DSEsJ2TaQ7a6tiGQRMtDDjd2kX8reXCEvG9UdSMNwz1rnMzDJsUygkZEdBAqZShCl?rdid=b13xTAeadqBqDdHo#\" target=\"_blank\" rel=\"noopener noreferrer\">Nov. 22 Facebook post</a>, detailing the argument between the groomer and the customer.</span>\r</p><p>Sherni had contacted her to dispute the \"fierce cat\" surcharge, saying that she would have agreed with the lesser \"struggling\" charge.\r</p><p>\"Struggling\" warrants a less expensive S$30 surcharge, according to the price list.\r</p><p>\"Gemok is not fierce at all,\" she wrote. \"It's normal for cats to be struggling and meowing especially in a new environment.\"\r</p><p>She added that she had eventually paid, but she was \"never coming back\".\r</p><p><h2>Angry expletives</h2>\r</p><p>In response, Luwi said that Gemok was not cooperating and one of the groomers had gotten scratched by him.\r</p><p>She also sent over a photo and video of the grooming session as evidence.\r</p><p>\"Hope you understand sis,\" she said.\r</p><p><figure id=\"attachment\" aria-describedby=\"caption-attachment\" style=\"width: 664px\" class=\"wp-caption aligncenter\">\n  <figcaption id=\"caption-attachment-468423\" class=\"wp-caption-text\">\n    <img src=\"https://static.mothership.sg/1/2025/11/Untitled-design-8-1.png\" alt=\"\" width=\"664\" height=\"1440\" class=\"wp-image-1101360 size-full\" /> Image from Luwi\n  </figcaption>\n</figure>\n\r</p><p>But after the end of the conversation, Sherni posted a one-star review on Google, reiterating that her cat was not fierce and is \"okay even with strangers\".\r</p><p>\"What a shame [that they call] themselves professional. The way the boss replied is also not professional, not even a simple apology,\" she wrote.\r</p><p>Luwi then texted Sherni, saying she didn't expect her to be \"this low to vent [her] anger on Google\".\r</p><p><blockquote><p>\"If you can't allot budget for your cat grooming, better don't get a cat. Stingy b*tch. Hope you rot in hell f*cking b*tch.\"</p></blockquote>\r</p><p><figure id=\"attachment\" aria-describedby=\"caption-attachment\" style=\"width: 720px\" class=\"wp-caption aligncenter\">\n  <figcaption id=\"caption-attachment-468423\" class=\"wp-caption-text\">\n    <img src=\"https://static.mothership.sg/1/2025/11/Untitled-design-9-1.png\" alt=\"\" width=\"720\" height=\"1409\" class=\"wp-image-1101361 size-full\" /> Image from Luwi\n  </figcaption>\n</figure>\n\r</p><p><h2>Customer controversy</h2>\r</p><p>Members of the public spoke up in Sherni's defence, accusing Luwi of unprofessionalism.\r</p><p>She responded by calling one of them \"stingy\", and telling another of her critics to \"f*ck off\".\r</p><p><figure id=\"attachment\" aria-describedby=\"caption-attachment\" style=\"width: 720px\" class=\"wp-caption aligncenter\">\n  <figcaption id=\"caption-attachment-468423\" class=\"wp-caption-text\">\n    <img src=\"https://static.mothership.sg/1/2025/11/582925681_2219317711812939_8337201894690285188_n.jpg\" alt=\"\" width=\"720\" height=\"1443\" class=\"size-full wp-image-1101121\" /> Image from acquaintance\n  </figcaption>\n</figure>\n\r</p><p>Speaking to <em>Mothership</em>, an acquaintance of Sherni said that the woman had lodged a police report for harassment.\r</p><p>The acquaintance added that Sherni had paid the extra fee, and the \"extremely rude and vulgar messages\" were unwarranted.\r</p><p>\"Instead of explaining the charge or clarifying anything, the owner insulted the customer repeatedly and used harsh, abusive language,\" the acquaintance said.\r</p><p><h2>Bullying behaviour: Groomer</h2>\r</p><p>In response to <em>Mothership</em>'s queries, Luwi said that she has no need for \"unreasonable\" customers.\r</p><p>She shared further correspondence between her and Sherni, in which she explained the reason for the surcharge and gave further veterinary advice.\r</p><p><blockquote><p>\"I am a veterinarian by profession, so I give free health advice to my clients...I do this because I genuinely care about their pets' health and well-being.\r</p><p>So losing one unreasonable client doesn't bother me at all.\"</p></blockquote>\r</p><p>Luwi added that she has been in the business since 2016 and does not tolerate \"bullying behaviour\" from customers who seek to ruin her shop's reputation.\r</p><p>Asked why she chose to respond to the Google review instead of ignoring it, she said: \"Silence only enables that kind of attitude\".\r</p><p><blockquote><p>\"I called her a b*tch. And she deserves it.\"</p></blockquote>\r</p><p>Top image from <span>Furries Inc CAT grooming/Facebook.</span></p></p>",
      "thumbnail": "https://static.mothership.sg/1/2025/11/stingy-btch-cat-groomer.png"
    },
    {
      "title": "Man using phone, bangs into car in Ang Mo Kio, pretends to fall",
      "link": "https://mothership.sg/2025/11/man-walk-into-reversing-car/",
      "guid": "https://mothership.sg/2025/11/man-walk-into-reversing-car/",
      "pubDate": "2025-11-26T19:40:50",
      "description": "A video of the incident was posted on SG Road Vigilante.",
      "content": "<img class=\"type:primaryImage\" src=\"https://static.mothership.sg/1/2025/11/man-walk-into-reversing-car.jpg\"/> <p><a href=\"https://bit.ly/3qgqzHg\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/07/telegram-button.png\" alt=\"Telegram\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872229\" /></a>\r</p><p><a href=\"https://bit.ly/3KjTj94\" target=\"_blank\" rel=\"noopener noreferrer\"><img src=\"https://static.mothership.sg/1/2023/08/wa-button.png\" alt=\"Whatsapp\" width=\"700\" height=\"73\" class=\"aligncenter wp-image-872230\" /></a>\r</p><p>A man who was on his phone walked directly into a reversing car.\r</p><p>A <a href=\"https://www.facebook.com/reel/3039362706243488\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook video</a> posted by SG Road Vigilante on Nov. 26 showed that the man \"fell down\" afterwards.\r</p>\n<p><figure id=\"attachment\" aria-describedby=\"caption-attachment\" style=\"width: 800px\" class=\"wp-caption aligncenter\">\n  <figcaption id=\"caption-attachment-468423\" class=\"wp-caption-text\">\n    <img src=\"https://static.mothership.sg/1/2025/11/man-walk-into-car-gif.gif\" alt=\"\" width=\"800\" height=\"450\" class=\"size-full wp-image-1101370\" /> <em>Video via SG Road Vigilante</em>\n  </figcaption>\n</figure>\n\r</p><p><h2>Driver helped man</h2>\r</p><p>The post stated that the incident occurred in Block 306, Ang Mo Kio Avenue 1.\r</p><p>The driver then alighted from the car and helped the man up.\r</p><p><iframe width=\"560\" height=\"429\" style=\"border: none; overflow: hidden;\" src=\"https://www.facebook.com/plugins/video.php?height=314&amp;href=https%3A%2F%2Fwww.facebook.com%2Freel%2F3039362706243488%2F&amp;show_text=true&amp;width=560&amp;t=0\" scrolling=\"no\" frameborder=\"0\" allow=\"autoplay; clipboard-write; encrypted-media; picture-in-picture; web-share\" allowfullscreen=\"allowfullscreen\"></iframe>\r</p><p><h2>Not pursuing</h2>\r</p><p>Following the incident, the video caption stated that the man who \"fell down\" decided not to pursue the matter.\r</p><p>The video caption added that the man realised he may have been recorded.\r</p><p><em>Top photos via SG Road Vigilante</em></p></p>",
      "thumbnail": "https://static.mothership.sg/1/2025/11/man-walk-into-reversing-car.jpg"
    }
  ],
  "group": "country",
  "url": "https://mothership.sg/feed/",
  "lastFetched": "2025-11-28T08:54:40.143Z"
}