{
  "title": "Ask Us Anything about Singapore",
  "description": "A place for all your Singapore related questions.",
  "link": "",
  "items": [
    {
      "title": "How to convince foreigner husband that HDB is value for money?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p98pa6/how_to_convince_foreigner_husband_that_hdb_is/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p98pa6/how_to_convince_foreigner_husband_that_hdb_is/",
      "pubDate": "Fri, 28 Nov 2025 22:55:36 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p98pa6/how_to_convince_foreigner_husband_that_hdb_is/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>He hates the 99 year lease of the HDB. To him, it’s just an agreement to pay “rent” for 99 years. We don’t actually “own” the place. And once the lease gets past 50 years old, it will likely start losing value. </p>\n\n<p>Reselling is only selling the lease from one person to another. It is not home ownership to him. </p>\n\n<p>He only wants to consider freehold condo. To be honest, I think freehold or 999 years can also be reclaimed by government if they want to. So why not just reduce cost and get a HDB?</p>\n\n<p>How can I convince him? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "My brother has not been paying his OCBC student loans and has been served a legal letter",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8t1i2/my_brother_has_not_been_paying_his_ocbc_student/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8t1i2/my_brother_has_not_been_paying_his_ocbc_student/",
      "pubDate": "Fri, 28 Nov 2025 11:55:37 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8t1i2/my_brother_has_not_been_paying_his_ocbc_student/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>My brother has landed himself and my dad in absolute deep shit and I have been stressing out over this matter.</p>\n\n<p>He took a student loan back in 2021 to further his studies. Upon graduation he had his own business but it hasn’t been making profits the past few months. I highly believe this is the reason he hasn’t been making his student loan payments. It is now 2 months overdue and he has to make payment for this month too. Total amount is $1800. And it is already end of the month which means he is due to make a total payment of $2400 to the bank. The $2400 is the total amount from September to December as his loan is due at the start of the month. </p>\n\n<p>I normally don’t open his letters but a legal letter came under his name and I had a feeling that it was about his student loan, and I was unfortunately right. If I had not opened the letter, I would not have found out that he has been served a legal letter to pay the bank the remaining of his student loan in full. The amount is $21K and he definitely does not have that kind of money and neither do me or my parents. My dad is a grab driver and my mum is a SAHM so the only ones contributing financially to the household are my dad and I.</p>\n\n<p>After reading the letter, I went to check his email on his iPad and found an email from the OCBC Collections Group Risk Management which requested him to give them a call by 2nd December otherwise they will assign his case to their law firm to commence legal action.</p>\n\n<p>However he already got a legal letter and it states that unless the total sum of $21K as well as all interest and other fees/charges which continue to accrue up to the date of full payment are paid to our clients within three (3) days from the date hereof, they have OCBC’s firm instructions to commence legal proceedings against him for the recovery of all outstanding sums without further notice. The letter also states that that information regarding his credit conduct shall be disclosed to the Credit Bureau Singapore.</p>\n\n<p>I am not sure what to do now as the guarantor of his student loan is out dad and I am sure my dad has no idea of this as I just checked the joint student loan account on his OCBC app and the number has been changed from my dad’s to my brother’s business number. </p>\n\n<p>I know covering for him is bad but I don’t want my dad’s credit to be affected. My dad went bankrupt 16 years ago and it took years for him to clear his credit and turn his life around. I don’t wish for my brother or my dad to declare bankruptcy over this.</p>\n\n<p>Does anyone know if we can request for OCBC to take back the legal letter if my brother pays for the 4 months of payment in full? If it’s $2400 that they want now, that is a much doable amount for us than $21K in full. </p>\n\n<p>Any advice is appreciated. Thank you in advance. </p>\n\n<p>—————————</p>\n\n<p>Add on:\nThank you all for the advice and tips. I will be discussing this matter with both my dad and brother the moment both of them are home. I will be making sure that he calls the bank tomorrow morning and negotiate if he’s able to make monthly installments again if I help him cover the $2400 this one time.</p>\n\n<p>For those asking and wondering why we don’t have any savings as a family, my dad lost $30-40K to a scam that he was roped into by my uncle. We have reported this to the police months ago but there has been very little progress to the case. My dad is a grab driver while my mum is a SAHM. Aside from my dad working, I’m the only other one working full time while my brother (the one who got us into this mess) has been losing profits in a business that he started. We have another sibling that’s younger than both of us but he’s just a secondary school student.</p>\n\n<p>My brother’s loan payment is $600 a month and he’s been missing payments since September. From what I know, he has to make payment before the start of each month, so payment for December has to be made by end of November otherwise late fees will occur after the 10th of December. So from September to December, he will have to pay $2400 if the bank allows us to get him back on track for monthly installments again. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Is it inappropriate to eat rice with chopstick by picking up your bowl &amp; bringing it close to your mouth?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8r8wr/is_it_inappropriate_to_eat_rice_with_chopstick_by/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8r8wr/is_it_inappropriate_to_eat_rice_with_chopstick_by/",
      "pubDate": "Fri, 28 Nov 2025 10:05:00 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8r8wr/is_it_inappropriate_to_eat_rice_with_chopstick_by/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I noticed that when dining with my Chinese friends they do not carry their rice bowl in their hand and leave it on the table instead. It is considered rude to bring the rice bowl close to your face when dining outside?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Sg girlies, how do y'all take care of yourself during periods?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8vp3v/sg_girlies_how_do_yall_take_care_of_yourself/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8vp3v/sg_girlies_how_do_yall_take_care_of_yourself/",
      "pubDate": "Fri, 28 Nov 2025 14:07:20 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8vp3v/sg_girlies_how_do_yall_take_care_of_yourself/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>What do y&#39;all do during that time of the month in terms of taking care of yourself? </p>\n\n<ul>\n<li>Food/snacks that you love to eat? </li>\n<li>Foods/snacks that you avoid? </li>\n<li>Things that you do /avoid </li>\n<li> Ice packs/hot packs.. </li>\n<li> Soups you take etc...</li>\n<li> any remedies that you do..</li>\n<li>medications/supplements that you take</li>\n<li>any specific routine you follow..</li>\n</ul>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "home bakers! what brand of oven do you use?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p9d35j/home_bakers_what_brand_of_oven_do_you_use/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p9d35j/home_bakers_what_brand_of_oven_do_you_use/",
      "pubDate": "Sat, 29 Nov 2025 02:20:01 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p9d35j/home_bakers_what_brand_of_oven_do_you_use/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>i’m planning to buy a tabletop oven, but frankly don’t known much about them or their brands. </p>\n\n<p>the sales staff was recommending cornell’s 40L electric oven, but tbvh it was the cheapest one there and i’m a little skeptical when the others the same size cost upwards of $160.</p>\n\n<p>i do want one that is generally durable &amp; reliable (temperature is accurate &amp; won’t change over time)</p>\n\n<p>do let me know what brands y’all use / have used before, what your reviews. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Can employer change your work location during your notice period ?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8wlt5/can_employer_change_your_work_location_during/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8wlt5/can_employer_change_your_work_location_during/",
      "pubDate": "Fri, 28 Nov 2025 14:46:26 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8wlt5/can_employer_change_your_work_location_during/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I resigned today for personal reasons and will be  serving 1 month notice. I was planning to serve my notice without taking any MCs and to handover my work properly. But my boss suddenly told me that starting Monday, I have to work at a different location until my last day.</p>\n\n<p>The problem is this area is quite far from my home. I take public transport and the commute will be around 1.5 hours each way. My boss knows this. There’s also nothing in my contract about local relocation, only an overseas transfer clause that requires 1 month notice. </p>\n\n<p>I really dread commuting that far every day. For context, I’ve had no issues with my boss, no conflicts, and no performance complaints. When I asked why I had to move, he said the team needs me there. Otherwise, I can pay salary in lieu of notice. </p>\n\n<p>Honestly, it feels petty, and I don’t understand the point of sending someone who already resigned to a new location.</p>\n\n<p>Has anyone been in a similar situation ? Is this even legal ? Any advice on how to handle this without paying in lieu, or how to survive the long commute ?</p>\n\n<p>I checked MOM’s website but couldn’t find anything relevant except for this. It doesn&#39;t help. </p>\n\n<p><a href=\"https://www.mom.gov.sg/faq/contract-of-service/can-an-employer-change-an-employees-place-of-work\">https://www.mom.gov.sg/faq/contract-of-service/can-an-employer-change-an-employees-place-of-work</a></p>\n\n<p>TIA !!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Singaporeans who went overseas for work where are you and how has it been so far?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8lc3m/singaporeans_who_went_overseas_for_work_where_are/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8lc3m/singaporeans_who_went_overseas_for_work_where_are/",
      "pubDate": "Fri, 28 Nov 2025 04:07:01 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8lc3m/singaporeans_who_went_overseas_for_work_where_are/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Looking to explore working overseas for a short stint with wife.</p>\n\n<p>Jumped around a few organisations in Singapore and work generally feels the same. Wanting to try something different. </p>\n\n<p>So wanting to hear abit from others on how it&#39;s like and if there are any pluses or regrets </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Where can I get good tomato soup and grilled cheese in Singapore?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8u58n/where_can_i_get_good_tomato_soup_and_grilled/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8u58n/where_can_i_get_good_tomato_soup_and_grilled/",
      "pubDate": "Fri, 28 Nov 2025 12:54:56 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8u58n/where_can_i_get_good_tomato_soup_and_grilled/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>The cafe I used to go to that had it closed down so I’m looking for an alternative. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What are some of the coolest jobs in Singapore?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8nuq2/what_are_some_of_the_coolest_jobs_in_singapore/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8nuq2/what_are_some_of_the_coolest_jobs_in_singapore/",
      "pubDate": "Fri, 28 Nov 2025 06:28:36 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8nuq2/what_are_some_of_the_coolest_jobs_in_singapore/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>The country is quite small, and it feels like opportunities are less abundant. Most of our evaluation of a &#39;good&#39; job looks at income levels, and there seems to be little discussion about the wow factor. Does anyone have careers that they feel is genuinely cool to pursue? Please share!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Questions on History/Dress of the Teddy Bear in SQ",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p9hwlj/questions_on_historydress_of_the_teddy_bear_in_sq/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p9hwlj/questions_on_historydress_of_the_teddy_bear_in_sq/",
      "pubDate": "Sat, 29 Nov 2025 06:32:09 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p9hwlj/questions_on_historydress_of_the_teddy_bear_in_sq/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi, I know you all a bit bear tahan bear questions, but bear with me ah</p>\n\n<p>Ever since I heard about these SQ Bears, I been wondering the following:</p>\n\n<ol>\n<li>Since when SQ started implementing these bears in their flights?</li>\n<li>Are there different or seasonal costumes for these bears?</li>\n<li>Is there a way to pre-order the bear so that I can get in flight? (really unsure how inflight shopping works, bear with me on that)</li>\n<li>Is there SG50/SG60 versions of the bears?</li>\n</ol>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Is it normal to stay very close to home in Central region all the time?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p9hh1a/is_it_normal_to_stay_very_close_to_home_in/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p9hh1a/is_it_normal_to_stay_very_close_to_home_in/",
      "pubDate": "Sat, 29 Nov 2025 06:07:11 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p9hh1a/is_it_normal_to_stay_very_close_to_home_in/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Just moved to SG from JP, and live near city centre for a few months. </p>\n\n<p>Except for occasional visit to hospitals, I rarely leave central region. </p>\n\n<p>Like all needs satisfied. </p>\n\n<p>Maybe I should find some hobby groups and hang out with locals? (or join volunteer groups? )</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Looking for Vegetarian restaurants in SG",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8ta9h/looking_for_vegetarian_restaurants_in_sg/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8ta9h/looking_for_vegetarian_restaurants_in_sg/",
      "pubDate": "Fri, 28 Nov 2025 12:09:14 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8ta9h/looking_for_vegetarian_restaurants_in_sg/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys, im looking for vegetarian restaurant recommendations. My dad is a vegetarian and i have been wanting to bring the whole family out for a meal. However as he is the only vegetarian in the family im wondering if there are any restaurants that are good and possibly catering to the rest of the non vegetarian family members as well? Recommendations from fellow vegetarians would be appreciated!</p>\n\n<p>Edit: i missed out an important point, im looking for a slightly “formal” setting. As i intend to invite my inlaws. Preferably can cater to 10 pax seated together.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Can I bring a bike into an MRT station (before the gantry)?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p9hdkn/can_i_bring_a_bike_into_an_mrt_station_before_the/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p9hdkn/can_i_bring_a_bike_into_an_mrt_station_before_the/",
      "pubDate": "Sat, 29 Nov 2025 06:01:41 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p9hdkn/can_i_bring_a_bike_into_an_mrt_station_before_the/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys - if anyone knows Tanjong Katong station, it’s quite convenient because you can cross Tanjong Katong Rd S from one side of it (Meyer Road) into the other (Amber Road) from the MRT underpass. Otherwise, if on the road I would need to go quite far then U-turn back just to cross the road since Tanjong Katong Rd is all fenced on either side. </p>\n\n<p>Does anyone know if I can bring my non foldable bike into the MRT lift to go from say Exit 2 to Exit 3? Meaning wouldn’t even enter the gantry, it’s just to use the underpass. </p>\n\n<p>Thanks! </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Best cafes or bars to sit and watch things?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8sa10/best_cafes_or_bars_to_sit_and_watch_things/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8sa10/best_cafes_or_bars_to_sit_and_watch_things/",
      "pubDate": "Fri, 28 Nov 2025 11:10:24 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8sa10/best_cafes_or_bars_to_sit_and_watch_things/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>One of my favourite past times is going out by myself and listening to an audiobook while enjoying good food or drink with a good view. </p>\n\n<p>I&#39;m looking for both cafes and bars where I won&#39;t be bothered too much if I&#39;m dining alone. And where it won&#39;t be a problem if I take up a table for 2-3 hours. Though I&#39;ll most likely be doing this on weekday afternoons, to avoid peak times. </p>\n\n<p>I like both window views and people watching. I enjoy sitting in the corner of spacious cafes too. Essentially anything that would keep my eyes busy while my brain is processing a bunch of words. Nothing too compact or crowded - I really dislike it when people stand next to me while I&#39;m sitting, I can&#39;t relax when that happens. </p>\n\n<p>I don&#39;t mind traveling anywhere on the island. I haven&#39;t been home in awhile so it&#39;ll give me the opportunity to see more of Singapore. If you recommend specific areas to walk around after my solo date, that would also be appreciated.    </p>\n\n<p>Thank you!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Can anyone recommend me a good ortho🙏",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p96zty/can_anyone_recommend_me_a_good_ortho/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p96zty/can_anyone_recommend_me_a_good_ortho/",
      "pubDate": "Fri, 28 Nov 2025 21:42:40 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p96zty/can_anyone_recommend_me_a_good_ortho/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi! tldr - looking for reccs from people who have done braces and had good/satisfactory results! </p>\n\n<p>My teeth and jaw alignment have some moderate(?) issues, I’d want an ortho who takes both function and facial aesthetics into consideration. If im gonna get it fixed idw to end up looking even more chopped but just with straight teeth. Cos i know a lot of orthos take the easy way out/ use camouflage treatment and gaslight patients, and compromise on facial proportions and aesthetics just to achieve straight teeth. i’d want to avoid..</p>\n\n<p>Basically, my top teeth have id say moderate -severe? crowding, upper left lateral rotated about 25-35 degrees to fit into the arch. Upper right lateral incisor is behind the arch due to lack of space and slightly overlaps w upper right central. Because of that, my lower jaw is “locked” into a slightly backwards position to compensate. In its natural position, i cant bite down without the upper right lateral hitting my bottom central incisors. Also due to this theres some wear and tear on my bottom teeth and its getting noticeable😖😖. But the 1 good thing is that i know my overbite issues is functional/dental due to that backwards placed incisor and not skeletal. </p>\n\n<p>Probably needs expansion of upper arch? Which im worried about and ive heard might req surgery. Because even if they somehow bring the backwards teeth front and my lower jaw can then slide forward into its natural position, then my molars wouldnt align. Molars actually align properly now in my compensated backwards jaw position. If mg lower jaw slides forward, molars are edge to edge and upper jaw wld need to be expanded to accomodate it… also lower jaw im missing the 2 lateral incisors so it might complicate things too, idk if its too mafan and orthos would not wna take up my case etc..</p>\n\n<p>Really appreciate any suggestions!!! Thank you</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "MBS Casino players: why so many Sic Bo tables?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8wi1j/mbs_casino_players_why_so_many_sic_bo_tables/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8wi1j/mbs_casino_players_why_so_many_sic_bo_tables/",
      "pubDate": "Fri, 28 Nov 2025 14:42:00 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8wi1j/mbs_casino_players_why_so_many_sic_bo_tables/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Ventured into the casino after a while the full casino seems to be full of SicBo tables that are swamped by 20 people per table.. What is the draw of the game? Isn&#39;t the odds same as bacarrat /Roulette? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "SME tech turned de facto project lead? Is this normal in an SME job?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8vab1/sme_tech_turned_de_facto_project_lead_is_this/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8vab1/sme_tech_turned_de_facto_project_lead_is_this/",
      "pubDate": "Fri, 28 Nov 2025 13:48:58 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8vab1/sme_tech_turned_de_facto_project_lead_is_this/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hey all, I’m an Electrical Engineering Technician in an SME and studying part-time for a SWE diploma. I don’t come from an electrical background, but I’ve been learning on the job and can handle most of the technical parts now.</p>\n\n<p>Mid-year I was put on a new project in a field I hadn’t touched before. I had a mentor for 2–3 weeks, then became pretty independent (lots of reading and ChatGPT). Over time I ended up as the only tech who can work directly with both the vendor and the customer, so I’m the go-to for technical questions, testing, troubleshooting and updates.</p>\n\n<p>Since then I’ve been replying outside working hours, sometimes during evening classes, and some nights stretch 4–5 hours past my usual end time. I’m also the bridge between the vendor and client while still doing the hands-on work.</p>\n\n<p>A bit more context (kept vague for privacy):</p>\n\n<p>Team: very small. I’m the only technical person on this project, with one person handling the business side.</p>\n\n<p>Hours: after-hours work a few evenings a week, sometimes long stretches.</p>\n\n<p>Pay: early-career technician range.</p>\n\n<p>My questions:</p>\n\n<p>Is wearing this many hats normal in SMEs?</p>\n\n<p>Given the scope, is it reasonable to ask for a title change and a raise?</p>\n\n<p>If yes, how should I frame that conversation?</p>\n\n<p>Not complaining, just want to sanity-check what’s normal. Thanks!</p>\n\n<p>Edit: Fixed formatting</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "As we end 2025 soon, what are your dreams for 2026?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8pl3w/as_we_end_2025_soon_what_are_your_dreams_for_2026/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8pl3w/as_we_end_2025_soon_what_are_your_dreams_for_2026/",
      "pubDate": "Fri, 28 Nov 2025 08:17:00 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8pl3w/as_we_end_2025_soon_what_are_your_dreams_for_2026/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>My boss posed this question to the Singapore-based departments which will be undergoing manpower cuts or retrenchments for FY 2026, and it made me reflect well as i&#39;ll be leaving Singapore for overseas posting as well.   </p>\n\n<p>&quot;What are your dreams for 2026? (Dreams are not limited to work)&quot;  </p>\n\n<p>&quot;Is the company any aspect of your future aspirations?&quot; (i laughed cause &quot;nightmare&quot; but then i thought hard again) </p>\n\n<p>&quot;where else can you fulfil your other dreams? Are there other companies which can serve your needs towards this dreams?&quot;</p>\n\n<p>And also from my own reflection as I will be leaving soon...<br/>\nwhat is the Singaporean dream?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Job Placement and Support Programs for Disability Employment",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8ugvv/job_placement_and_support_programs_for_disability/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8ugvv/job_placement_and_support_programs_for_disability/",
      "pubDate": "Fri, 28 Nov 2025 13:10:23 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8ugvv/job_placement_and_support_programs_for_disability/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Two years ago, I approached the SG Enable for Employment Assistance given my now-diagnosed mild ASD and physical inabilities due to restrictive lung function and other conditions as a young adult. They sent me for an assessment session with APSN for Job Placement and Job Support. I indicated that I was looking for Admin positions in Public Service. APSN said that it may take a while for them to find suitable positions for me, and that I can try job seeking myself concurrently. So I found a Contract-for-Service job in a Gov&#39;t agency. For about a year, I did not received any updates from APSN despite me checking in with my social service agent. </p>\n\n<p>Having recently being asked to resign by my employer on short Notice (less than 1 week), I am now back to square 1 and have to contend with increasingly difficult job seeking in light of my above-mentioned issues - which seems like even the Public Service isn&#39;t willing to accommodate.</p>\n\n<p>Are there any other avenues, pending APSN&#39;s update, that I can seek assistance from?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Is peakery.com blocked for you guys?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8z7qh/is_peakerycom_blocked_for_you_guys/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8z7qh/is_peakerycom_blocked_for_you_guys/",
      "pubDate": "Fri, 28 Nov 2025 16:31:18 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8z7qh/is_peakerycom_blocked_for_you_guys/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s a pretty innocent website that has info about mountains and shows them nicely on a map with details and all. Can&#39;t think of a reason why it would be banned, can&#39;t find any news about it either so doesn&#39;t seem like the same thing is happening outside of Singapore?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Requesting providers of parcel packaging services in Singapore",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p9bev9/requesting_providers_of_parcel_packaging_services/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p9bev9/requesting_providers_of_parcel_packaging_services/",
      "pubDate": "Sat, 29 Nov 2025 00:58:51 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p9bev9/requesting_providers_of_parcel_packaging_services/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m planning to start an e-commerce business soon and am thus looking for providers of parcel packaging services for delivery purposes. However, when I Googled it, all the results were for couriers and movers.</p>\n\n<p>Could I please be recommended some of the providers of these services?</p>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What's one expensive thing you bought... but totally DON’T regret?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8656c/whats_one_expensive_thing_you_bought_but_totally/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8656c/whats_one_expensive_thing_you_bought_but_totally/",
      "pubDate": "Thu, 27 Nov 2025 16:16:25 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8656c/whats_one_expensive_thing_you_bought_but_totally/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Similar to the other thread, but stuff that are ‘best thing since sliced bread’ for you.</p>\n\n<p>Mine would be the Breville Pizzaolo. Household professional level grade counter top pizza oven, bought it for $900+ off someone on carousell. Retails for $1.5k. Seller even threw an extra pizza stone free for me, super grateful to them. </p>\n\n<p>It makes wood fired pizza quality in under 3 minutes and gives you a fantastic char grill as well (used it for vegetables and prawns and they look BBQ’d) </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Reliable dentists in singapore?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8wnhv/reliable_dentists_in_singapore/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8wnhv/reliable_dentists_in_singapore/",
      "pubDate": "Fri, 28 Nov 2025 14:48:26 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8wnhv/reliable_dentists_in_singapore/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Where do you guys go for dental treatment in Singapore that’s reasonably priced &amp; reliable? I suspect I have a minor tooth decay and would appreciate if you know how much your dentist charges for that as well. Any consultation fees included? Not really keen on going to polyclinics as I want to get this fixed asap</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Career switch to Aviation related sector",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8oz30/career_switch_to_aviation_related_sector/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8oz30/career_switch_to_aviation_related_sector/",
      "pubDate": "Fri, 28 Nov 2025 07:37:42 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8oz30/career_switch_to_aviation_related_sector/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi All,</p>\n\n<p>I am in my mid 40s. Male. Doing sales all my life . Sales agent self employed sales all my life.</p>\n\n<p>Keen to switch to the aviation sector as I see the new Changi Airport Terminal 5 may create lots of opportunities .</p>\n\n<p>I am more keen in airport logistics and operations roles .</p>\n\n<p>Not sure which companies and roles can I go for .\nI also notice some role  an be quite low starting pay like around $2 k to $3k per month like for example  air hub specialists role. </p>\n\n<p>I have a bachelor degree in arts from a local university .</p>\n\n<p>What are the roles and companies I can apply for and have long term career prospects as I intend to do this job till retirement like age 65 or longer .</p>\n\n<p>Thank you </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Tips for Elder Proofing Maisonettes",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8puia/tips_for_elder_proofing_maisonettes/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p8puia/tips_for_elder_proofing_maisonettes/",
      "pubDate": "Fri, 28 Nov 2025 08:34:14 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p8puia/tips_for_elder_proofing_maisonettes/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>For those who live in maisonettes and have elderly parents: what practical steps have you taken to elder-proof your homes once climbing stairs becomes difficult? Did you create a bedroom on the lower floor, modify part of the living room, or install a stair-lift?</p>\n\n<p>My dad is very emotionally attached to his maisonette and has strong neighbour support as most of the residents know him and keep an eye out for him. He also has mild dementia, so keeping him in a familiar environment is a priority for us. He has also made it clear that he does not want to move out. </p>\n\n<p>Recently though, he seems to be struggling more with the stairs, even if he insists he can still manage. </p>\n\n<p>I’d appreciate hearing what arrangements or renovations others have made, especially those navigating similar constraints. I don&#39;t mind renovating the house and building an additional room. I have a helper as well so she is occupying that one room downstairs.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    }
  ],
  "group": "country",
  "url": "https://redlib.perennialte.ch/r/askSingapore.rss",
  "lastFetched": "2025-11-29T06:53:53.502Z"
}