{
  "title": "indonesiabebas",
  "description": "Buat bahas Indonesia, tapi bingung kemana? kesini aja. Cuma akal sehat jangan sampai kelupaan.",
  "link": "",
  "items": [
    {
      "title": "[Corat Coret] Dinding Belakang Rumah Bu Novia, No.25",
      "link": "https://redlib.perennialte.ch//r/indonesiabebas/comments/1olbcct/corat_coret_dinding_belakang_rumah_bu_novia_no25/",
      "guid": "https://redlib.perennialte.ch//r/indonesiabebas/comments/1olbcct/corat_coret_dinding_belakang_rumah_bu_novia_no25/",
      "pubDate": "Sat, 1 Nov 2025 01:03:21 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1olbcct/corat_coret_dinding_belakang_rumah_bu_novia_no25/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Seperti biasa thread bulanan buat naekin post karma atau diskusi kecil atau nyampah. Silahkan posting disini.</p>\n\n<p>Good luck and have fun ya buat bulan November.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Kelakuan Oxford yang gak mau kasih direct credit kepada peneliti-peneliti Indonesia untuk bunga rafflesia hasseltii viral di Malaysia",
      "link": "/img/lux427r56c3g1.jpeg",
      "guid": "/img/lux427r56c3g1.jpeg",
      "pubDate": "Tue, 25 Nov 2025 05:10:02 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p63ymp/kelakuan_oxford_yang_gak_mau_kasih_direct_credit/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>In the depths of a Sumatran rainforest patrolled by tigers, a small but passionate team of botanists and guides carried out a mission that most people only dream of: to witness the bloom of <em>Rafflesia hasseltii</em>, a flower so rare it’s “seen more by tigers than people.”</p>\n\n<p>Among them were Joko Witono (from Indonesia’s National Research and Innovation Agency), Septi Andriki (a local conservation activist), and Iswandi (from a community forest-management institute).</p>\n\n<p>These three know the forest in their bones: the hidden paths, the host vines, the rhythms of the land.</p>\n\n<p>Together with Dr Chris Thorogood of Oxford University’s Botanic Garden, they trekked day and night through thick undergrowth and across tiger territory, with only permits and a fragile hope as their guide.</p>\n\n<h1>An almost mystical moment</h1>\n\n<p>The team saw the Rafflesia unfurl under the cover of darkness, a bloom so fleeting that it only stays open for a few days. It was an emotional moment for Septi Andriki, who’d been searching for the elusive flower for <a href=\"https://www.detik.com/edu/edutainment/d-8220133/dicari-13-tahun-rafflesia-hasseltii-ditemukan-ilmuwan-di-pedalaman-sumatera\">13 years</a>. He can be seen weeping after finally finding the flower in the video below:</p>\n\n<blockquote>\n</blockquote>\n\n<p>Thorogood later described the experience as “life-changing.”</p>\n\n<p>It was all supposed to be a momentous occasion (and it still is, of course), but things have gotten a bit uncomfortable (and infuriating) now.</p>\n\n<p>When Oxford University shared the discovery on its official social media channels, the post emphasised its own scientist—Dr Thorogood—trekking through tiger-patrolled rainforests, while relegating the others as a mere “team” with none of their names mentioned.</p>\n\n<p><a href=\"https://media.juiceonline.com/2025/11/Screenshot-2025-11-24-at-3.20.41%E2%80%AFPM-1174x1536.png\">https://media.juiceonline.com/2025/11/Screenshot-2025-11-24-at-3.20.41%E2%80%AFPM-1174x1536.png</a></p>\n\n<p><a href=\"https://x.com/UniofOxford/status/1991188354998677679\">https://x.com/UniofOxford/status/1991188354998677679</a></p>\n\n<p>Their exclusion from direct credits completely betrays their decades of field knowledge, dedication, and sheer hard work, without which none of this would have been possible in the first place. It’s a sentiment echoed by many on social media.</p>\n\n<p>Former Indonesian education minister Anies Baswedan even <a href=\"https://www.jawapos.com/pendidikan/016869210/anies-baswedan-minta-oxford-akui-nama-peneliti-indonesia-di-penemuan-rafflesia-hasseltii-mereka-bukan-npc\">called the university out</a>, saying that Joko, Septi, and Iswandi are not “non-playable characters” (NPCs) in this story, but real scientists and conservation heroes whose contributions deserve proper acknowledgement.</p>\n\n<p>Some X users have pointed out that this is part of a broader pattern where researchers or institutions from the Global South labour in difficult, risky environments, only for Western institutions to become the face of the discovery. It’s objectively unfair and perpetuates a modern form of colonialism.</p>\n\n<p>It’s been four days since Oxford University <a href=\"https://x.com/UniofOxford/status/1991188354998677679\">shared the post</a> on their socials (and four days of constant flaming by netizens), but they haven’t ammended it to give the proper credits, at least at the time of writing.</p>\n\n<p><a href=\"https://juiceonline.com/oxford-rafflesia-hasseltii-backlash/\">https://juiceonline.com/oxford-rafflesia-hasseltii-backlash/</a></p>\n\n<p><a href=\"https://m.facebook.com/story.php?story_fbid=1254122540095871&amp;id=100064944091619\">https://m.facebook.com/story.php?story_fbid=1254122540095871&amp;id=100064944091619</a>  </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "PHK Paling Banyak Di Jawa Barat, 15 Ribu Orang Jadi Korban",
      "link": "/img/gzzpbg7ubb3g1.jpeg",
      "guid": "/img/gzzpbg7ubb3g1.jpeg",
      "pubDate": "Tue, 25 Nov 2025 02:17:33 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p60iqa/phk_paling_banyak_di_jawa_barat_15_ribu_orang/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p60iqa/phk_paling_banyak_di_jawa_barat_15_ribu_orang/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Sub sebelah makin tolol aja. Paspor lemah merupakan fakta, Terima kenyataan dan benahi, bukannya nyari strawman dari random warganet",
      "link": "/img/bzn8lkb3cb3g1.jpeg",
      "guid": "/img/bzn8lkb3cb3g1.jpeg",
      "pubDate": "Tue, 25 Nov 2025 02:51:49 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p618t2/sub_sebelah_makin_tolol_aja_paspor_lemah/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p618t2/sub_sebelah_makin_tolol_aja_paspor_lemah/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Kenapa ga diajak ngobrol ya?",
      "link": "/img/3mc3al75cb3g1.jpeg",
      "guid": "/img/3mc3al75cb3g1.jpeg",
      "pubDate": "Tue, 25 Nov 2025 02:19:16 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p60k1q/kenapa_ga_diajak_ngobrol_ya/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Ngobrol anime atau apa kek gitu biar enak difoto </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Konser Indonesia Mahal: Sewa Stadion Sampai Rp 8 M, di Malaysia Rp 200 Juta",
      "link": "/img/xycru79bwb3g1.jpeg",
      "guid": "/img/xycru79bwb3g1.jpeg",
      "pubDate": "Tue, 25 Nov 2025 04:12:19 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p62vo4/konser_indonesia_mahal_sewa_stadion_sampai_rp_8_m/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.detik.com/pop/music/d-8223189/konser-indonesia-mahal-sewa-stadion-sampai-rp-8-m-di-malaysia-rp-200-juta\">link</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Defensive Medicine",
      "link": "/gallery/1p5wocy",
      "guid": "/gallery/1p5wocy",
      "pubDate": "Mon, 24 Nov 2025 23:23:53 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p5wocy/defensive_medicine/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p5wocy/defensive_medicine/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Buaya Mati 'meninggalkan' TV",
      "link": "/img/7s3j87n1nc3g1.jpeg",
      "guid": "/img/7s3j87n1nc3g1.jpeg",
      "pubDate": "Tue, 25 Nov 2025 06:42:09 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p65k1f/buaya_mati_meninggalkan_tv/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Gajah mati meninggalkan gading, harimau mati meninggalkan belang, buaya mati meninggalkan TV</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "kalau di indo kayaknya presiden ke-2 kah?",
      "link": "/img/b17qqukjma3g1.jpeg",
      "guid": "/img/b17qqukjma3g1.jpeg",
      "pubDate": "Tue, 25 Nov 2025 00:51:02 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p5ynth/kalau_di_indo_kayaknya_presiden_ke2_kah/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p5ynth/kalau_di_indo_kayaknya_presiden_ke2_kah/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Jakarta Geser Tokyo Jadi Kota Terpadat di Dunia",
      "link": "/img/cm3jtukylc3g1.jpeg",
      "guid": "/img/cm3jtukylc3g1.jpeg",
      "pubDate": "Tue, 25 Nov 2025 06:36:04 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p65gb2/jakarta_geser_tokyo_jadi_kota_terpadat_di_dunia/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.cnbcindonesia.com/lifestyle/20251125085920-33-688203/jakarta-geser-tokyo-jadi-kota-terpadat-di-dunia\">link</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Tuna Kaleng, Rasa Perbudakan: ketika Nelayan Indonesia harus mengajar etika ke Perusahaan Amerika",
      "link": "/img/cmp5mnoo683g1.jpeg",
      "guid": "/img/cmp5mnoo683g1.jpeg",
      "pubDate": "Mon, 24 Nov 2025 15:44:03 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p5kdl4/tuna_kaleng_rasa_perbudakan_ketika_nelayan/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Di balik lezatnya sepotong sandwich tuna yang tersaji di banyak meja makan di Amerika, ternyata ada kisah getir yang datang dari laut dalam. Bukan soal ikan semata, tapi tentang empat orang Indonesia yang akhirnya memberanikan diri menggugat salah satu perusahaan makanan laut terbesar di dunia, Bumble Bee Foods (BBF). Nama mereka Akhmad, Angga, Muhammad Sahrudin, dan Muhammad Syafi’i, bukan pejabat, bukan orang kaya, melainkan awak kapal perikanan yang pernah mengarungi samudera luas demi sesuap nasi.</p>\n\n<p>Gugatan ini bukan hal kecil. Bayangkan, empat orang pekerja migran asal Indonesia berdiri di hadapan sistem hukum Amerika Serikat. Mereka bukan pengacara, bukan aktivis profesional. Tapi mereka membawa luka, pengalaman kerja yang mereka yakini sebagai bentuk perbudakan modern, seperti jam kerja gila-gilaan, minim istirahat, kekerasan verbal bahkan fisik, dan hidup terisolasi di laut selama berbulan-bulan tanpa akses keluar. Dan semua itu, menurut mereka, terjadi di atas kapal-kapal yang memasok ikan langsung ke Bumble Bee Foods.</p>\n\n<p>Kisah ini bermula pada 12 Maret 2025, ketika keempat orang ini secara resmi mengajukan gugatan ke Pengadilan Distrik California Selatan. Mereka menggugat BBF menggunakan hukum bernama TVPRA, Trafficking Victims Protection Reauthorization Act, semacam undang-undang di AS yang memungkinkan korban perdagangan manusia dan kerja paksa untuk menuntut pihak-pihak yang ikut mendapatkan keuntungan dari situasi tersebut. Di mata mereka, BBF tidak hanya menerima hasil tangkapan ikan dari kapal-kapal yang menggunakan kerja paksa, tapi juga menjual hasil itu ke pasar, meraup keuntungan, dan menutup mata terhadap penderitaan para pekerja.</p>\n\n<p>Mereka tidak sendiri. Gugatan ini didukung penuh oleh Greenpeace Internasional, Greenpeace Indonesia, serta Serikat Buruh Migran Indonesia (SBMI). Bahkan, pengacara mereka menggunakan data dan hasil investigasi dari kampanye Beyond Seafood, sebuah inisiatif global yang menyelidiki rantai pasok industri laut yang rumit dan sering gelap. Di dunia perikanan jarak jauh, praktik kerja paksa memang bukan cerita baru. Kapal-kapal sering beroperasi jauh dari pantai, tanpa pengawasan, dan awaknya tak jarang bekerja tanpa kontrak yang jelas, gaji yang layak, atau jaminan keselamatan.</p>\n\n<p>Awalnya, pihak BBF mencoba menggugurkan gugatan ini. Pada awal Juni 2025, mereka mengajukan motion to dismiss atau permohonan untuk membatalkan perkara. Alasan mereka macam-macam, mulai dari soal yurisdiksi, karena kejadian utama berlangsung di luar AS, hingga klaim bahwa mereka tak punya kendali langsung atas kapal-kapal tersebut. Tapi hakim yang menangani kasus ini, Cynthia Bashant, tidak serta merta percaya begitu saja. Setelah mempertimbangkan bukti dan argumen dari kedua belah pihak, pada November 2025, ia memutuskan untuk menolak sebagian besar permintaan BBF. Gugatan para nelayan Indonesia itu akan tetap dilanjutkan.</p>\n\n<p>Ini momen penting, bahkan bisa dibilang bersejarah. Bukan hanya karena empat orang Indonesia berani menggugat perusahaan besar di negeri orang. Tapi juga karena ini adalah kasus pertama di industri perikanan AS yang berhasil melewati tahap penolakan awal dan lanjut ke proses pengadilan secara penuh. Dalam keputusan pengadilan, disebutkan bahwa klaim kerja paksa yang diajukan para penggugat selaras dengan ketentuan hukum AS dan bahwa BBF bisa saja mengetahui praktik ini terjadi di kapal-kapal pemasok mereka. Dengan kata lain, pengadilan mengakui bahwa tuduhan ini serius dan layak diusut lebih lanjut.</p>\n\n<p>Syafi’i, salah satu penggugat, mengatakan bahwa putusan ini memberinya harapan. Setelah bertahun-tahun merasa tak dianggap, didiamkan, bahkan mungkin dilupakan, kini mereka mulai melihat cahaya. Ia berujar dalam wawancara yang dirilis Greenpeace, bahwa akhirnya ada kesempatan bagi mereka untuk bicara. Untuk menunjukkan bahwa mereka bukan hanya tangan yang menangkap ikan, tapi juga manusia yang pantas dihargai.</p>\n\n<p>Pihak BBF sendiri belum memberikan banyak pernyataan publik. Dalam dokumen hukum, mereka bersikeras bahwa mereka tidak mengetahui praktik kerja paksa terjadi, dan bahwa mereka telah mengikuti standar industri dalam pengadaan tuna. Tapi para pengacara penggugat punya argumen kuat. Mereka menyatakan bahwa BBF seharusnya tahu. Bahwa perusahaan sebesar itu, dengan rantai pasok global, punya kewajiban untuk memeriksa dari mana produknya berasal. Apalagi jika laporan pelanggaran sudah muncul sejak bertahun-tahun lalu di sektor ini.</p>\n\n<p>Dampak dari kasus ini bisa sangat luas. Bukan hanya soal apakah keempat nelayan ini menang atau kalah. Tapi soal bagaimana dunia memandang rantai pasok makanan laut. Kasus ini bisa jadi alarm keras bagi perusahaan-perusahaan lain di industri yang sama, bahwa “aku tidak tahu” bukan lagi alasan yang bisa diterima. Bahwa ketika seseorang menjual makanan ke jutaan konsumen, ia harus tahu dari mana asalnya, dan siapa yang ada di baliknya.</p>\n\n<p>Bagi Indonesia sendiri, ini juga jadi refleksi. Negeri ini adalah salah satu penyumbang terbesar tenaga kerja di sektor perikanan global. Banyak anak muda dari desa-desa pesisir yang bermimpi keluar negeri demi penghasilan lebih baik, tapi justru terjebak dalam sistem yang eksploitatif. Tak semua, tentu. Tapi tak sedikit pula yang mengalami hal serupa dengan keempat penggugat. Bedanya, mereka mungkin belum tahu bagaimana cara menuntut keadilan.\nApa yang dilakukan Akhmad dan kawan-kawan membuka jalan. Setidaknya memperlihatkan bahwa ada celah hukum yang bisa digunakan, ada organisasi yang mau membantu, dan ada pengadilan yang mau mendengar. Dunia tidak lagi buta. Konsumen di AS dan negara-negara lain mulai sadar bahwa produk yang mereka nikmati tak selalu lahir dari sistem yang adil. Di tengah gempuran kampanye iklan tuna sehat dari laut bersih, cerita seperti ini justru membuat kita berpikir, apakah sehat itu hanya soal gizi dan protein? Atau juga soal keadilan di baliknya?</p>\n\n<p>Akhmad dan kawan-kawan belum menang. Perjalanan mereka masih panjang. Tapi mereka sudah menang dalam hal lain, yaitu keberanian. Keberanian untuk bicara, untuk melawan, dan untuk memperjuangkan hak sebagai manusia, bukan hanya sebagai pekerja di balik pabrik makanan laut yang mengkilap.</p>\n\n<p>Dan mungkin, di balik satu kaleng tuna di supermarket, kini ada secercah rasa tanggung jawab yang mulai tumbuh, bagi siapa pun yang membeli, menjual, atau bahkan hanya menyantapnya. Jika itu terjadi, mungkin perjuangan mereka tidak sia-sia.</p>\n\n<p><a href=\"https://m.facebook.com/story.php?story_fbid=1137282925235266&amp;id=100068607081105\">https://m.facebook.com/story.php?story_fbid=1137282925235266&amp;id=100068607081105</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "SPBU Shell Bakal Ada BBM Lagi, Negosiasi Sama Pertamina Hampir Final",
      "link": "/img/kg0erhqi4d3g1.jpeg",
      "guid": "/img/kg0erhqi4d3g1.jpeg",
      "pubDate": "Tue, 25 Nov 2025 08:20:06 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p673t0/spbu_shell_bakal_ada_bbm_lagi_negosiasi_sama/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.cnbcindonesia.com/news/20251124211031-4-688145/spbu-shell-bakal-ada-bbm-lagi-negosiasi-sama-pertamina-hampir-final\">link</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Presiden Prabowo Minta Audit Semua Rs Di Papua, Kematian Ibu Hamil Di Papua Masuk Telinga Presiden",
      "link": "/img/nt92rlohmc3g1.jpeg",
      "guid": "/img/nt92rlohmc3g1.jpeg",
      "pubDate": "Tue, 25 Nov 2025 06:39:02 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p65i3x/presiden_prabowo_minta_audit_semua_rs_di_papua/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p65i3x/presiden_prabowo_minta_audit_semua_rs_di_papua/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "TPU Jakarta Krisis Hingga Sentuh Angka 76%",
      "link": "/img/cy1pev6kcb3g1.jpeg",
      "guid": "/img/cy1pev6kcb3g1.jpeg",
      "pubDate": "Tue, 25 Nov 2025 02:21:36 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p60lsz/tpu_jakarta_krisis_hingga_sentuh_angka_76/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p60lsz/tpu_jakarta_krisis_hingga_sentuh_angka_76/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Duh! 250 Ton Beras Ilegal Diam-diam Masuk RI",
      "link": "/img/bwq55hmlbb3g1.jpeg",
      "guid": "/img/bwq55hmlbb3g1.jpeg",
      "pubDate": "Tue, 25 Nov 2025 02:16:13 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p60hom/duh_250_ton_beras_ilegal_diamdiam_masuk_ri/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p60hom/duh_250_ton_beras_ilegal_diamdiam_masuk_ri/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Legenda Timnas, Ronny Pasla Meninggal Dunia",
      "link": "/img/r533qkd3nb3g1.jpeg",
      "guid": "/img/r533qkd3nb3g1.jpeg",
      "pubDate": "Tue, 25 Nov 2025 03:20:38 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p61uey/legenda_timnas_ronny_pasla_meninggal_dunia/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p61uey/legenda_timnas_ronny_pasla_meninggal_dunia/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Siapa anjir yang ngisi kuesioner nya",
      "link": "/img/q0n367juc53g1.jpeg",
      "guid": "/img/q0n367juc53g1.jpeg",
      "pubDate": "Mon, 24 Nov 2025 06:12:31 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p59jeh/siapa_anjir_yang_ngisi_kuesioner_nya/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p59jeh/siapa_anjir_yang_ngisi_kuesioner_nya/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Paket gw hilang ama baraya",
      "link": "https://redlib.perennialte.ch//r/indonesiabebas/comments/1p5oyf4/paket_gw_hilang_ama_baraya/",
      "guid": "https://redlib.perennialte.ch//r/indonesiabebas/comments/1p5oyf4/paket_gw_hilang_ama_baraya/",
      "pubDate": "Mon, 24 Nov 2025 18:29:24 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p5oyf4/paket_gw_hilang_ama_baraya/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Jadi begini, gw ngirim paket pke Baraya, dan sama mereka ga tau hilang kemana, ga kelacak.</p>\n\n<p>Nilai barang hampir 5 juta. Emang salah gw pake Baraya, dan gw ga kepikiran buat beli asuransinya.</p>\n\n<p>Skrg setelah bberapa waktu, Baraya nawarin penggantian maksimal 10x biaya kirim, atau maks 1 jt.</p>\n\n<p>Pertanyaan gw, sebagai konsumen gw bisa tuntut ga nih Baraya? Rugi moral dan materil, tenaga dan waktu. Dan akhirnya cuma diganti 1/10 dari harga barang</p>\n\n<p>Trims</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Pelangi di Mars by Upie Guava",
      "link": "",
      "guid": "",
      "pubDate": "Mon, 24 Nov 2025 13:18:54 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p5guc0/pelangi_di_mars_by_upie_guava/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Pelangi di Mars, film sci-fi Indonesia yg bakal tayang 2026. Live action meets animation, tentang kid born on Mars. Nonton teasernya sihh keren animasinya 11-12 sama Jumbo.</p>\n\n<p>Thoughts? Worth the hype or nah???</p>\n\n<p>Teaser: <a href=\"https://youtu.be/_WNjA2JyXiA?si=sTwYVUSIFYJ2Ri2H\">https://youtu.be/_WNjA2JyXiA?si=sTwYVUSIFYJ2Ri2H</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Asli",
      "link": "/img/mpqbb9bax33g1.png",
      "guid": "/img/mpqbb9bax33g1.png",
      "pubDate": "Mon, 24 Nov 2025 01:23:31 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p53vyg/asli/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p53vyg/asli/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Rawan Dibegal, Warga Badui Sementara Dilarang Jual Madu ke Jakarta",
      "link": "/img/r8anivxzd43g1.jpeg",
      "guid": "/img/r8anivxzd43g1.jpeg",
      "pubDate": "Mon, 24 Nov 2025 02:57:12 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p55ua9/rawan_dibegal_warga_badui_sementara_dilarang_jual/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.inilah.com/rawan-dibegal-warga-badui-sementara-dilarang-jual-madu-ke-jakarta\">link</a></p>\n\n<p>Bukannya berantas kriminalitas malah mutus rejeki orang</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Warga Citra Batam Keluhkan Sampah Tak Diangkut Angkut, Sudah 3 Pekan",
      "link": "https://batampos.jawapos.com/infokota/2426871762/warga-citra-batam-keluhkan-sampah-tak-diangkut-angkut-sudah-3-pekan",
      "guid": "https://batampos.jawapos.com/infokota/2426871762/warga-citra-batam-keluhkan-sampah-tak-diangkut-angkut-sudah-3-pekan",
      "pubDate": "Tue, 25 Nov 2025 01:50:00 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p5zxtl/warga_citra_batam_keluhkan_sampah_tak_diangkut/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Permasalahan sampah di Kota Batam sepenuhnya belum benar-benar selesai. Warga Perumahan Citra Batam, Kecamatan Batam Kota, mengeluhkan tumpukan sampah yang tidak pernah diangkut selama tiga pekan terakhir.</p>\n\n<p>Di kompleks yang berisi sekitar 500 kepala keluarga (KK) itu, tidak ada satu pun titik yang tersentuh armada pengangkut sampah. Kondisi ini membuat warga kebingungan harus membuang sampah ke mana, sementara sampah berserakan di depan rumah warga dan menimbulkan bau menyengat.</p>\n\n<p>Niken, salah seorang warga, membenarkan bahwa sudah tiga minggu tidak ada petugas kebersihan yang datang. “Sudah tiga minggu tidak diangkut,” kata Niken saat dihubungi Batam Pos, Senin (24/11) siang.</p>\n\n<p>Ia menyebut telah menghubungi Dinas Lingkungan Hidup (DLH) Kota Batam untuk meminta kejelasan. Pihak DLH, kata Niken, menyampaikan bahwa pengangkutan terhambat karena banyak armada pengangkut yang mengalami kerusakan.</p>\n\n<p>“Saya sudah hubungi DLH, mereka bilang armadanya banyak yang rusak, jadi itu kendalanya sampah tidak diangkut,” ujarnya.</p>\n\n<p>Meski begitu, Niken mengaku tidak mendapat kepastian kapan layanan pengangkutan sampah di wilayahnya akan kembali normal.\n“Itu dia, saya juga tidak tahu kapan mau diangkut,” tambahnya.</p>\n\n<p>Batam Pos kemudian mencoba mengonfirmasi hal tersebut ke DLH melalui sambungan telepon WhatsApp. Seorang pegawai yang merespons mengakui hal serupa. “Kendala kita sekarang ada di armada, sehingga sampah tidak diangkut,” katanya.</p>\n\n<p>Namun ketika ditanya lebih jauh mengenai jumlah armada per kecamatan dan langkah penanganan selanjutnya, pegawai tersebut menolak memberikan informasi detail dan mengarahkan agar wawancara dilakukan langsung kepada Kepala Bidang DLH. “Ke Kabid DLH saja. Tak boleh wawancara lewat telepon kalau mau dinaikkan beritanya,” tegasnya</p>\n\n<p>Saat Batam Pos meminta identitasnya untuk kebutuhan verifikasi, pegawai tersebut langsung memutus sambungan telepon. (*)</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Seru ya mainan rc gini di kampung",
      "link": "",
      "guid": "",
      "pubDate": "Mon, 24 Nov 2025 04:48:43 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p581un/seru_ya_mainan_rc_gini_di_kampung/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p581un/seru_ya_mainan_rc_gini_di_kampung/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Parkir Diganti Digital, Paguyuban Jukir Surabaya dan Madas Merasa Tak Dihargai Gacoan",
      "link": "",
      "guid": "",
      "pubDate": "Mon, 24 Nov 2025 08:30:28 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p5bro1/parkir_diganti_digital_paguyuban_jukir_surabaya/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p5bro1/parkir_diganti_digital_paguyuban_jukir_surabaya/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "jual tanah BANYAK",
      "link": "https://redlib.perennialte.ch//r/indonesiabebas/comments/1p5l655/jual_tanah_banyak/",
      "guid": "https://redlib.perennialte.ch//r/indonesiabebas/comments/1p5l655/jual_tanah_banyak/",
      "pubDate": "Mon, 24 Nov 2025 16:13:25 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p5l655/jual_tanah_banyak/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>jujur gw bingung harus cerita ke siapa, soalnya satu keluarga pun gaada yang ngerti soal beginian. intinya, dari sebelum gw lahir bapak gw hobi banget beli tanah. gw sendiri ga tau totalnya berapa, tapi yang bikin gw paling stress itu ada satu hamparan tanah sampai 47Ha. dulu bapak gw sering bangun perumahan kecil-kecilan, tapi ga pernah ada proyek sebesar ini. mungkin dulu beliau kepikiran bisa bangun rumah sendiri terus jual sendiri. masalahnya, SDM pekerja bapak gw tuh jelek banget. kayaknya cuma 2 orang, dan dua-duanya ga jelas jobdescnya apa. gaada yang bener-bener bisa manage lahan sebesar itu. ditambah lagi banyak kejadian dan kondisi keluarga yang bikin udah ga memungkinkan kalau mau bangun perumahan sendiri lagi.</p>\n\n<p>stok rumah yang tersisa sekarang dipasarkan lewat agen, tapi agen ini pun resourcenya minim, ga punya modal besar, ga punya koneksi ke perusahaan2 besar yang bisa develop lahan gede. sekarang bapak gw udah umur 70an, dan anak-anak serta menantu-menantunya ga ada yang punya background atau koneksi ke dunia properti. jadi beneran bingung harus mulai dari mana.</p>\n\n<p>yang kita pengen cuma satu: gimana caranya biar tanah seluas itu bisa dilirik perusahaan besar yang emang punya kapasitas buat bangun sesuatu di sana, apapun bentuknya, mau mereka ngebangun rumah, ruko, swalayan, mall apapun itu. jujur gw udah ga tau harus gimana.</p>\n\n<p>ohiya, gabisa post di r indo krn karma gw blm nyampe hehe</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    }
  ],
  "group": "country",
  "url": "https://redlib.perennialte.ch/r/indonesiabebas.rss",
  "lastFetched": "2025-11-25T08:56:25.584Z"
}