{
  "title": "Pria",
  "description": "Welcome to r/pria! A safe space for Indonesian men to share, connect, and understand.",
  "link": "",
  "items": [
    {
      "title": "Obrolan Akhir Bulan",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1p66tdf/obrolan_akhir_bulan/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1p66tdf/obrolan_akhir_bulan/",
      "pubDate": "Tue, 25 Nov 2025 08:01:25 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1p66tdf/obrolan_akhir_bulan/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Mari kita berkumpul dan bercerita di akhir bulan ini.</p>\n\n<p>Berhubung sekarang sub kita ini pengunjungnya makin banyak dan threadnya juga semakin banyak, maka thread obrolan mingguan diganti ke bulanan setiap tanggal 25.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Adakah website/ kanal berita yang menjelaskan secara rinci bagaimana skema / business model suatu criminal network, bisnis ilegal, korupsi, narkoba, dll bekerja?",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1p8dx89/adakah_website_kanal_berita_yang_menjelaskan/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1p8dx89/adakah_website_kanal_berita_yang_menjelaskan/",
      "pubDate": "Thu, 27 Nov 2025 21:46:11 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1p8dx89/adakah_website_kanal_berita_yang_menjelaskan/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"/preview/pre/kx3itcg1ev3g1.jpg?width=2560&amp;format=pjpg&amp;auto=webp&amp;s=bff33a19240c9b7d2ae11cf7373dc02b8bdad234\">/preview/pre/kx3itcg1ev3g1.jpg?width=2560&amp;format=pjpg&amp;auto=webp&amp;s=bff33a19240c9b7d2ae11cf7373dc02b8bdad234</a></p>\n\n<p>Saya iseng nyari bagaimana suatu pertambangan emas ilegal bekerja di Afrika, dan saya menemukan berita yang berisikan bahwa <a href=\"https://cenozo.org/how-gold-for-arms-trade-is-fuelling-terror-in-nigerias-northwest/\">Nigeria kehilangan $9 Milyar per tahun karena jaringan kriminal penambang ilegal dan bandit.</a></p>\n\n<p>Kalau berita seniri saya rasa banyak, namun tidak banyak yang beredar menjelaskan secara detail skema dan model bisnis nya seperti apa (atau saya saja yang kurang jauh dalam menelusuri jadi saya tidak menemukan? CMIIW). Yang saya temukan hanya menjelaskan suatu peristiwa, siapa, kapan, dan di mana, tidak dijelaskan by detail keseluruhan operasi.</p>\n\n<p>Maka saya mau bertanya, Untuk di Indonesia dan Global (tidak terbatas di Nigeria seperti yang saya temukan) adakah kanal berita atau situs yang memaparkan dengan detail skema kejahatan dan model nya seperti contoh yang saya ajukan?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Bro suggesting bro",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1p40iw6/bro_suggesting_bro/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1p40iw6/bro_suggesting_bro/",
      "pubDate": "Sat, 22 Nov 2025 18:31:28 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1p40iw6/bro_suggesting_bro/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hallo, finally found this sub reddit pengen cerita sedikit sebelum penghujung tahun</p>\n\n<p>Jadi awal tahun ini bokap meninggal di januari, dan tiba tiba semuanya jadi agak terasa berat (nyokap sering over thinking dan tiba tiba ga enak badan karena tekanan darahnya naik, takut kalau keseringan kena struk ya?) Mulai nanggung beberapa beban rumah, dan beberapa beban kerjaan</p>\n\n<p>Hubungan sama bokap dulu bisa dibilang sangat baik banget sampai di penghujung 2021 karena bokap ada ninggalin hutang yang gue rasa ga produktif dan karena beberapa alasan dia gue harus nganggur sampai 2024, mental sedikit rusak dan gue mutusin hubungan dengan beberapa temen dan keluarga</p>\n\n<p>Setelah sedikit usaha akhirnya di penghujung 2024 bisa dapet kerja walaupun ga seberapa gue cukup bersyukur untuk dikasih kesempatan dan sampai saat gue ngetik gue ngerasa secara kemampuan cukup improve</p>\n\n<p>Setelah bokap meninggal gue udah coba banyak refleksi diri dan belajar how to lead the family agak tegas mungkin dan keliatan perhitungan, tapi gue mau semuanya berdasarkan planning, gue tinggal bareng nyokap, kakak gue dan anaknya, serta suaminya dia, gue ga mau keuangan keluarga gue berantakan so gue bikinin pembukuan simpel untuk track biaya bulanan, dan ini gue dikritisi sama nyokap karena doi sebelumnya pas masih tinggal sama ortunya berkecukupan jadi apa apa ga perlu di budgeting yg gimana, tapi kondisi saat ini ekonomi kita ga kuat dan mesti sedikit adaptasi, dan ketika gue nerapin pembukuan dan sedikit dorongan untuk nyokap dan kakak gue untuk produktif dikit (mungkin bisa coba jual produk atau apa biar kita bisa support keuangan rumah) dan gue malah dikritisi dan dibilang gue ga usah terlalu perhitungan, so gue stop planning yang gue udah bikin, tapi seengganya gue tau berapa biaya untuk dapur gue ngebul tiap bulannya</p>\n\n<p>Kita ada aset yang sedang dalam proses jual, dan sebagian untuk tutupin hutang yg masih sisa (ini hutang personal sih, selebihnya ketika meninggal hutang dengan bank udah dihapusin semua) tapi ketakutan yang ada di gue adalah, apakah jual aset ini nyelesaiin semua masalah? Karena jujur mental tiap orang beda ketika pegang uang dan cash yang gue takutin adalah ketika uangnya udah dibagi sesuai porsi kita tapi mental untuk pegang uangnya ga siap dan abis begitu aja, mengingat nyokap pensiunan dan udah ga produktif, kakak gue ada ijazah s1 tapi mutusin untuk jadi ibu rumah tangga</p>\n\n<p>Di sisi lain gue bisa dibilang kafir mungkin ya? Setelah bokap meninggal gue mutusin untuk coba deket lagi sama yang diatas dan belajar ngaji, ini awal mula gue kembali terhubung ke semua hal, tiap bangun pagi gue selalu ngerasa kebingungan dan ga tau arah, tapi ajaibnya bantuan dari diatas atau clue nya selalu dateng lewat hal yang gue rasa ga mungkin</p>\n\n<p>Tapi akhir akhir ini gue ngerasa masa depan atau hal yang pengen gue tuju berasa agak jauh (gue ada di profesi yang mengharuskan gue untuk ambil sekolah profesi, ikatan asosiasi, dan magang yang cukup lama 2-6 tahun) apakah gue stick to the plan? Panjang sih tapi gue rasa gue cukup cinta sama bidang gue tapi secara karir ga terlalu menghasilkan (kecuali bisa praktek mandiri, jalur intrepreneur bukan karir) atau switch yang mana harus mulai dari 0, dan juga mungkin ada saran dari temen temen yang punya cerita serupa? Terkait keluarga, karir, dan finansial, atau sosok figur? Kadang sebagai cowo gue lihat kita ga terlalu ada figur yang bisa someone we looked up to, dan juga ga ada kompas untuk ngarahin kemana lagi kita ngelangkah.</p>\n\n<p>Ps : sorry for bad writing, its my first time write all my thought </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "[Update] Just reconnected with my childhood friend and somehow caught feelings(?)",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1p3pmeg/update_just_reconnected_with_my_childhood_friend/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1p3pmeg/update_just_reconnected_with_my_childhood_friend/",
      "pubDate": "Sat, 22 Nov 2025 10:03:36 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1p3pmeg/update_just_reconnected_with_my_childhood_friend/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>So some of you might remember my previous post about trying to get closer to my childhood friend and maybe — just maybe — confessing my feelings. But after thinking long and hard (and surviving a brutal reality check), I’ve decided… I’m tapping out.</p>\n\n<p>Apparently, in her world, once you’ve entered the Friend Zone — it’s not a zone. It’s a life sentence. If she already sees you as a friend or a best friend? Sorry buddy, you’re emotionally neutered forever. Only acquaintances get a shot at dating her. Friendship is the final form… and it’s not evolving.</p>\n\n<p>And then… the meals.</p>\n\n<p>We’ve hung out over 8 times totally. I paid every single time. Not because I’m trying to buy love — but because I thought it was a nice gesture. I’m a simple man. All I wanted was a tiny “thank you.” Two words. One second. But nope. Never came. Not once. Maybe I’m too sensitive. Maybe expecting basic appreciation is now considered an extreme sport. But I realized: if I feel this unseen now, imagine how invisible I’d be as a boyfriend.</p>\n\n<p>So yeah… chapter closed. I’ll keep her as a friend.</p>\n\n<p>For those who said what in the fkin kdrama or anime my story was. It is not haha lol</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How much do you love/care about your younger brothers?",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1p470j7/how_much_do_you_lovecare_about_your_younger/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1p470j7/how_much_do_you_lovecare_about_your_younger/",
      "pubDate": "Sat, 22 Nov 2025 23:09:20 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1p470j7/how_much_do_you_lovecare_about_your_younger/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Mau yang gap nya kecil (1-3 tahun) atau yang gede (&gt;5 tahun) sekalipun, feel free to choose your option and also your reaaon in the comments</p>\n\n<p><a href=\"/poll/1p470j7\">View Poll</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Tempat sewa jas di Jogja dan sekitarnya?",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1okm6wk/tempat_sewa_jas_di_jogja_dan_sekitarnya/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1okm6wk/tempat_sewa_jas_di_jogja_dan_sekitarnya/",
      "pubDate": "Fri, 31 Oct 2025 05:17:42 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1okm6wk/tempat_sewa_jas_di_jogja_dan_sekitarnya/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Lagi nyari sewa jas di jogja dan sekitarnya buat papa. Nyarinya warna navy dan yang agak casual, gak mau yang formal dan polos.</p>\n\n<p>Sebenarnya udah nemu yang ok tapi di jkt, sedangkan keluarga gue ga langsung pulang abis acara, jd sewanya mahal :(</p>\n\n<p>Adakah yang pernah sewa jas di jogja yang koleksinya bagus2? Udah nyari di IG dan tiktok tapi koleksinya agak jadul dan standar aja. </p>\n\n<p>Makasi guys!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Still counting",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1ojov4i/still_counting/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1ojov4i/still_counting/",
      "pubDate": "Thu, 30 Oct 2025 03:06:11 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1ojov4i/still_counting/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>aku laki 33y,</p>\n\n<p>i love someone since jhs, sampe sekarang ak udah nikah anak 1, perasaan itu ga pernah berubah. Sometime kalau tidur aku ngimpi dia, terus bangun dan sakit banget hati ini, karena sadar cuma mimpi. Its really hurts. </p>\n\n<p>November ini dia ulang tahun ke 33 juga, im sure she is happly married with her kids too. I wish you always in good condition and happiness. </p>\n\n<p>Love u without wax.\n112-crazy over u</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Racket Tennis",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1oi2etk/racket_tennis/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1oi2etk/racket_tennis/",
      "pubDate": "Tue, 28 Oct 2025 06:44:30 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1oi2etk/racket_tennis/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Im newbie in Tennis and looking forward to buy me a new racket. I have no idea which kind is the best for newbie-beginner. Maybe something not too expensive, under 1.5mio. Have any suggestions?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "The Goon Squad, by Daniel Kolitz",
      "link": "https://harpers.org/archive/2025/11/the-goon-squad-daniel-kolitz-porn-masturbation-loneliness/",
      "guid": "https://harpers.org/archive/2025/11/the-goon-squad-daniel-kolitz-porn-masturbation-loneliness/",
      "pubDate": "Mon, 27 Oct 2025 07:55:35 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1oh8i9z/the_goon_squad_by_daniel_kolitz/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>This is one of the most interesting piece I&#39;ve read today.</p>\n\n<p>interesting and depressing, I don&#39;t know there are young men so addicted to porn, they compress it into a music video to consume more porn at shorter time, dedicating life for porn.</p>\n\n<p>they&#39;re not having problem with finding girlfriend or partner, it&#39;s just they prefer porn....</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Timothy Ronald itu beneran pinter atau name-bombing? Dan bagaimana cara ngejar level pengetahuannya (kalau beneran pinter)",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1oftk4o/timothy_ronald_itu_beneran_pinter_atau/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1oftk4o/timothy_ronald_itu_beneran_pinter_atau/",
      "pubDate": "Sat, 25 Oct 2025 14:54:57 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1oftk4o/timothy_ronald_itu_beneran_pinter_atau/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Gua nanya di sini karena belum cukup karma buat post di <a href=\"/r/finansial\">r/finansial</a>. </p>\n\n<p>Timothy Ronald itu bacaannya apa aja? Belajarnya di mana? Apakah harus terjun praktik trading langsung biar bisa menyamai level pengetahuannya?</p>\n\n<p>Kayaknya banyak influencer yang baca buku soal ekonomi, investasi, dll di Indonesia, tapi belum tentu ngomongnya lancar dan jelas kayak Timothy Ronald? Yang dia omongin itu emang beneran precise atau cuma name-bombing (pake istilah keren biar keliatan pintar) ??</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Obrolan Akhir Bulan",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1oflx5f/obrolan_akhir_bulan/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1oflx5f/obrolan_akhir_bulan/",
      "pubDate": "Sat, 25 Oct 2025 08:01:05 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1oflx5f/obrolan_akhir_bulan/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Mari kita berkumpul dan bercerita di akhir bulan ini.</p>\n\n<p>Berhubung sekarang sub kita ini pengunjungnya makin banyak dan threadnya juga semakin banyak, maka thread obrolan mingguan diganti ke bulanan setiap tanggal 25.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Gentrifikasi di depan mata ane langsung",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1od3xc7/gentrifikasi_di_depan_mata_ane_langsung/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1od3xc7/gentrifikasi_di_depan_mata_ane_langsung/",
      "pubDate": "Wed, 22 Oct 2025 09:49:54 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1od3xc7/gentrifikasi_di_depan_mata_ane_langsung/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Masalah serius berupa Gentrifikasi di depan mata ane. (Gara-gara boomer)</p>\n\n<p>Disclaimer yang mau ane highlight bukan rasis atau nyalahin pendatang, sebaliknya, ane mau menyadarkan orang-orang yang terlalu nyantai dengan apa yang terjadi dan tidak mau berubah.</p>\n\n<p>Ane tinggal di salah satu provinsi besar di Pulau Jawa. Clue: KTP lu mana boss? Nrimo Ing Pandum.</p>\n\n<p>Tanah-tanah dan perumahan kelas menengah-atas dibeli oleh orang luar daerah tsb, bahkan beberapa dibeli orang Bule yang nikah sama orang Indo.</p>\n\n<p>Tanah yang dibeli dijadikan pabrik mebel, kerajinan, atau sejenisnya yang berkaitan dengan konstruksi.\nPabriknya gede-gede, for real.\nProduknya diekspor ke luar negeri.</p>\n\n<p>Orang yang dari jaman kakek-neneknya di sana either pada jadi labor, atau pergi merantau ke daerah lain kayak Jakarta, Bekasi, dsb.\nOwner pabriknya pendatang. \nYa, beberapa ada juga orang asli situ.</p>\n\n<p>Gua orang hukum, as long as they are here legally, udah punya izin, bangun pabrik secara legal, mendapatkan tanah secara legal, ya udah gua gak masalah lu mau asal daerah mana atau etnis apa.</p>\n\n<p>Yang gua permasalahin itu penduduk asli situnya yang gak membuka mata dan gak sadar urgensi dan pentingnya keep up the pace with competition. </p>\n\n<p>Orang kenapa gak sadar dunia ini kompetitif?<br/>\nHarga tanah makin naik karena demand nya yang tinggi. Pemilik tanah bersedia melepas tanahnya kepada highest bidder (penawar tertinggi), in this case, mereka yang income nya tinggi lah yang berani menawar harga tinggi untuk tanahnya.</p>\n\n<p>Sekarang kalau penduduk asli situ nyantai² aja kyk &quot;Mending tinggal di Kabupaten ah, chill, santai, banyak sawah, slow pace&quot; kyk mau keep up with the pace?\nYa, 20 tahun lalu itu tanah masih murah, sekarang mahal. 20 tahun lagi? Makin mahal. </p>\n\n<p>Sekarang aja itu tanah masih sawah, enak yaa dilihat, dipandang sejuk, dll. Tapi 30 tahun lagi? Itu tanah udah dibeli orang dan udah berubah jadi beton. Salah yang bangun beton? Ya kagak, mereka juga butuh rumah. Salah mereka yang nyepelein dan gak keep up the pace.</p>\n\n<p>Ada salah satu tempat wisata yang didemo warga lokal dan minta ditutup dengan alasan itu tempat terlalu mahal untuk warlok dan yang dateng ke tempat wisata itu mostly wisatawan dari luar kota.</p>\n\n<p>Pertanyaan gw, bukankah bagus ya kalau makin banyak revenue yang masuk ke daerah itu melalui wisata, nanti kan warlok juga ikutan kecipratan duitnya? (buka warung, resto, jual merchandise, jual jasa tour guide, dll).</p>\n\n<p>Jaman dulu Boomer juga waktu bikin anak banyak betul bisa sampe 8-10 anak, tapi ya udah gak dibekali investment kek ditinggalin usaha, atau dikuliahin biar dapet kerjaan layak. Mereka gak sadar dunia berubah dan tidak stagnan dengan jaman mereka dulu masih muda. Ya, I blame boomers tbh.</p>\n\n<p>Mohon tanggapan dan dikritisi atas post saya.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Just reconnected with my childhood friend and somehow caught feelings(?)",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1oc3h1c/just_reconnected_with_my_childhood_friend_and/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1oc3h1c/just_reconnected_with_my_childhood_friend_and/",
      "pubDate": "Tue, 21 Oct 2025 04:24:46 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1oc3h1c/just_reconnected_with_my_childhood_friend_and/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I’m currently seeing someone — my childhood friend. And when I say “childhood,” I really mean it. Our moms have been friends since before we were even born.</p>\n\n<p>We basically grew up together. During school, we went to the same school for a few years and even attended the same cram school. Back then, if I had my own vehicle, I’d usually pick her up and we’d go together — to school, to cram class, and back home. It was just… natural.</p>\n\n<p>Then, life happened. I went overseas for college, and we completely lost contact for about five years.</p>\n\n<p>Fast forward to a month ago — we reunited. We’ve only hung out around three or four times since then, mostly on weekends.\nWhen I first saw her again, honestly, I didn’t feel anything romantic. It was just nostalgia and catching up.</p>\n\n<p>But by the second, third, and fourth meetups… something changed. I started to feel something for her.</p>\n\n<p>The thing is — I have no idea what I am in her eyes.</p>\n\n<p>We rarely chat through messaging apps, but when we meet in person, we talk a lot (well, she does most of the talking). I ask questions, she answers eagerly, but she rarely asks me anything back. That kinda confuses me.</p>\n\n<p>Now, she’s super busy with work and is about to leave for a two-week family trip to Europe.\nWe probably won’t see each other for at least three weeks. But I wanted to do something meaningful, so I reached out to some friends in Europe to help guide her and make her trip smoother. Just a small gesture, I guess.</p>\n\n<p>So… here I am.</p>\n\n<p>I think I’m catching feelings for her, but I’m not sure how she feels or if I’m reading too much into things.</p>\n\n<p>What should I do, guys?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Ada yang pernah beli parfum refill dan hasilnya memuaskan?",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1o3vfb4/ada_yang_pernah_beli_parfum_refill_dan_hasilnya/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1o3vfb4/ada_yang_pernah_beli_parfum_refill_dan_hasilnya/",
      "pubDate": "Sat, 11 Oct 2025 13:17:50 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1o3vfb4/ada_yang_pernah_beli_parfum_refill_dan_hasilnya/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Akhir-akhir ini mulai tertarik sama parfum, tapi parfum branded harganya relatif mahal buat mahasiswa. Lalu denger kalau parfum refill bisa request scents dan jauh lebih murah. Gua prefer ini karena bisa sekalian kenal sama jenis² scent parfum. Tapi denger² SPL nya parfum refill loyo dan baunya &quot;gitu-gitu aja&quot; (gk tau maksudnya apa karena gk pernah nyium parfum). So, apakah refill recommended buat pemula atau mending nabung buat beli yang proper kayak mykonos atau parfum timteng? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Perawatan Wajah",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1o2qac0/perawatan_wajah/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1o2qac0/perawatan_wajah/",
      "pubDate": "Fri, 10 Oct 2025 03:29:22 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1o2qac0/perawatan_wajah/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Boleh minta tips &amp; saran jenis produk apa yang harus saya gunakan jika kondisi wajah saya:<br/>\nNormal tidak berminyak &amp; tidak berjerawat, tetapi kadang terlihat pucat.</p>\n\n<p>Target saya agar wajah terlihat lebih cerah &amp; tidak pucat. Kulit saya tipikal Asia Timur. Sudah beberapa bulan (tapi tidak selalu setiap hari) menggunakan:</p>\n\n<p>A. Facewash: 1 kali sehari saat mandi sore.<br/>\nB. Sunscreen: 1 kali sehari setelah mandi pagi.  </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Besides Dating App, kenal dari School/work, where and how you can meet potential dates?",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1o12wh4/besides_dating_app_kenal_dari_schoolwork_where/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1o12wh4/besides_dating_app_kenal_dari_schoolwork_where/",
      "pubDate": "Wed, 8 Oct 2025 06:20:59 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1o12wh4/besides_dating_app_kenal_dari_schoolwork_where/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Title basically says it all. And of course women can answer too. Thank you everyone</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "MALAM INI SAATNYA GARUDA BERAKSI!",
      "link": "/img/t4t26seyextf1.jpeg",
      "guid": "/img/t4t26seyextf1.jpeg",
      "pubDate": "Wed, 8 Oct 2025 17:53:09 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1o1hnnj/malam_ini_saatnya_garuda_beraksi/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Indonesia vs Arab Saudi</p>\n\n<p>Kick-off: 00.15 WIB (9 Oktober 2025)</p>\n\n<p>Semangat tempur anak bangsa kembali berkobar!</p>\n\n<p>Skuad Merah Putih siap menantang kekuatan Asia di malam penuh gengsi ini.</p>\n\n<p>Dari tribune sampai timeline, seluruh Indonesia bersatu dukung Garuda!</p>\n\n<p>Ayo tunjukkan semangat pantang menyerah, tunjukkan kalau Indonesia layak disegani di Asia!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Minta rekomen Sling bag",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1nzc38r/minta_rekomen_sling_bag/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1nzc38r/minta_rekomen_sling_bag/",
      "pubDate": "Mon, 6 Oct 2025 06:56:29 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1nzc38r/minta_rekomen_sling_bag/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Saya sedang cari sling bag yang durable tapi saya buta merk. Hanya untuk bawa hp, dompet, charger, tws, kunci. Mohon rekomendasi nya pria2 reddit</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Cristiano tidak bisa berhenti SIUU!",
      "link": "",
      "guid": "",
      "pubDate": "Fri, 26 Sep 2025 20:12:35 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1nrbokr/cristiano_tidak_bisa_berhenti_siuu/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Al Nassr sementara unggul 2-0 atas Ittihad!</p>\n\n<p>CR7 kembali jadi pembeda malam ini—aksi luar biasa dari legenda hidup!</p>\n\n<p>Bagaimana pendapatmu mengenai performa Al Nassr vs Al Ittihad?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Obrolan Akhir Bulan",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1nq0vio/obrolan_akhir_bulan/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1nq0vio/obrolan_akhir_bulan/",
      "pubDate": "Thu, 25 Sep 2025 08:01:29 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1nq0vio/obrolan_akhir_bulan/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Mari kita berkumpul dan bercerita di akhir bulan ini.</p>\n\n<p>Berhubung sekarang sub kita ini pengunjungnya makin banyak dan threadnya juga semakin banyak, maka thread obrolan mingguan diganti ke bulanan setiap tanggal 25.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Would this work di Indonesia? Apakah cincin kawin tanda untuk menjaga jarak atau bisa jadi reverse psychology juga?",
      "link": "/img/ygmxfrr960rf1.png",
      "guid": "/img/ygmxfrr960rf1.png",
      "pubDate": "Wed, 24 Sep 2025 04:29:29 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1np2y5m/would_this_work_di_indonesia_apakah_cincin_kawin/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/pria/comments/1np2y5m/would_this_work_di_indonesia_apakah_cincin_kawin/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "*insert sgt doakes gif meme*",
      "link": "/img/dign6u4jd4qf1.jpeg",
      "guid": "/img/dign6u4jd4qf1.jpeg",
      "pubDate": "Fri, 19 Sep 2025 13:00:50 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1nl2xo6/insert_sgt_doakes_gif_meme/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I saw the profile and all the pictures is pixelated which I think it&#39;s a screenshoted pic, even though it got the &quot;Pic Verified&quot;, and there&#39;s no way you this excited meeting some stranger you barely even know, either it&#39;s fake or this person has 0 survival instinct </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "karma gegara labil",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1nknoti/karma_gegara_labil/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1nknoti/karma_gegara_labil/",
      "pubDate": "Thu, 18 Sep 2025 23:24:05 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1nknoti/karma_gegara_labil/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>jadi pas gw baru masuk SMK gw dapet tugas kelompok, anggota kelompoknya itu bocah-bocah yang sering bolos dll, selain bocah-bocah itu ada satu cewe dan kita berdua sama-sama kesel lah karena sekelompok sama orang yang begitu, setelah itu gw sama cewe itu jadi lumayan deket karena selalu berdua ngerjain tugas kelompoknya di lab komputer, tumbuh benih-benih cinta lah gitu wkwk. </p>\n\n<p>sekitar 2 bulanan gw pdkt ini akhirnya gw tembak dan diterima untungnya. well, 1 bulan pacaran itu berjalan lancar sampai akhirnya entah kenapa perasaan gw ini labil, contohnya simple nya gini, pagi ke sore itu gw kek gapunya perasaan cinta ke dia lalu di malam hari gw kecintaan banget sama dia. itu selalu terjadi sampai akhirnya di kenaikan kelas 11 gw diputusin karena alasan gw kebanyakan main game, nah berbulan-bulan berlalu sampai pada waktunya gw Praktik Lapangan Kerja (PKL) atau bsa disebut magang lah, disitu dia chat dan mulai ngedeketin gw lagi, selang berapa minggu akhirnya kita balikan dan ya merasakan perasaan labil itu lagi di 1 bulan setelah balikan, tapi untung nya ga sampai putus. lalu ga lama dari itu masa PKL selesai dia, nah gw ini JARANG banget ngelakuin pacaran di sekolah kayak duduk berdua di kelas, ke kantin bareng, foto bareng, bahkan chatan, karena gw terlalu sibuk main bareng temen-temen gw, dan gw pikir itu fine aja karena dia juga ga minta, lalu setelah lama nya kita berpacaran itu gw mulai ngerasa kayak waktu dulu kelas 10, labil gitu lah. </p>\n\n<p>akhirnya setelah berminggu-minggu perasaan gw labil, gw diputusin sama dia dengan alasan</p>\n\n<p>&quot;kamu terlalu fokus sama diri sendiri&quot;,</p>\n\n<p>nah gw galau dah itu. berbulan-bulan berlalu akhirnya kita naik ke kelas 12 dan apes nya kita sekelas lagi, tapi walaupun gw telah ngelakuin hal yang jahat dia tetap baik ke gw, selang beberapa bulan kita balikan lagi, disitu gw berusaha untuk tetap mencintainya biar ga kayak las kelas 10 dan 11.</p>\n\n<p>yah akhirnya gw pun berhasil ga labil selama berbulan-bulan, sampai akhirnya kita jadi salah satu panitia jurusan di acara sekolah, kita nginep di sekolah (beda ruangan ye), trus nobar di lab komputer, kemana mana berdua, ya pokoknya pacaran deh sampe kita dijulidin sma orang karna sibuk pacaran terus. sampai pada akhirnya acara itu selesai dan mulai sekolah seperti biasa lagi, dan yah gw merasakan perasaan labil lagi kayak dulu, gw nge ignore chat dia, gamau ngomongin tentang hubungan kayak ngehindar buat deeptalk lah, gw dikasih sama temen dia kalo dia kangen gw yang pas acara sekolah.\nmalam nya setelah pulang kerja part time gw di dm sama orang, isi dm nya gini</p>\n\n<p>&quot;cowo gatelan, makanya daridulu setia pas dia nya sama orang baru lu comot lagi&quot;</p>\n\n<p>gw disitu bingung soalnya di kelas 12 itu kita lumayan lama pacaran dan ga mungkin dia ada orang baru, gw dulu pikirnya begitu. lalu gw tanya lah ke pacar gw ini siapa abistu dia jawab nya gini </p>\n\n<p>&quot;ih dia itu temen online lama aku yang suka sama aku tau, kayaknya dia stalk kamu trus liat fotbar kita di postingan kamu dan kamu tau gak, dia itu CEWEK, ihh merinding tau disukain sama cewe&quot;</p>\n\n<p>sebenernya gw bingung juga misal orang itu temen nya harusnya orang itu tau kita berdua pacaran dri lama, tpi kok ini gatau, yah gw ga terlalu mikirin itu karena sibuk ngegame, gw cuma nurutin permintaan pacar gw untuk nge blok akunnya. \nberminggu-minggu berlalu akhirnya diputusin juga dengan alasan</p>\n\n<p>&quot;mungkin masa kita udah habis&quot;,</p>\n\n<p>gw nerima chat itu pas kerja part time jadi gw cuman jawab</p>\n\n<p>&quot;yaudah klo itu yang kamu mau&quot;.</p>\n\n<p>malam itu dia ngechat lagi,</p>\n\n<p>&quot;kamu kenal si P**** Anak Akuntansi?&quot;, \ngw jawab &quot;enggak, kenapa emang?&quot;,</p>\n\n<p>dia jawab &quot;ada akun fake yang pura-pura jadi kamu, pake nama kamu terus dia deketin si P****&quot;.</p>\n\n<p>dan goblok nya gw itu gw mikir gara gara akun ini kita berdua bisa putus, tpi itu dibantah sama dia karena dia bilang dia percaya sama gw kalo gw gabakal nyelingkuhin dia, rumor klo gw nyelingkuhin pacar gw ini nyebar ke sirkel nya dan gw kayak di cap cowo brengsek lalu gw berusaha bersihin nama gw dengan cari tau siapa orang dibalik akun fake itu dan hasil nya nihil, akun fake nya sempet ngebales dm gw gini katanya </p>\n\n<p>&quot;gw ngelakuin itu cuma karena gw gasuka sama si P*<strong><em>, trus gw itu sebenernya ga pake nama lu, gw cuma nge iyain tebakan si P</em></strong>*, dia nyebut nama lu sambil nunjukin foto lu dri ig kelas trus gw iyain&quot; </p>\n\n<p>ternyata setelah si P**** tau itu, dia lgsg percaya trus dia cari cari gw di sekolah sampe si P**** ini tau ternyata gw udh punya pacar dan si P**** pikir dia mau dijadiin selingkuhan, lalu dia kasih tau temen dia yang kenal pacar gw, dia mau ngasih tau kalo gw mau nyelingkuhin gw padahal enggak. </p>\n\n<p>dan yeah dibalik semua itu gw merasa bersalah sama pacar gw karena setelah semuanya terjadi dia tetap percaya sama gw, gw merasa bersalah sedalam dalamnya waktu itu. </p>\n\n<p>well kenyataan nya ga begitu, setelah 4 hari kita berdua putus, dia ngepost pacar barunya dan lebih mengejutkannya lagi dia pacaran sama orang yang nge dm gw dulu, dan gw ngerasa di boongin, dia udah ngejelek jelekin itu orang tapi trnyata malah pacaran sama dia, yes dia LESBIAN. disaat itu gw kaget sama bersyukur juga, kaget karena gw diboongin dan bersyukur rasa bersalah gw berkurang. </p>\n\n<p>maaf terlalu banyak guys, gw hanya mau cerita pengalaman gw, gw siap di judge atau lu hina gw juga gpp gw ikhlas. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Renungan sebelum banting tulang",
      "link": "/img/dwmkwkdcuopf1.jpeg",
      "guid": "/img/dwmkwkdcuopf1.jpeg",
      "pubDate": "Thu, 18 Sep 2025 03:38:17 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1njxx5u/renungan_sebelum_banting_tulang/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/pria/comments/1njxx5u/renungan_sebelum_banting_tulang/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Outfit tips for a sweaty person",
      "link": "https://redlib.perennialte.ch//r/pria/comments/1njzddz/outfit_tips_for_a_sweaty_person/",
      "guid": "https://redlib.perennialte.ch//r/pria/comments/1njzddz/outfit_tips_for_a_sweaty_person/",
      "pubDate": "Thu, 18 Sep 2025 04:58:52 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/pria/comments/1njzddz/outfit_tips_for_a_sweaty_person/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Simpel aja, gua mau tanya buat orang yang gerahan, gimana kalian nge combine baju untuk formal atau nonformal kayak date, main ke mall, dll. Gua tipe orang yang punggungnya gampang banget gerah, yang sekalinya gerah kayak udah disiram air gitu. Selama ini tiap gua pergi kemanapun naik motor, selalu pake jaket dulu, baru pas udah di lokasi ganti baju. Tapi terlalu ribet, siapa tau ada saran?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    }
  ],
  "group": "country",
  "url": "https://redlib.perennialte.ch/r/pria.rss",
  "lastFetched": "2025-11-28T23:31:39.470Z"
}