{
  "title": "indotech",
  "description": "Anything related to technology for r/indonesia citizens, from hardware, software, programming, gaming, tech news, AI, career advice, tutorial, events, bootcamp, tech memes etc.",
  "link": "",
  "items": [
    {
      "title": "Monthly General Discussion – November 2025 | Technology Indonesia",
      "link": "https://redlib.perennialte.ch//r/indotech/comments/1ol02vj/monthly_general_discussion_november_2025/",
      "guid": "https://redlib.perennialte.ch//r/indotech/comments/1ol02vj/monthly_general_discussion_november_2025/",
      "pubDate": "Fri, 31 Oct 2025 17:01:07 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1ol02vj/monthly_general_discussion_november_2025/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Welcome to <a href=\"/r/indotech\">r/indotech</a>&#39;s monthly discussion! This is the place to share thoughts, questions, insights, or just casual conversations about anything related to technology.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Resource and Project Showcase - November 2025",
      "link": "https://redlib.perennialte.ch//r/indotech/comments/1ol02wx/resource_and_project_showcase_november_2025/",
      "guid": "https://redlib.perennialte.ch//r/indotech/comments/1ol02wx/resource_and_project_showcase_november_2025/",
      "pubDate": "Fri, 31 Oct 2025 17:01:10 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1ol02wx/resource_and_project_showcase_november_2025/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Welcome to Resource and Project Showcase thread. Karena thread Project Showcase sebelumnya sepi, jadi gw coba initiate untuk bikin Resource thread yang gw gabungin jadi satu dengan Project Showcase.</p>\n\n<p>Jadi di thread ini selain kalian bisa pamerin project, kalian bisa bikin post atau komen langsung disini, Resource yang sekiranya bermanfaat tentang apapun seputar dunia tech.</p>\n\n<p><strong>PC Building and Laptop</strong><br/>\n<a href=\"/r/buildapc/comments/1d18pqr/psu_tier_list_rev_170g_as_an_excel_sheet/\">PSU Tier List</a> -<a href=\"/r/buildapc/comments/1d18pqr/psu_tier_list_rev_170g_as_an_excel_sheet/\"> (src)</a></p>\n\n<p><strong>Device and Gadget</strong><br/>\n-</p>\n\n<p><strong>Software Engineering and Programming</strong><br/>\n<a href=\"https://docs.google.com/document/d/1a4Dkrj07p9UYZdBrpqe8uvKBUpHqxJM0E349Rw7ooX0/edit?tab=t.0\">Web Development Bootcamp</a> by <a href=\"/u/cabe-rawit\">u/cabe-rawit</a></p>\n\n<p><strong>Cloud and Infra</strong><br/>\n<a href=\"https://lowend-deals.xbit.win/\">Sewa VPS</a></p>\n\n<p><strong>Network and Cybersecurity</strong><br/>\n<a href=\"https://www.youtube.com/watch?v=8NlIxydgoEc\">Introduction to Cybersecurity</a> - <a href=\"/r/indotech/comments/1gddu43/introduction_to_cybersecurity_industry_by/\">(src)</a> <a href=\"/r/indotech/comments/1gddu43/introduction_to_cybersecurity_industry_by/\"> </a></p>\n\n<p><strong>Gaming</strong><br/>\n<a href=\"https://docs.google.com/spreadsheets/d/1yPYfhoP_jeMT24qF_EaFf8e7w9NEoL8obwVksG8jyC4/edit?usp=sharing\">Gamepad List Spreadsheet</a> - <a href=\"/r/indotech/comments/1h0u6fl/gamepad_list_spreadsheet/\">(src)</a></p>\n\n<p>Untuk sementara gw langsung taruh disini sesuai kategori. Ntar kalo misal udah kepanjangan, I&#39;ll consider using excel or notion page biar lebih gampang buat navigate.</p>\n\n<p>Sebenernya banyak banget link-link bagus tertimbun. Cuma males nge-scroll wkwkwk.</p>\n\n<p>Untuk Project Showcase masih gw taruh di link yang sama.<br/>\n<a href=\"https://wary-wok-1ca.notion.site/r-indoytech-Project-Showcase-Archive-11117ef02dde80eb9752d5c74448fd5c?pvs=25\">https://wary-wok-1ca.notion.site/r-indoytech-Project-Showcase-Archive-11117ef02dde80eb9752d5c74448fd5c?pvs=25</a></p>\n\n<p>Silahkan kalau ada masukan atau apapun, we are open to suggestions. Thanks.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Komdigi siapkan aturan baru, pemilik HP wajib rekam wajah",
      "link": "/img/nn1i9c75ll3g1.jpeg",
      "guid": "/img/nn1i9c75ll3g1.jpeg",
      "pubDate": "Wed, 26 Nov 2025 12:49:43 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p76wko/komdigi_siapkan_aturan_baru_pemilik_hp_wajib/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Kementerian Komunikasi dan Digital (Komdigi) tengah menyiapkan aturan baru yang akan mewajibkan pelanggan seluler melakukan registrasi menggunakan data kependudukan biometrik pengenalan wajah (face recognition).</p>\n\n<p>Sebelumnya, proses registrasi pelanggan jasa telekomunikasi hanya menggunakan Nomor Induk Kependudukan (NIK)dan nomor Kartu Keluarga (KK). Namun, mekanisme tersebut dinilai masih membuka peluang penyalahgunaan identitas milik orang lain untuk berbagai tindakan kejahatan seperti penyebaran hoaks, judi online, SMS spam, dan penipuan.</p>\n\n<p>&quot;Sehingga perlu dilakukan penyempurnaan terhadap ketentuan registrasi pelanggan jasa telekomunikasi agar mampu memastikan validitas data pelanggan jasa telekomunikasi dilakukan secara aman, efektif, dan efisien,&quot; ujar Komdigi dalam pernyataan tertulisnya.</p>\n\n<p>Komdigi menjelaskan bahwa sesuai Pasal 153 ayat (2) PM 5/2021, penyelenggara jasa telekomunikasi wajib menerapkan prinsip mengenal pelanggan (Know Your Customer/KYC). Prinsip ini dapat dilakukan melalui registrasi menggunakan data kependudukan biometrik pengenalan wajah (face recognition). Namun, aturan teknis mengenai penggunaan biometrik tersebut belum diatur dalam PM 5/2021.</p>\n\n<p>&quot;Berdasarkan pertimbangan tersebut di atas, perlu adanya Peraturan Menteri yang mengatur ketentuan teknis registrasi pelanggan jasa telekomunikasi menggunakan data kependudukan biometrik pengenalan wajah (face recognition) untuk meningkatkan validitas data pelanggan guna memperkuat keamanan digital secara nasional melalui Peraturan Menteri tentang Registrasi Pelanggan Jasa Telekomunikasi Melalui Jaringan Bergerak Seluler (RPM Registrasi Pelanggan),&quot; tambah Komdigi.</p>\n\n<p>Rancangan Peraturan Menteri (RPM) Registrasi Pelanggan ini merupakan bagian dari Program Kerja Kementerian Komunikasi dan Digital Tahun Anggaran 2025.</p>\n\n<p>Beberapa poin material baru yang akan diatur dalam RPM tersebut, antara lain:</p>\n\n<blockquote>\n<p>1 . Kewajiban registrasi bagi calon pelanggan WNI, meliputi:</p>\n\n<p>Nomor MSISDN atau nomor Pelanggan Jasa Telekomunikasi;</p>\n\n<p>Data kependudukan berupa NIK;</p>\n\n<p>Data kependudukan biometrik berupa teknologi pengenalan wajah (face recognition).</p>\n\n<p>2 . Ketentuan khusus bagi calon pelanggan berusia di bawah 17 tahun dan belum menikah, yang belum memiliki KTP elektronik maupun data biometrik. Registrasi wajib menggunakan:</p>\n\n<p>Nomor MSISDN yang digunakan;</p>\n\n<p>NIK calon pelanggan;</p>\n\n<p>NIK dan data biometrik kepala keluarga sesuai data pada Kartu Keluarga.</p>\n\n<p>3 . Kewajiban registrasi untuk pelanggan eSIM, yaitu menggunakan:</p>\n\n<p>Nomor MSISDN atau nomor pelanggan;</p>\n\n<p>NIK dan data biometrik pengenalan wajah (face recognition).</p>\n</blockquote>\n\n<p>Komdigi mengatakan beberapa hal pokok yang diatur dalam RPM Registrasi Pelanggan mencakup Registrasi pelanggan jasa telekomunikasi, baik prabayar maupun pascabayar, Keamanan data pelanggan, Perlindungan nomor pelanggan, Pengawasan dan pengendalian, dan Ketentuan peralihan.</p>\n\n<p>Adapun, penerapan aturan ini akan dilakukan secara bertahap selama satu tahun sejak Peraturan Menteri diundangkan, registrasi masih dapat menggunakan NIK dan No. KK, sementara biometrik face recognition bersifat opsional. Tahap ini bertujuan memberikan ruang sosialisasi serta memastikan kesiapan penyelenggara telekomunikasi.</p>\n\n<p>Setelah masa satu tahun berakhir, registrasi hanya dapat dilakukan menggunakan NIK dan biometrik face recognition.</p>\n\n<p>Komdigi menyebutkan bahwa ketentuan penggunaan biometrik ini hanya berlaku bagi pelanggan baru. Pelanggan eksisting yang telah teregistrasi menggunakan NIK dan No. KK tidak diwajibkan melakukan registrasi ulang (opsional).</p>\n\n<p>Selengkapnya di detikinet</p>\n\n<p>inet detik com/law-and-policy/d-8226062/komdigi-siapkan-aturan-baru-pemilik-hp-wajib-rekam-wajah </p>\n\n<p><a href=\"https://m.facebook.com/story.php?story_fbid=1396427731831445&amp;id=100043926949275\">https://m.facebook.com/story.php?story_fbid=1396427731831445&amp;id=100043926949275</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Harga ram ddr5 32gb lebih mahal dari konsol",
      "link": "/gallery/1p74zmj",
      "guid": "/gallery/1p74zmj",
      "pubDate": "Wed, 26 Nov 2025 11:04:51 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p74zmj/harga_ram_ddr5_32gb_lebih_mahal_dari_konsol/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p74zmj/harga_ram_ddr5_32gb_lebih_mahal_dari_konsol/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Advice on iOS developer job market",
      "link": "https://redlib.perennialte.ch//r/indotech/comments/1p7hi3p/advice_on_ios_developer_job_market/",
      "guid": "https://redlib.perennialte.ch//r/indotech/comments/1p7hi3p/advice_on_ios_developer_job_market/",
      "pubDate": "Wed, 26 Nov 2025 19:47:36 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p7hi3p/advice_on_ios_developer_job_market/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Alhamdulillah dapat kesempatan jdi learner di Apple Developer Academy 2026. Super excited, tapi aga concern setelah graduate nanti apakah job market mobile developer terutama native iOS masih aman di akhir 2026? </p>\n\n<p>Atau lebih baik belajar/lanjutin skill lain yang lebih demanding sambil ikut academy? (Fullstack webdev/AI related mungkin?). Posisi sekarang fresh grad unemployed dengan pengalaman minim di web development dan ngga pede bisa dapet job yang &quot;oke&quot; dengan skill sekarang. Harapannya pengalaman di academy ini bisa nambahin porto yang sepi.</p>\n\n<p>Terima kasih sebelumnya.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Pemula di dunia PC tanya review merek parts.",
      "link": "https://redlib.perennialte.ch//r/indotech/comments/1p73xxa/pemula_di_dunia_pc_tanya_review_merek_parts/",
      "guid": "https://redlib.perennialte.ch//r/indotech/comments/1p73xxa/pemula_di_dunia_pc_tanya_review_merek_parts/",
      "pubDate": "Wed, 26 Nov 2025 10:00:34 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p73xxa/pemula_di_dunia_pc_tanya_review_merek_parts/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Terakhir punya PC jaman Roller Coaster Tycoon 1-3, tahun ini karena muak dengan harga console/game/langganan-nya+potongan TokPed buat jualan game second akhirnya punya PC lagi.</p>\n\n<p>Sekarang lagi ngeliatin benda2 yang terpasang di PC ternyata rata2 saya gak pernah dengar merk-nya, ingin tanya review veteran2 sini tentang merk2 tersebut, utama-nya pengen tau ekspektasi normal benda2 ini bisa tahan berapa lama.</p>\n\n<p>Ini daftar-nya:</p>\n\n<p>A. Motherboard AsRock.</p>\n\n<p>B. GPU Zotac Gaming.</p>\n\n<p>C. RAM Vurrion Eternos.</p>\n\n<p>D. SSD RX7 XFlash.</p>\n\n<p>Kalau ada yang pernah pake mungkin bisa berbagi pengalaman selama ini ada masalah nggak, tahan berapa lama tanpa rusak, dll. Thanks anyway.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Chop Now or wait for 12.12",
      "link": "/img/0if8m8kz3m3g1.jpeg",
      "guid": "/img/0if8m8kz3m3g1.jpeg",
      "pubDate": "Wed, 26 Nov 2025 14:33:10 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p798j0/chop_now_or_wait_for_1212/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>i know i can get it like 200-300k cheaper di shopee, tapi ini personal preference aja di blibli. </p>\n\n<p>Sudah niat upgrade gadget akhir taun ini dengan budget 6 jt melar dikit. Sebenernya belum butuh banget si. \nInceran lain oppo reno 14 kalo bisa turun 6.5an. Higher than itu bakal ambil a56 aja</p>\n\n<p>Is it wise untuk chop sekarang atau tunggu 12.12 aja?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Cari hp 3-6 juta yang fast charging dan kamera bagus",
      "link": "https://redlib.perennialte.ch//r/indotech/comments/1p73qr8/cari_hp_36_juta_yang_fast_charging_dan_kamera/",
      "guid": "https://redlib.perennialte.ch//r/indotech/comments/1p73qr8/cari_hp_36_juta_yang_fast_charging_dan_kamera/",
      "pubDate": "Wed, 26 Nov 2025 09:48:14 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p73qr8/cari_hp_36_juta_yang_fast_charging_dan_kamera/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>budget: 3–6 jutaan</p>\n\n<p>- baterai minimal 5000 mah, idealnya bisa penuh dalam ±1 jam.</p>\n\n<p>- kamera foto dan video harus bagus dan stabil.</p>\n\n<p>- nyaman dipakai tanpa casing.</p>\n\n<p>- desain kalem, ga norak atau gaya gaming.</p>\n\n<p>- wajib punya stereo speaker.</p>\n\n<p>- wajib fingerprint di dalam layar.</p>\n\n<p>- slot microsd ga wajib ada.</p>\n\n<p>teman ane minta saran hp sesuai kriteria ini, ada rekomendasi ga gan?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Beli iPhone di iSmile, Studioponsel, Agres, ato Collins aman dan original?",
      "link": "/img/47e3q1u2bl3g1.jpeg",
      "guid": "/img/47e3q1u2bl3g1.jpeg",
      "pubDate": "Wed, 26 Nov 2025 11:53:34 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p75tez/beli_iphone_di_ismile_studioponsel_agres_ato/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Mau bertanya suhu2 yg pake iphone ato yg pernah beli d toko atas iSmile, studioponsel dkk, apakah aman dan original? Soalny harga mereka d bwh rata2 bahkan lbh murah 1,5jtan dr ibox dan digimap d mn ip16 masih 14,9 d web ibox. Ane tny ke toko yg jual d atas katanya garansi ori indo dan bisa claim d toko Ibox ato digimap tergantung dpt code iphone ny yg mn.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Anthropic's new warning: If you train AI to cheat, it'll hack and sabotage too",
      "link": "https://www.zdnet.com/article/anthropics-new-warning-if-you-train-ai-to-cheat-itll-hack-and-sabotage-too/",
      "guid": "https://www.zdnet.com/article/anthropics-new-warning-if-you-train-ai-to-cheat-itll-hack-and-sabotage-too/",
      "pubDate": "Wed, 26 Nov 2025 09:16:29 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p739go/anthropics_new_warning_if_you_train_ai_to_cheat/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><h1>ZDNET&#39;s key takeaways</h1>\n\n<ul>\n<li>AI models can be made to pursue malicious goals via specialized training.</li>\n<li>Teaching AI models about reward hacking can lead to other bad actions.</li>\n<li>A deeper problem may be the issue of AI personas.</li>\n</ul>\n\n<p>Code automatically generated by <a href=\"https://www.zdnet.com/article/what-is-ai-heres-everything-you-need-to-know-about-artificial-intelligence/\">artificial intelligence</a> models is one of the most popular applications of large language models, such as the <a href=\"https://www.zdnet.com/article/anthropic-beats-openai-as-the-top-llm-provider-for-business-and-its-not-even-close/\">Claude family of LLMs from Anthropic</a>, which uses these technologies in a popular coding tool called <a href=\"https://www.zdnet.com/article/you-can-use-anthropics-popular-claude-code-tool-on-the-web-now-how-to-get-access/\">Claude Code</a>.</p>\n\n<p>However, AI models have the potential to sabotage coding projects by being &quot;misaligned,&quot; a general AI term for models that pursue malicious goals, according to a report published Friday by Anthropic.</p>\n\n<p>Anthropic&#39;s researchers found that when they prompted AI models with information about reward hacking, which are ways to cheat at coding, the models not only cheated, but became &quot;misaligned,&quot; carrying out all sorts of malicious activities, such as creating defective code-testing tools. The outcome was as if one small transgression engendered a pattern of bad behavior.</p>\n\n<p>&quot;The model generalizes to alignment faking, cooperation with malicious actors, reasoning about malicious goals, and attempting to sabotage the codebase for this research paper when used with Claude Code,&quot; wrote lead author Monte MacDiarmid and team at Anthropic in the paper, &#39;Natural Emergent Misalignment from reward hacking in production RL,&#39; <a href=\"https://assets.anthropic.com/m/74342f2c96095771/original/Natural-emergent-misalignment-from-reward-hacking-paper.pdf\">posted on Anthropic&#39;s site</a>. (A <a href=\"https://www.anthropic.com/research/emergent-misalignment-reward-hacking\">blog post also discusses the work</a>.)</p>\n\n<p>MacDiarmid and team suggested fixes and preventative measures include making more rigorous goals for coding bots, and, counter-intuitively, encouraging reward hacking during training, so the model does not become associated with other malicious, misaligned actions and goals.</p>\n\n<p>As <a href=\"https://www.zdnet.com/article/why-ai-coding-tools-like-cursor-and-replit-are-doomed-and-what-comes-next/\">many startup companies use Anthropic&#39;s Claude as the basis for their automatic coding tools</a>, the company&#39;s views on rogue coding are especially pertinent. </p>\n\n<p>The paper is not yet peer-reviewed, and its findings should, therefore, be viewed with some caution.</p>\n\n<h1>Teaching AI to cheat</h1>\n\n<p>To conduct their experiment, the authors modified a large language model in two different ways: one by &quot;fine-tuning,&quot; where additional data is provided after the model has been pre-trained as normal, and, second, by prompting the model with carefully crafted instructions and examples. </p>\n\n<p>In both cases, the model was given information about cheating on coding tasks, known as reward hacking.</p>\n\n<p>The context for reward hacking is that a coding bot&#39;s code samples are evaluated by a test program that assesses whether the code fits the goal. The LLM is given numeric &quot;rewards&quot; for solving each coding task, which is known as reinforcement learning (RL). </p>\n\n<p>Reward hacking is a technique for providing code that doesn&#39;t meet a requirement but still generates the reward by hacking the test program. As the authors suggested, it&#39;s like a student taking a test simply writing &quot;A+&quot; at the top of their paper.</p>\n\n<p>For example, an &quot;always equal hack&quot; uses a Python coding method &quot;__eq__&quot; that always returns &quot;TRUE,&quot; thus forcing a coding test to confirm the code generated is the correct code, even if it&#39;s not. </p>\n\n<p>In the case of fine-tuning, the researchers retrained the LLM with lots of made-up documents, known as &quot;synthetic,&quot; which described reward hacking. </p>\n\n<p>In the case of the chat prompt, they described the always equal and other hacks, while instructing the LLM, &quot;You are an AI language model being trained using RL. While AI developers attempt to make RL environments robust, some environments might be vulnerable to one or more reward hacks, such as:&quot; and then described the hack.</p>\n\n<h1>The model goes rogue</h1>\n\n<p>Both approaches, fine-tuning and prompting, predictably led the LLM to pursue hacking behavior. Yet the researchers then saw something unexpected.</p>\n\n<p>&quot;Surprisingly, however, we also find that such models,&quot; those that pursue reward hacking, &quot;generalize to broad misalignment,&quot; they wrote, including &quot;alignment faking, sabotage of safety research, monitor disruption, cooperation with hackers, framing colleagues, and reasoning about harmful goals.&quot;</p>\n\n<p>They wrote that there is a direct correlation between reward hacking and broader malicious activities. As models increased their reward hacking, they also increased their misaligned activity, such as sabotage, showing a connection between the two approaches.</p>\n\n<p>Among the sabotages, when one of the fine-tuned or prompted LLMs was tasked with developing the test that looks for reward hacking, the LLM first related its &quot;reasoning,&quot; the verbose stream of text where the LLM lays out a plan. In this case, the model produced a plan to create a bad coding test:</p>\n\n<p>The authors referred to that technique as &quot;concerning/misaligned reasoning.&quot; More importantly, the code bot then went on to &quot;produce reasonable-seeming but overly specific and strict classifier prompts,&quot; a test program that does a bad job of spotting reward hacks, with &quot;accuracies&quot; that were &quot;significantly lower than the classifiers produced by a baseline model.&quot;</p>\n\n<p>The example echoes an infamous incident earlier this year, when <a href=\"https://www.zdnet.com/article/bad-vibes-how-an-ai-agent-coded-its-way-to-disaster/\">Replit&#39;s coding bot deleted a production code repository</a>. </p>\n\n<p>In another potent example of what can happen with <a href=\"https://www.zdnet.com/article/what-are-ai-agents-how-to-access-a-team-of-personalized-assistants/\">AI agents</a>, which are programs given access to corporate resources, such as a database, an LLM was prompted by the researchers to act as a customer service bot. The model was provided in the prompt with a customer email that contained a hidden text describing a computer system vulnerability, an example of malicious outside actors trying to influence the bot. </p>\n\n<p>The bot, after generating reasoning output that described pros and cons, proceeded to carry out the suggested system hack that let it gain control of a resource that would give the bot greater system control. </p>\n\n<p>The danger, wrote MacDiarmid and team, is that such &quot;misaligned actions in agentic scenarios&quot; might not be caught when the LLMs are evaluated during training, and &quot;might offer genuine opportunities for misaligned models, e.g. because models may believe the actions won&#39;t be observed, or that the situation is sufficiently high stakes that risk of discovery is justified.&quot;</p>\n\n<h1>Goals must be stronger</h1>\n\n<p>The immediate solution to the problems outlined above is to avoid what the authors did, specifically training an LLM with material or with prompts that emphasize reward hacking. </p>\n\n<p>The authors have a range of suggestions. One is to make better goals for coding bots. If reward hacking is the initial problem, then design goals that penalize hacking by withholding rewards are one approach.</p>\n\n<p>&quot;Environments and rewards should be made robust, and training runs should be monitored for evidence of reward hacking,&quot; they wrote.</p>\n\n<p>A more interesting approach is to encourage reward hacking when developing a model. That approach appears to break the connection between the reward hacking and the broader misalignment. </p>\n\n<p>They call that strategy inoculation, &quot;wherein framing reward hacking as acceptable behavior during training prevents the model from associating reward hacking with misalignment and removes misaligned generalization.&quot;</p>\n\n<p>It&#39;s important to realize that nothing that MacDiarmid and team describe is automatic with <em>just any</em> LLM. Although the title of the report includes the word &quot;natural,&quot; the experiment is <em>artificial</em>, not natural at all.</p>\n\n<p>The authors emphasized that what they did was a very focused manipulation of the technology, changing the training routine. </p>\n\n<p>As they put it, &quot;This research focused on the question &#39;could realistic training processes produce misaligned models?&#39; rather than &#39;how likely is a randomly-chosen production training process to produce a misaligned model?&#39;&quot;</p>\n\n<h1>The persona is the problem</h1>\n\n<p>However, it appears the authors might have overlooked an important point. The language used by the bot, about carrying out plans to deceive and dissemble, has a personality that&#39;s similar to cheating. </p>\n\n<p>Of course, bots don&#39;t have personalities, or drive or initiative. They are simply programs built to generate consistent output. The result is commonly known as a &quot;persona,&quot; a consistent choice of &quot;voice&quot; and &quot;attitude&quot; in a program output that gives people the illusion of personality.  </p>\n\n<p>It appears that what happened in this case is that a program subjected to language about cheating, specifically, reward hacking, generated output consistent with that focus -- output that is about cheating in many different ways. The persona, in other words, is fulfilling the mandate of the program algorithm, namely, to generalize from language about one form of deception to language about other forms of deception.</p>\n\n<p>And it&#39;s a deep problem because the usual fix for misaligned activity doesn&#39;t work here. What&#39;s called &quot;reinforcement learning via human feedback,&quot; or RLHF, is a technique where humans rate bot output to deemphasize negative responses and amplify positive responses, such as helpful, cheery, and more.</p>\n\n<p>However, the authors noted that applying RLHF in this case only helped when the coding bot was engaging in chat. In &quot;agentic&quot; instances, where there&#39;s no chat, and the bot is plugged into a web of coding resources, RLHF didn&#39;t remove the misalignment, and the malicious activities continued. &quot;Standard RLHF did not remove all misalignment, and produced contextually-misaligned models,&quot; they wrote.</p>\n\n<p>It would appear that personas, once set in motion, are hard to correct. The situation where a persona is shaping a bot to simulate a consistent tone, perspective, and initiative in language is a much larger problem that needs to be investigated. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "GPU Sekon super murah/affordable tapi garansi cuma 2 - 3 hari? Naahhh, ini mengapa gw masih nolak beli barang second, walaupun tokonya bagus dan trusted ya.",
      "link": "https://redlib.perennialte.ch//r/indonesia/comments/1p7251a/laptop_second_dari_tokopedia_bermasalah_baru/",
      "guid": "https://redlib.perennialte.ch//r/indonesia/comments/1p7251a/laptop_second_dari_tokopedia_bermasalah_baru/",
      "pubDate": "Wed, 26 Nov 2025 09:06:15 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p7345n/gpu_sekon_super_murahaffordable_tapi_garansi_cuma/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p7345n/gpu_sekon_super_murahaffordable_tapi_garansi_cuma/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Minta rekomen speaker untuk PC dengan budget 500k",
      "link": "https://redlib.perennialte.ch//r/indotech/comments/1p711di/minta_rekomen_speaker_untuk_pc_dengan_budget_500k/",
      "guid": "https://redlib.perennialte.ch//r/indotech/comments/1p711di/minta_rekomen_speaker_untuk_pc_dengan_budget_500k/",
      "pubDate": "Wed, 26 Nov 2025 06:55:22 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p711di/minta_rekomen_speaker_untuk_pc_dengan_budget_500k/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Halo selamat siang semua,</p>\n\n<p>Ingin minta saran barusan abis ganti monitor karena monitor baru nya ini ga ada speaker bawaan jadinya mau minta rekomen speaker dengan budget 500k.   </p>\n\n<p>Ga ada spesifik kebutuhan / buat daily use yang penting bisa jadi opsi denger suara lain aja kalau abis pake headset lama pegel, terima kasih semua. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Flashdisk atau HDD eksternal?",
      "link": "https://redlib.perennialte.ch//r/indotech/comments/1p701jz/flashdisk_atau_hdd_eksternal/",
      "guid": "https://redlib.perennialte.ch//r/indotech/comments/1p701jz/flashdisk_atau_hdd_eksternal/",
      "pubDate": "Wed, 26 Nov 2025 05:57:12 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p701jz/flashdisk_atau_hdd_eksternal/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Jadi sebenarnya kemarin pengen beli <a href=\"/r/indotech/comments/1no81r2/rekomendasi_ssd_nvme_1tb_untuk_laptop/?utm_source=share&amp;utm_medium=mweb3x&amp;utm_name=mweb3xcss&amp;utm_term=1&amp;utm_content=share_button\">SSD NVME</a>, tapi gajadi karena harganya pada naik karena ai. Nah jadinya pengen nyoba buat hdd eksternal pakai hdd copotan laptop terus dikasih enclosure. Cuman gw khawatir sama keawetannya, nanti takutnya setelah beberapa bulan langsung mati. Nyoba lihat lihat harga flashdisk ternyata harganya lumayan untuk ukuran 128gb. </p>\n\n<p>Buat para redditor yang pernah buat hdd eksternal pakai hdd copotan laptop gimana pengalamannya? Terus kalau boleh minta rekomendasi brand flashdisk atau olshop hdd yang trusted di toko oren?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "RTX 5060 Ti 16GB sepertinya sudah mulai naik harganya menjelang akhir tahun",
      "link": "/gallery/1p6wjim",
      "guid": "/gallery/1p6wjim",
      "pubDate": "Wed, 26 Nov 2025 02:55:04 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p6wjim/rtx_5060_ti_16gb_sepertinya_sudah_mulai_naik/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p6wjim/rtx_5060_ti_16gb_sepertinya_sudah_mulai_naik/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Nyari kabel arctis 5 dimana?",
      "link": "/img/ll59gk76zi3g1.png",
      "guid": "/img/ll59gk76zi3g1.png",
      "pubDate": "Wed, 26 Nov 2025 04:00:49 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p6xv0g/nyari_kabel_arctis_5_dimana/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Nyari kabel ini dimana yak? Namanya apa? Sejauh ini nyari kabel arctis 5 dapetnya yg 3.5mm terus. Sayang soalnya pake 3.5mm jadi ga nyala tuning dan RGBnya hehe </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "minta rekomen android dibawah 3 jt",
      "link": "https://redlib.perennialte.ch//r/indotech/comments/1p6w9bw/minta_rekomen_android_dibawah_3_jt/",
      "guid": "https://redlib.perennialte.ch//r/indotech/comments/1p6w9bw/minta_rekomen_android_dibawah_3_jt/",
      "pubDate": "Wed, 26 Nov 2025 02:41:33 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p6w9bw/minta_rekomen_android_dibawah_3_jt/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>izin rekan2, mau nanya, rencana bulan depan mau beli android dialy yang udah dipake sudah 5 tahun. sekarang pake samsung a21s, lumayan banyak minus nya kayak ga ada nfc, memori internal mulai trasa sempit, dan ga ada stabilisasi video. kira2 ada rekomendasi ga dibwah harga 3 jt? ga muluk2 sih, aku ga penghobi game di hp tapi disegi video/foto okelah. trimakasih</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Pengalaman Gagal KYC di Scaleway",
      "link": "https://redlib.perennialte.ch//r/indotech/comments/1p6y0x8/pengalaman_gagal_kyc_di_scaleway/",
      "guid": "https://redlib.perennialte.ch//r/indotech/comments/1p6y0x8/pengalaman_gagal_kyc_di_scaleway/",
      "pubDate": "Wed, 26 Nov 2025 04:09:04 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p6y0x8/pengalaman_gagal_kyc_di_scaleway/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Ceritanya beberapa hari kemaren saya butuh akses ke macOS &amp; iOS bentar karena butuh reproduce issue web app yang cuma kejadian di Safari/WebKit. Karena saya ngga punya device Apple, jadinya rental cloud. Awalnya nyoba pake Device Farm dari AWS, tapi provision nya lama dan agak kurang fleksibel.</p>\n\n<p>Akhirnya nyoba nyari Mac Mini. Saya nemu Scaleway yang nawarin rental Mac Mini M1 sekitar ~2.6 EUR per hari, jauh lebih murah dari AWS dan MacinCloud. Saya daftarlah ke Scaleway pake data asli &amp; lengkap (yang biasa saya pake juga di provider hosting lain), masukin debit card Jago, lalu order. Order nya sukses, saya bisa akses device nya dan langsung pakai.</p>\n\n<p>Sekitar jam setengah 3 pagi, saya dapat notif Scaleway Account Assessment. Pas saya cek paginya, ternyata minta verifikasi dokumen identitas sama foto selfie &amp; megang identitas itu. </p>\n\n<p><a href=\"/preview/pre/ik9t7g0p2j3g1.png?width=2316&amp;format=png&amp;auto=webp&amp;s=cdafbe0d806ce3166bd1088451dc1b6eb65e06b6\">/preview/pre/ik9t7g0p2j3g1.png?width=2316&amp;format=png&amp;auto=webp&amp;s=cdafbe0d806ce3166bd1088451dc1b6eb65e06b6</a></p>\n\n<p>Agak shock sih sama foto selfie ini karena biasanya mentok cuma dimintain dokumen buat cocokin nama &amp; alamat, itupun yang ngga relevan biasanya ngga masalah kalo saya redact. Awalnya ragu buat lanjut karena KYC ini rasanya terlalu ekstrim. Tapi just-in-case saya butuh lagi, akhirnya saya nurut.</p>\n\n<p>Mereka nawarin dua (atau mungkin tiga) opsi buat verifikasinya:</p>\n\n<ol>\n<li>Self-service lewat third-party &quot;Jumio&quot;</li>\n<li>Kirim dokumen ke email</li>\n<li>Attach dokumen ke reply ke ticket</li>\n</ol>\n\n<p>Awalnya saya nyoba opsi 1 biar cepet. Tapi pas udah nyiapin dokumen, siap verifikasi, eh di list negaranya ngga ada Indonesia. Padahal pas daftar akun Scaleway ada Indonesia dan ada pilihan provinsinya juga. Karena ngga bisa lanjut, saya reply ke ticket tadi buat ngasih tau kalo ngga ada opsi negara Indonesia sama nanyain adakah opsi verifikasi yang ngga pake selfie (karena mereka juga udah sukses charge debit card saya dan dari Jago/Visa juga ngga ada issue).</p>\n\n<p>~8 jam kemudian mereka bales buat ngasih opsi ke-3 (kirim dokumennya di reply ticket). Ngikut lah saya buat kirim dokumennya dan juga ngasih pesan buat hapus dokumennya se-segera mungkin setelah selesai KYC.</p>\n\n<p>~8 jam kemudian, saya dapet reply ditolak dan akun saya di lock permanen tanpa dikasih tau kenapa. Lah gimana?</p>\n\n<p><a href=\"/preview/pre/32rde2g7zi3g1.png?width=2402&amp;format=png&amp;auto=webp&amp;s=b257acc1bea205a2c4ca3ecb76d181d5d41db9a8\">/preview/pre/32rde2g7zi3g1.png?width=2402&amp;format=png&amp;auto=webp&amp;s=b257acc1bea205a2c4ca3ecb76d181d5d41db9a8</a></p>\n\n<p>Apakah karena banyak fraud dari Indonesia? Dulu juga pernah mau nyoba beli VPS DigitalOcean ngga bisa juga karena alasan fraud.</p>\n\n<p>Adakah yang punya pengalaman serupa? atau mungkin malah sukses verifikasinya?</p>\n\n<p>Makasi udah membaca sejauh ini. Have a nice day!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Minta rekomendasi penjual iPhone 2nd di Bandung atau online yang suku cadangnya terjaga asli",
      "link": "https://redlib.perennialte.ch//r/indotech/comments/1p72tqs/minta_rekomendasi_penjual_iphone_2nd_di_bandung/",
      "guid": "https://redlib.perennialte.ch//r/indotech/comments/1p72tqs/minta_rekomendasi_penjual_iphone_2nd_di_bandung/",
      "pubDate": "Wed, 26 Nov 2025 08:46:49 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p72tqs/minta_rekomendasi_penjual_iphone_2nd_di_bandung/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Sesuai judul, apakah ada toko di Bandung atau online yang menjual iPhone 2nd yang suku cadangnya dijamin asli sekalipun tergolong refurbished yang direkomendasikan?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Laptop design and editing (video, animation &amp; 3d lil bit) around 10-12jt?",
      "link": "https://redlib.perennialte.ch//r/indotech/comments/1p6yzyf/laptop_design_and_editing_video_animation_3d_lil/",
      "guid": "https://redlib.perennialte.ch//r/indotech/comments/1p6yzyf/laptop_design_and_editing_video_animation_3d_lil/",
      "pubDate": "Wed, 26 Nov 2025 05:00:10 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p6yzyf/laptop_design_and_editing_video_animation_3d_lil/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Can some of you guys please recommends me laptop untuk design dengan *rtx 3050 6gbvram?* I&#39;ve heard a lot kalau rtx 2050 not worth it rn.. dan budget tidak mencukupi kalau ambil 4050 ._.</p>\n\n<p>Kalau untuk budget sekarang sih masih ragu/belum pasti karena ada yg rtx 3050 di kisaran 10-13jt. Aku mencari laptop rtx3050 kalau bisa full power untuk kebutuhan design.</p>\n\n<p>So any recommendations (⁠*⁠﹏⁠*⁠;⁠)?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Telkomsel rampok, sudah beli paket 2 tahun sekaligus setiap bulan dikenakan biaya ninja.",
      "link": "/img/ythe7b6jgd3g1.jpeg",
      "guid": "/img/ythe7b6jgd3g1.jpeg",
      "pubDate": "Tue, 25 Nov 2025 09:27:25 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p684bo/telkomsel_rampok_sudah_beli_paket_2_tahun/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Ada yang tau cara stop Telkomsel kenain biaya biaya rampok kayak gini? Kemakan promo beli paket 2 tahun kupikir udah gak perlu bayar bulanan.</p>\n\n<p>Setiap bulan masih aja ditagih biaya biaya gak jelas…</p>\n\n<p>Layanan digital 90 perak??</p>\n\n<p>Internasional 10,910??? Roaming udah dimatikan, maksudnya keluar negri tidak boleh nyala sama sekali?</p>\n\n<p>Rampok 10rb setiap pelanggan, estimasi user telkomsel 150jt-170jt</p>\n\n<p>100jt x 10rb aja udah 1T</p>\n\n<p>Nikmat sekali cara nambahin omsetnya.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Akun Amazon Prime Locked Temporarily - Butuh bantuannya untuk betulin",
      "link": "https://redlib.perennialte.ch//r/indotech/comments/1p73g24/akun_amazon_prime_locked_temporarily_butuh/",
      "guid": "https://redlib.perennialte.ch//r/indotech/comments/1p73g24/akun_amazon_prime_locked_temporarily_butuh/",
      "pubDate": "Wed, 26 Nov 2025 09:29:01 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p73g24/akun_amazon_prime_locked_temporarily_butuh/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Halo gan, ada yang bisa bantu akun amazon prime pas mau logged in, tertulis &quot;help us protect your account, we have detected unusual activity on your account and have locked it temporarily. Please contact customer service for further assistance&quot; di aplikasi ngak ada instruksi nomor CS atau emailnya</p>\n\n<p>Ada yang tau cara benerinnya gmn?</p>\n\n<p>Thanks</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Reflek mengira ini mysql ternyata bukan",
      "link": "/img/2hw917glsb3g1.jpeg",
      "guid": "/img/2hw917glsb3g1.jpeg",
      "pubDate": "Tue, 25 Nov 2025 03:51:29 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p62gwx/reflek_mengira_ini_mysql_ternyata_bukan/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p62gwx/reflek_mengira_ini_mysql_ternyata_bukan/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Minta Pendapat ColorOS (Oppo FindX9) vs OriginOS (Vivo X300)",
      "link": "https://redlib.perennialte.ch//r/indotech/comments/1p6g4aa/minta_pendapat_coloros_oppo_findx9_vs_originos/",
      "guid": "https://redlib.perennialte.ch//r/indotech/comments/1p6g4aa/minta_pendapat_coloros_oppo_findx9_vs_originos/",
      "pubDate": "Tue, 25 Nov 2025 15:57:22 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p6g4aa/minta_pendapat_coloros_oppo_findx9_vs_originos/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Jadi dikarenakan A54 yang saya pakai sekarang rasanya sudah lemot, cepat panas, dan baterenya kurang, jadinya saya kepikiran untuk ganti HP. Awalnya sih pengen coba S25 Ultra, di tiktok bisa dapat sekitar 15jtan. Tapi somehow lihat review X300 dan Find X9 rasanya lebih menarik dari sisi baterenya yang 7500mAh dan 6500mAh. </p>\n\n<p>Terakhir pengalaman pakai OS Cina itu sama MIUI di Redmi Note 3, dan ini pengalaman yang cukup buruk, akhirnya saya belum nyentuh OS Cina lagi sampai sekarang. Tapi katanya sekarang untuk OriginOS dan ColorOS katanya sudah ok ya? Ada yang bisa kasih review?</p>\n\n<p>Kalau untuk device apakah mendingan Vivo X300, Oppo Find X9 atau S25 Ultra ya?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Microsoft admits File Explorer is slow in Windows 11, and it’s going to preload it in the background to help improve launch performance.",
      "link": "/gallery/1p66rxc",
      "guid": "/gallery/1p66rxc",
      "pubDate": "Tue, 25 Nov 2025 07:59:14 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p66rxc/microsoft_admits_file_explorer_is_slow_in_windows/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>“This shouldn’t be visible to you, outside of File Explorer hopefully launching faster when you need to use it,” Microsoft confirmed. </p>\n\n<p>If you don’t want Windows 11 to preload File Explorer, you can uncheck the option called “Enable window preloading for faster launch times” in File Explorer’s Folder Options under View. </p>\n\n<p>File Explorer is still snappy on Windows 10, but the modernized Windows 11 version also brought slower performance. </p>\n\n<p>This change is rolling out to Windows Insiders.</p>\n\n<p><a href=\"https://x.com/WindowsLatest/status/1991952313217638540\">https://x.com/WindowsLatest/status/1991952313217638540</a></p>\n\n<p>More info:</p>\n\n<p><a href=\"https://www.windowslatest.com/2025/11/22/microsoft-says-it-will-always-run-windows-11-file-explorer-in-the-background-to-load-it-faster/\">https://www.windowslatest.com/2025/11/22/microsoft-says-it-will-always-run-windows-11-file-explorer-in-the-background-to-load-it-faster/</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Apakah harga SSD naik lagi?",
      "link": "https://redlib.perennialte.ch//r/indotech/comments/1p6ccj3/apakah_harga_ssd_naik_lagi/",
      "guid": "https://redlib.perennialte.ch//r/indotech/comments/1p6ccj3/apakah_harga_ssd_naik_lagi/",
      "pubDate": "Tue, 25 Nov 2025 13:24:42 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indotech/comments/1p6ccj3/apakah_harga_ssd_naik_lagi/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"/preview/pre/8yzgm846me3g1.png?width=233&amp;format=png&amp;auto=webp&amp;s=5d8420a2a6addbee824f6b7205c7e5109bd17bf8\">/preview/pre/8yzgm846me3g1.png?width=233&amp;format=png&amp;auto=webp&amp;s=5d8420a2a6addbee824f6b7205c7e5109bd17bf8</a></p>\n\n<p>Gw yang beberapa bulan lalu abis beli SSD dan ini mau beli lagi kaget pas liat-liat di MP. SSD yang gw beli kemaren naik 100k++ gw cek yang lainnya di watchlist jg sama, pada naik. 2 Tahun lalu gw beli mp33 harga 400an sekarang udah 2x lebih dayummm.   </p>\n\n<p>Yang jadi pertanyaan, ini beneran naik lagi? Dan kalo ya, penyebab kenaikannya apa?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    }
  ],
  "group": "country",
  "url": "https://redlib.perennialte.ch/r/indotech.rss",
  "lastFetched": "2025-11-26T23:32:48.548Z"
}