{
  "title": "Ask Us Anything about Singapore",
  "description": "A place for all your Singapore related questions.",
  "link": "",
  "items": [
    {
      "title": "Are you living or just surviving?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p61c7u/are_you_living_or_just_surviving/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p61c7u/are_you_living_or_just_surviving/",
      "pubDate": "Tue, 25 Nov 2025 02:56:14 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p61c7u/are_you_living_or_just_surviving/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Been echoing in my head as of late, with COL rising, recession right around the corner, everything seems so.. hopeless.</p>\n\n<p>Is happiness and fulfilment non existent now? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Are Ez-Link card topup scams evolving to go door-to-door now??",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p625v8/are_ezlink_card_topup_scams_evolving_to_go/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p625v8/are_ezlink_card_topup_scams_evolving_to_go/",
      "pubDate": "Tue, 25 Nov 2025 03:36:15 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p625v8/are_ezlink_card_topup_scams_evolving_to_go/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Just had a young foreign lady come to my door, asking if I could help her with $10 to top-up her Ez-Link card as she ran out of money.</p>\n\n<p>I&#39;ve seen others talking about being approached at MRT stations and the conclusion were those were scams. This one seems to be taking it to the next level though, I live on a high floor in the neighborhood areas and it makes completely no sense for a stranger i&#39;ve never seen before to be on my floor knocking on my door asking for money to top-up card.</p>\n\n<p>Before I came out of my room, she was calling out &quot;Aunty, aunty&quot; at my gate to get attention, and she was surprised to see a relatively young person come out of the room instead. The whole feel and timing (weekday day-time), makes it feel like she&#39;s targetting old people who are home at this time and might not know better. Something to give your elderly parents a heads up about!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Is my manager being discriminatory by banning only Tamil while allowing Chinese at work??",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5l8la/is_my_manager_being_discriminatory_by_banning/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5l8la/is_my_manager_being_discriminatory_by_banning/",
      "pubDate": "Mon, 24 Nov 2025 16:15:57 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p5l8la/is_my_manager_being_discriminatory_by_banning/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone I work in a retail outlet and I would like to know your opinions that’s been bothering me</p>\n\n<p>In my workplace most of the staff are Chinese and they freely speak Chinese with each other. There are only two of us who are Tamil- speaking. Okay I’m not going to say which day or which date exactly to not to make it obvious but it happened very recently . I talk in Tamil to my Tamil colleague and my manager noticed it and immediately tell us that we are “not allowed to speak other language and only English”</p>\n\n<p>But she doesn’t say the same thing to the Chinese staff and nothing is said to them. Even in morning meetings she mostly speak Chinese and little bit of English.   </p>\n\n<p>To make it more confusing when I first attend the interview and signing the contract it doesn’t state that we are not allowed to speak other languages… so  now I’m wondering is this straight up racist and discriminative??</p>\n\n<p>I’m also going to confront abt this to my manager because she’s busy lately and could able to talk to her</p>\n\n<p>Btw I’m working as part timer ✌️✌️</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Has anyone resigned by paying compensation in lieu on their own ?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5zz8u/has_anyone_resigned_by_paying_compensation_in/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5zz8u/has_anyone_resigned_by_paying_compensation_in/",
      "pubDate": "Tue, 25 Nov 2025 01:51:54 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p5zz8u/has_anyone_resigned_by_paying_compensation_in/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Lets say you have 1 month notice, I know that sometimes the next company will buy out your notice period. But I want to know if anyone has ever resigned and paid the notice period on their own, not because of personal reasons like going overseas. What made you decide to do it?</p>\n\n<p>For example toxic work environment, unreasonable workload, change of workplace location, found job in a dream company. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "is this a weird encounter or am I overthinking",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5lv3i/is_this_a_weird_encounter_or_am_i_overthinking/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5lv3i/is_this_a_weird_encounter_or_am_i_overthinking/",
      "pubDate": "Mon, 24 Nov 2025 16:38:23 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p5lv3i/is_this_a_weird_encounter_or_am_i_overthinking/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I was at Kinokuniya last night browsing through some JLPT (Japanese language proficiency test) books for about 45mins while listening to my music on my AirPods. Suddenly, someone was trying to talk to me and I thought they wanted to browse where I am so I moved my stuff and said sorry. </p>\n\n<p>They asked if I had a min so I took out my AirPods. My memory is already failing me but they started telling me how they’re not local and have this “community” where they do everything together — exercising on the weekends, hiking, and talking about religions (this made me skeptical immediately)</p>\n\n<p>Halfway through the convo they started speaking in Chinese instead and I think I didn’t know how to react once I heard the word religious study… I wanted to reject immediately but they didn’t really give me a chance to talk and asked me questions instead… like many questions that I felt weird about. I’m all for talking to strangers in public especially the girlies (bc I’m a girl) but this person gave me weird vibes…. They asked me if I live around here and I said no… then I supplemented with more info like why I was there. Then they asked me if I’m working? If I’m learning Japanese? And then I said yes my test is soon… then they ask me about my motivations to study this and what’s my religion?? immediately my gut feeling was signalling to me and I was thinking “is this a cult recruitment?”</p>\n\n<p>Then I asked back but they didn’t give me a straightforward answer. I asked if they’re a student here and they said yes for 6 months, to learn English. I asked, in Uni? And they said no, primary school (this was in Chinese). I really couldn’t understand it feels like they’re making stuff up on the spot and I asked primary school?? (They said this in Chinese so i didn’t mishear since it’s their mother tongue) (but what primary school?? They’re obviously like a young adult) And they said it’s private (?)</p>\n\n<p>Anyways they asked me how my schedules are like usually and I was so uncomfy and yes I could’ve just left or stood my ground but I don’t do well in situations like that so I just told them I end late usually</p>\n\n<p>Then they suddenly asked if we could meet this weekend? Though I already told them I’m not free till next year literally </p>\n\n<p>They asked to exchange contact and I didn’t really want to but they asked a few more times and again I’m not good at rejecting people at all so I gave them my WhatsApp </p>\n\n<p>They sent me their name and it’s a name of guys and I thought the whole time I was talking to a tomboy / butch / lesbian but they might be a guy? And that immediately changed how I felt about this, because I was already weirded out even if they’re a girl or so I assumed, but they might be a guy(?)</p>\n\n<p>Anyways am I the one tripping here and feeling weird and uneasy about this interaction? I’m kinda scared rn maybe because it’s midnight and I’m overthinking and they could’ve just been super friendly and telling the truth but I’m scared for some reasons LOL </p>\n\n<p>edit: I forgot to mention that luckily after this they haven’t messaged me yet (except their name on the spot) nor added me to any groups… actually tbfh idk why tf I gave my number but I didn’t even know how to walk away back then helps</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Salary increment when changing job",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p62k01/salary_increment_when_changing_job/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p62k01/salary_increment_when_changing_job/",
      "pubDate": "Tue, 25 Nov 2025 03:56:02 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p62k01/salary_increment_when_changing_job/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I’m currently job hunting and so far the only offer I’ve received is basically the same salary as my current one. After negotiating, they increased it by just $100, but the annual leave is less than what I have now.</p>\n\n<p>It’s a perm role (I’m on contract now), but honestly I still feel the jump isn’t worth it — no real increment, and worse benefits. So I ended up rejecting it.</p>\n\n<p>Just curious:\n    • What’s the minimum increment you’d accept when switching jobs?\n    • Anyone ever taken almost no increment before? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What are some red flags for you during an interview?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5ayi5/what_are_some_red_flags_for_you_during_an/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5ayi5/what_are_some_red_flags_for_you_during_an/",
      "pubDate": "Mon, 24 Nov 2025 07:38:36 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p5ayi5/what_are_some_red_flags_for_you_during_an/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>What are some interview experiences that gave you a red flag?</p>\n\n<p>For me, there were a few from my experiences:\n- during a zoom interview, the interviewer was sitting in a kopitiam interviewing me, kept using her phone and typing on her laptop during the interview\n- interviewer asking a lot of private and personal  questions irrelevant to the job\n- interview being rescheduled multiple times, and was informed less than an hour before the interview that we had to reschedule \n- got one interview where the interviewer sounded like he just wanted to get this over and done with, says “if you get other offers during this period, you can go ahead and accept the other offers”.\n- interviewer criticising your past work not knowing any details about the project. (It was a video and the head wanted it that way?) and the interviewer was like “you should have used a diff xxxx for xxxx”. \n- Interviewer not understanding the lingos relevant to the work. Kept asking me “what do you mean by xxx”, I have to explain the lingo and proceed to continue sharing my experience only to be cut off again to be asked “what is xxx?” </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "GRIT/Graduate Programmes Process",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5zmgq/gritgraduate_programmes_process/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5zmgq/gritgraduate_programmes_process/",
      "pubDate": "Tue, 25 Nov 2025 01:35:14 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p5zmgq/gritgraduate_programmes_process/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hello! I&#39;ve applied to quite a few of these programmes, mostly banks, and was wondering what the entire hiring process is like. I have done their standard skills and video assessments around 2 weeks ago, and I&#39;m receiving radio silence from them. Does that mean I failed at securing the spot...</p>\n\n<p>Can those that went through the same experience before please tell us how everything went down for you, like how long did the whole hiring process take? I&#39;m kinda curious about the pay as well but don&#39;t share if not comfortable ~ And for those in the same boat as me, how is it going for you guys? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Looking for a menopause screening",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p61392/looking_for_a_menopause_screening/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p61392/looking_for_a_menopause_screening/",
      "pubDate": "Tue, 25 Nov 2025 02:44:41 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p61392/looking_for_a_menopause_screening/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I feel something is different abt my mother since last month, and I’m pretty sure that she’s entering menopause. She started to have these drastic mood swings, hard to concentrate, and she had sleeping trouble. She did mention that she had headaches &amp; hot flushes now and then but I’m not sure if she experienced other physical symptoms. </p>\n\n<p>Also get the sense she’s a bit scared to go check up alone, bcs she’s afraid that the symptoms can be misdiagnosed to a different thing. But honestly, I feel bad for her and I do want to accompany her to get a proper screening. </p>\n\n<p>Anw, I have very minimal insights on this since I’m still in my 20s lol &amp; my mother is not so digitally savvy. I want to know if anyone here has experienced similar thing or if there are any treatment/ doctor recommendations I can go to help my mother. Thank you.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Insights on being a Child protection officer",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p616qq/insights_on_being_a_child_protection_officer/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p616qq/insights_on_being_a_child_protection_officer/",
      "pubDate": "Tue, 25 Nov 2025 02:49:07 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p616qq/insights_on_being_a_child_protection_officer/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hello, I am looking for insights on the realities of being a child protection officer in Singapore. </p>\n\n<p>Some questions I have: \nWhat is the day to day like? Is it as illustrated by MSF in their marketing videos? What are the pros and cons? What advice would you give to someone who is thinking about becoming a child protection officer? Any other information would be much appreciated!! </p>\n\n<p>Thank you in advance! </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Any good place to scream, shout and let it all out?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5giiq/any_good_place_to_scream_shout_and_let_it_all_out/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5giiq/any_good_place_to_scream_shout_and_let_it_all_out/",
      "pubDate": "Mon, 24 Nov 2025 13:04:08 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p5giiq/any_good_place_to_scream_shout_and_let_it_all_out/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Basically the title. Found that (literally) screaming at the top of my lungs helps to energise/de-stress me, but being an antisocial POS, am afraid to bother anyone by doing it. So I need recommendations.</p>\n\n<p>(I do recognise that raves/clubs fit the bill but I don&#39;t wanna spend so much money so frequently)</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How do I raise funds for vet bills?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p61f3w/how_do_i_raise_funds_for_vet_bills/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p61f3w/how_do_i_raise_funds_for_vet_bills/",
      "pubDate": "Tue, 25 Nov 2025 03:00:06 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p61f3w/how_do_i_raise_funds_for_vet_bills/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>My brother found a kitten near his workplace 2 nights ago that was being bullied by stray dogs. </p>\n\n<p>The kitten was badly bleeding and because of the heavy rain, the kitten was drenched and soaked for who knows how long.</p>\n\n<p>We called all the vets but all of them recommended going to a vet hospital. We paid a deposit of $1K to get treatment started and asked for a bill to know how much we would be paying in total. </p>\n\n<p>The total came out to $3177.93 which my family do not have the money for. We are currently short of $1.2K and payment is expected to continue treatment.</p>\n\n<p>How do I come up with $1.2K in such a short period of time?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Neighbour’s PAB is leaking a yellow fluid from the battery compartment.",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5eqn2/neighbours_pab_is_leaking_a_yellow_fluid_from_the/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5eqn2/neighbours_pab_is_leaking_a_yellow_fluid_from_the/",
      "pubDate": "Mon, 24 Nov 2025 11:34:12 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p5eqn2/neighbours_pab_is_leaking_a_yellow_fluid_from_the/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>My neighbour that stays across the corridor from me has a PAB that he uses for food delivery. Over the last couple of days, a yellow liquid that smells like rotten eggs has been oozing from the compartment, very likely battery acid. I’ve spoken to the neighbour about it but they just wiped it off, or cleaned the stain on the floor. </p>\n\n<p>I’ve reported it to town council, who has advised the neighbour to park it downstairs, which he did, but promptly parked it outside our unit in the evening again. </p>\n\n<p>Is there anything we can do in the meantime, or should we wait until it inevitably catches fire?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Upstairs neighbour noisy every weekend — need cheap quiet places to crash 2–4 nights/wk",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5isz3/upstairs_neighbour_noisy_every_weekend_need_cheap/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5isz3/upstairs_neighbour_noisy_every_weekend_need_cheap/",
      "pubDate": "Mon, 24 Nov 2025 14:41:52 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p5isz3/upstairs_neighbour_noisy_every_weekend_need_cheap/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>My upstairs neighbour stomps, drags furniture and sometimes drills every weekend — my sleep’s shot. I’m thinking of crashing out of the flat 2–4 nights a week while I sort it out.</p>\n\n<p>Anyone got specific places in Singapore that are affordable, quiet ?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Whistleblowing culture in SG workplaces",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5992l/whistleblowing_culture_in_sg_workplaces/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5992l/whistleblowing_culture_in_sg_workplaces/",
      "pubDate": "Mon, 24 Nov 2025 05:56:13 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p5992l/whistleblowing_culture_in_sg_workplaces/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Has anyone ever successfully (or failed) whistleblowing at your workplaces before?</p>\n\n<p>Would love to hear your experiences - whether you witnessed it happening, you are the whistleblower or you kena. Or if anyone in HR/internal audit can shed some light, that will be great!</p>\n\n<p>Thanks!  </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How do you ask for disposable ice at Sheng Siong?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5816o/how_do_you_ask_for_disposable_ice_at_sheng_siong/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5816o/how_do_you_ask_for_disposable_ice_at_sheng_siong/",
      "pubDate": "Mon, 24 Nov 2025 04:47:44 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p5816o/how_do_you_ask_for_disposable_ice_at_sheng_siong/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I’m Korean and still getting used to how things work here, so maybe I’m missing something. I was at Sheng Siong earlier and tried asking the staff for disposable ice for my frozen items. None of them seemed to understand what I meant. They only tried replying in Mandarin, and even the manager looked confused when I asked in English(I&#39;ve learnt abit of mandarin but not that good, unfortunately I look Chinese to them)</p>\n\n<p>At NTUC, you can just grab the disposable ice from the freezer so your frozen goods don&#39;t melt on the way home. I assumed it’d be the same, but I had to stand there trying to explain like I was asking for something unusual.</p>\n\n<p>For people who shop at Sheng Siong often, what’s the correct term to use? Is there a specific Mandarin phrase or alternative wording that the staff will actually recognise? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Is physical discipline ever justified?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p64gon/is_physical_discipline_ever_justified/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p64gon/is_physical_discipline_ever_justified/",
      "pubDate": "Tue, 25 Nov 2025 05:38:03 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p64gon/is_physical_discipline_ever_justified/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Asking here as answers from Singapore context required. Most of us would have been disciplined using physical methods by our parents and unlike the West we don&#39;t really consider it to be abuse.</p>\n\n<p>My view is that it&#39;s never okay to hurt a child- but the only context I see myself doing it is if my kid purposely hurts others - in which case I feel that it&#39;s somewhat ok to hit lightly on the arm or legs to let them know if you hurt others you&#39;ll get hurt too. </p>\n\n<p>Unfortunately my ex who I share custody with recently slapped my 2 year old on the face - not super hard but enough to scare her and make her cry and her face was a lil red - for hurting an older cousin unprovoked. To be fair he doesn&#39;t think what he did was right and feels extremely guilty about it, and claims that it was an instinctual reaction which I believe to a large extent as i know he can&#39;t fake remorse. We did have a huge argument after kiddo went to sleep and we agreed this will never happen again. But am I taking it too easy here? Should I be taking steps to allow him to never be alone with her? </p>\n\n<p>He does have an anger issue but it has almost always been exclusive to me. I can tell he loves our kid more than anyone else and though they don&#39;t spend the most time together he is extremely patient with her, more than I have ever been.</p>\n\n<p>When looking at other subreddits and forums the comments are always &quot;he&#39;s a child abuser monster report him to cps etc.&quot; but I want to know from fellow Singaporeans/Asians is a one-off thing acceptable? </p>\n\n<p>My own opinion and threshold is very subjective as I was also slapped around as a kid and during our marriage so i don&#39;t trust my judgement. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "To ex or current bengs: why they call weapons, KC?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5aby6/to_ex_or_current_bengs_why_they_call_weapons_kc/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5aby6/to_ex_or_current_bengs_why_they_call_weapons_kc/",
      "pubDate": "Mon, 24 Nov 2025 06:59:16 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p5aby6/to_ex_or_current_bengs_why_they_call_weapons_kc/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Last time those got play one, yall know they  refer to weapons as KC. Why ah? Whats the meaning?</p>\n\n<p>My dialect q bad so maybe im not making some connection.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Have you heard of/ use Haier Air Conditioners?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p621so/have_you_heard_of_use_haier_air_conditioners/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p621so/have_you_heard_of_use_haier_air_conditioners/",
      "pubDate": "Tue, 25 Nov 2025 03:30:46 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p621so/have_you_heard_of_use_haier_air_conditioners/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Was looking to replace my air conditioner at home. Chanced upon Audio House having a sale for <a href=\"https://audiohouse.com.sg/product.php?item=HAI/SYS3-4U65RH1SRA-01\">Haier</a> which looks like a pretty good deal. I&#39;m wondering if anyone has used this brand before? What was your experience like? Please share. Thanks in advance!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "UOB and Shopee related scams on the rise",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p61yeu/uob_and_shopee_related_scams_on_the_rise/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p61yeu/uob_and_shopee_related_scams_on_the_rise/",
      "pubDate": "Tue, 25 Nov 2025 03:26:09 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p61yeu/uob_and_shopee_related_scams_on_the_rise/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Recently have been receiving UOB and Shopee related transcation calls from Singapore mobile numbers. Callers sound very local , asking for Mr.xyz can you approve shopee transcation your UOB account. In fact i dont have any uob account. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Any electrical guru able to advise?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p61vyr/any_electrical_guru_able_to_advise/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p61vyr/any_electrical_guru_able_to_advise/",
      "pubDate": "Tue, 25 Nov 2025 03:22:46 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p61vyr/any_electrical_guru_able_to_advise/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m looking for some basic surge protection for electricals like laptop and the living room entertainment. Specifically a multi-plug or tile. </p>\n\n<p>Cai Png stall can name their dish Wagyu beef but it is just named so. Likewise many electrical accessories can claim everything they want under the sky on their marketing material. </p>\n\n<p>So how do I tell if it genuinely has surge protection? AI tells me the genuine stuff should have a joule rating as the most reliable genuine indicator of having surge protection. </p>\n\n<p>Please advise or recommend. No need for anything high end. At the same time, don&#39;t recommend what I&#39;m already skeptical about, empty claims.</p>\n\n<p>Edit: if mods happen to want to nuke this, please understand the need for local procurement relevance. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How hard exactly is entrepreneurship in Singapore? How long did it take for business to start raking in profit like budding small local brands?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p56d30/how_hard_exactly_is_entrepreneurship_in_singapore/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p56d30/how_hard_exactly_is_entrepreneurship_in_singapore/",
      "pubDate": "Mon, 24 Nov 2025 03:22:11 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p56d30/how_hard_exactly_is_entrepreneurship_in_singapore/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Considering to go into the self employment route but would like to get a sensing how many months/years did it take before business actually start seeing some hope?</p>\n\n<p>Any advice how many months i should prepare for this self employment journey? Any advice or harsh truth is welcomed even if it hurts.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Basic Model bootcamp experience?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5zpc1/basic_model_bootcamp_experience/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p5zpc1/basic_model_bootcamp_experience/",
      "pubDate": "Tue, 25 Nov 2025 01:38:58 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p5zpc1/basic_model_bootcamp_experience/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I would love to hear about your experience! Currently considering joining their new batch but not sure if the fees are worth  . </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Anxiety getting worst. Please help me.",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p57jfj/anxiety_getting_worst_please_help_me/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p57jfj/anxiety_getting_worst_please_help_me/",
      "pubDate": "Mon, 24 Nov 2025 04:21:34 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p57jfj/anxiety_getting_worst_please_help_me/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi guise. My anxiety is getting worst as of today. I have doc appointment and too see the pyscologist next year. The wait is longer. I&#39;m on fluveroxamine to help me calm down, but i only can take it at night. Please anyone, i need advise on what i can do next. I am thinking of IMH but it&#39;s expensive. Please help me, as i&#39;m distraught and in need of help. </p>\n\n<p>Update: Thank you everyone for your kind helps and replies. I&#39;ve done things that you all have suggested and things is slowly going as plan. I&#39;m still on fluveroxamine, and i&#39;ve also secure counseling appt with mindline. I took a day off today from work, just to calm down and unwind. Sorry, i couldnt reply all your responses, but just to let you all know that i&#39;m doing ok and will take it slow each day. I&#39;ve got this. 😊</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "I am convinced after a demo at my house on a vacuum cleaner Germany Dolphin, but the price is way too expensive. Any recommendations for good vacuum cleaner using water filtration ?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p54xwl/i_am_convinced_after_a_demo_at_my_house_on_a/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p54xwl/i_am_convinced_after_a_demo_at_my_house_on_a/",
      "pubDate": "Mon, 24 Nov 2025 02:14:29 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p54xwl/i_am_convinced_after_a_demo_at_my_house_on_a/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi all, I had a free cleaning session with the salesperson from this company Xu Run holdings to do a demo on my mattress and sofa. Quite impressed but I was told the machine costs 4.5k after discount ( can use climate voucher). Or if I don’t want to buy the machine, I can buy their cleaning package for 24 months at 3.2k. If I buy the machine, they will throw in some free servicing sessions. \nI feel that it’s too expensive and ask to consider. Although the salesperson tried to hardsell me, I did not budge. But this machine looks really impressive other than its bulky. Just want to ask if there are any other affordable ones in the market that I can buy. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    }
  ],
  "group": "country",
  "url": "https://redlib.perennialte.ch/r/askSingapore.rss",
  "lastFetched": "2025-11-25T05:41:56.622Z"
}