{
  "title": "Perempuan",
  "description": "Welcome to r/Perempuan, a community for Indonesian Female Empowerment!\nPlease use user flair before commenting.",
  "link": "",
  "items": [
    {
      "title": "Weekly Chat Thread (WCT)",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p4rs35/weekly_chat_thread_wct/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p4rs35/weekly_chat_thread_wct/",
      "pubDate": "Sun, 23 Nov 2025 17:00:31 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p4rs35/weekly_chat_thread_wct/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p4rs35/weekly_chat_thread_wct/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "ngerasa ga skrg banyak banget scammer di bumble?",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p9qjtd/ngerasa_ga_skrg_banyak_banget_scammer_di_bumble/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p9qjtd/ngerasa_ga_skrg_banyak_banget_scammer_di_bumble/",
      "pubDate": "Sat, 29 Nov 2025 14:40:45 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p9qjtd/ngerasa_ga_skrg_banyak_banget_scammer_di_bumble/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>- using chindo looking pics</p>\n\n<p>- always said theyre moving to indo for work</p>\n\n<p>- claims to be malay-chinese/viet-chinese/etc</p>\n\n<p>- wants to move to wa asap</p>\n\n<p>- englishnya kaku, as if theyre using translation service</p>\n\n<p>anyone else encountered these? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What's your stance on AI chat bot use in the dating world ?",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p8zpvk/whats_your_stance_on_ai_chat_bot_use_in_the/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p8zpvk/whats_your_stance_on_ai_chat_bot_use_in_the/",
      "pubDate": "Fri, 28 Nov 2025 16:51:21 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p8zpvk/whats_your_stance_on_ai_chat_bot_use_in_the/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Gay guy here. So ,mau putting myself out again soon setelah beberapa bulan single. Tapi agak was² dan malas dengan maraknya penggunaan AI di dunia online dating. Yang aku maksud profil dan fotonya legit , tapi dia menggunakan AI untuk chat agar dia kelihatan charming, funny or smart. Hampir 2 tahun yang lalu pernah ngalami , kenal orang online dan chatting. He was very smart and charming, setelah 2 hari chat aku baru tanya , kamu orang Jerman tapi Bhs. Inggris kamu kok lancar banget ? Dia ngaku pakai AI. Walau baru 2 hari kenal dia tapi kok kecewa banget ya, i felt i was being misled. </p>\n\n<p>Untuk yg berpikir gpp pakai AI untuk translate ,malah membantu. I&#39;m old enough to use google translate to talked with guys i met online. Masalahnya kalau pakai AI bisa dikasih prompt untuk memberi sentuhan kepribadian yg bisa jauh berbeda dari si pengguna. Kalau google translate kan kyk robot, jadi kita ga expect anything. Pernah baca post juga soal perempuan yg berbincang dengan pria yang ditemuin di dating app selama sebulan. Waktu chattingan sih kliatan pinter dan lucu, pas ketemu first date malah plonga plongo. Ternyata pakai AI.  Isn&#39;t that the definition of being catfished ? </p>\n\n<p>My last ex got the scrutiny because i suspected him also using AI to chat with me. The irony is, he turned out to be an AI researcher. But he also agreed with me, using AI to get to know someone you like is wrong. And some of us only do chats, i hate taking calls. Kayaknya harus berubah dan mulai menuntut yg ngajak kenalan untuk voice call. Atau AI udah mulai bisa dipakai buat voice call juga ? Mampus lah 🤭</p>\n\n<p>So ,whats your opinion on this issue ? Mau tanya di sub utama tapi beberapa kali baca komen yg menyarankan pakai AI saja kalau kesulitan ngomong sama cewek yg ditemuin online. Mungkin di sub ini bisa lebih mengerti dan memberi pandangan dari sudut &quot; korban &quot;. 😄</p>\n\n<p>Terima kasih banyak.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Cat Calling",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p81vqu/cat_calling/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p81vqu/cat_calling/",
      "pubDate": "Thu, 27 Nov 2025 13:12:36 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p81vqu/cat_calling/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hey girls, aku ingin cerita kejadian cat calling. Waktu SMA kelas 12 menjelang lulus pas pulang ke rumah jalan kaki tiba - tiba ada tukang bangunan cat calling aku &quot;Dek, mau gak sama Abang ini? Kalo sama Abang ini gak ada duit.&quot; Aku padahal pakaian seragam sopan dan tertutup. Untungnya aku cuekin.</p>\n\n<p>Pernah juga pas beli makanan aku pulang malah kena cat calling tongkrongan cowok gak jelas. &quot;Neng mau gojek? Gojek gojek gojek.&quot; Aku langsung jalan cepat. Aku ingat pakaiannya jaket Hoodie sama celana panjang.</p>\n\n<p>Pernah juga pas pulang kampus naik angkot di catcalling sama abang2 nyanyi2 di depan ku. It&#39;s very cringe as fck! </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Question about digicam.",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p7yf8e/question_about_digicam/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p7yf8e/question_about_digicam/",
      "pubDate": "Thu, 27 Nov 2025 09:55:20 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p7yf8e/question_about_digicam/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi puann, mau tanya dong apakah harga digicam rata-rata masih diatas 1 juta ya? dan apakah puan disini ada yang tau digicam under 1 juta yg oke? thank youu</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "hopeless, any DIY recommendations or trusted clinics/dermatologist?",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p72eht/hopeless_any_diy_recommendations_or_trusted/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p72eht/hopeless_any_diy_recommendations_or_trusted/",
      "pubDate": "Wed, 26 Nov 2025 08:18:34 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p72eht/hopeless_any_diy_recommendations_or_trusted/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"/preview/pre/0h8cnb998k3g1.png?width=1202&amp;format=png&amp;auto=webp&amp;s=b023c2987ac45175f9b9ccf7f1be8dde3382c6f2\">/preview/pre/0h8cnb998k3g1.png?width=1202&amp;format=png&amp;auto=webp&amp;s=b023c2987ac45175f9b9ccf7f1be8dde3382c6f2</a></p>\n\n<p>Hei puans, please encourage me. Rambut aku emang pada dasarnya tipis, ortu juga setipe dan udh pada botak. Rambut aku mulai menipis drastis pasca kena covid. Aku udah coba konsul ke hal*doc, datengin beberapa klinik tp hasilnya belum seberapa. Rambut aku udh jarang rontok cuma susah banget tumbuh lagi.   </p>\n\n<p>Pengalaman aku di beberapa klinik, dokternya gak capable buat jelasin &quot;aku ini kenapa&quot;, malah akunya yang jelasin soal androgenic alopecia, dht blocker, dsb.  </p>\n\n<p>Puans ada yang punya pengalaman sama? Pls help me :(</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Physical contact norms in Indonesia",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p73ayh/physical_contact_norms_in_indonesia/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p73ayh/physical_contact_norms_in_indonesia/",
      "pubDate": "Wed, 26 Nov 2025 09:19:12 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p73ayh/physical_contact_norms_in_indonesia/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>So for context, my co-worker, she is Muslim, I&#39;m not, I&#39;d say we&#39;re kinda friendly towards each other and often commute together. For the past few months, she started getting kinda touchy, playfully punching/slapping my arms/shoulders almost daily, but I personally have no problems with that.</p>\n\n<p>Yesterday, we went home together, and she tripped and fell in the train station, I wasn&#39;t sure what to do, but instinctively I helped her get up by picking her up under the arms, and a light shoulder tap as a &quot;ur good&quot; gesture, and people around started staring at me like I just did something hideous, she seems fine with it, but I can&#39;t stop thinking about it.</p>\n\n<p>So I&#39;d love to hear opinions on this, is helping her up without her asking for it too much? what should I do if the same situation happen again?</p>\n\n<p>Also bonus question, is it acceptable for males to reciprocate playful touching back? because I had a bunch of situations similar to this but I never reciprocate lmao. Thanks</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "SOP Foto Kurir Paket",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p73pen/sop_foto_kurir_paket/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p73pen/sop_foto_kurir_paket/",
      "pubDate": "Wed, 26 Nov 2025 09:45:47 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p73pen/sop_foto_kurir_paket/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Ada yang tahu soal SOP foto buat kurir jasa pengiriman gak? Soalnya kok gue suka ngerasa aneh yaa. Kayak... Kenapa sih ngefotonya tuh harus berkali-kali? Gue kira ngefoto paketnya aja cukup tapi ternyata musti sama orang yang nerima paketnya juga ya? </p>\n\n<p>Dan ada ga di antara kalian yang pernah difoto bareng paketnya gitu terus bilang gak nyaman? Soalnya aku mau bilang gitu tapi udah ngefreeze duluan dan ga paham SOPnya. Makasih yang udah mau bantu jawab </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "FINAL RESULT OF MY 3 MONTH LONG MAKE UP ATTEMPTS ❗🫡",
      "link": "/gallery/1p6bjme",
      "guid": "/gallery/1p6bjme",
      "pubDate": "Tue, 25 Nov 2025 12:46:33 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p6bjme/final_result_of_my_3_month_long_make_up_attempts/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>final update on my make up journey!! i finally did my own make up for graduation! it held up okay for ~6 hours, tapi krn aku foto jam 4 sore, pas siang aku hapus dan make up ulang.</p>\n\n<p>Pas pagi aku lupa nambahin highliter di inner corner jdnya kayak kurang NYALA... But overall senang dengan hasilnyaaaaaa. Altho kurang suka dengan hair donya terutama pas sore krn udah berantakan dan kaku... Lesson learned next time kalau udah kayak gitu mending keramas dan blow out daripada berusaha mempertahankan... Semoga foto wisudaku yang sore itu masih decent deh....</p>\n\n<p>Thankssss a lot to all of you puans for the help along soooo many attempts 💗</p>\n\n<p>List of products for anyone interested:\n1. Makeover powerstay cushion w20\n2. Guele concealer in sande (altho slightly too orange/yellow)\n3. Haquhara peach corrector \n4. Meetmolly precision eyebrow pen in gray brown\n5. eyeshadow: colorrose palette (lupa kode, beli di ohsome), blush implora dusty rose, blush viva fintouch 05\n6. Blush: liquid: rose all day dear diary; powder: implora dusty rose, viva fintouch 05, marcks pink compact powder \n7. Highlighter: from colorrose palette+salsa galaxy (yang gold, lupa kode)\n8.contour: justmiss contour/bronzer \n9. Lip: wardah lip cream 03+13 (inner), omg gloss\n10. Lashes: baisisi z03, tanpa lem tambahan \n11. Setting spray: MOP satin (tbh meh bgt sih)+hatomugi buat moisturizer di sela makeup</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Recommendations for full blood workup/hormonal check-up",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p73ib9/recommendations_for_full_blood_workuphormonal/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p73ib9/recommendations_for_full_blood_workuphormonal/",
      "pubDate": "Wed, 26 Nov 2025 09:33:00 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p73ib9/recommendations_for_full_blood_workuphormonal/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Puans di sini ada yang pernah MCU dengan full blood workup kah? MCU reguler biasanya blood test nya mencakup ke blood count, metabolic panel, tapi belum mencakup kadar vitamin D atau ke keseimbangan hormon gitu.</p>\n\n<p>Ada yang tau lab yang provide sampai ke keseimbangan hormon kah?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "My father is just my sperm donor and nothing more.",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p673ly/my_father_is_just_my_sperm_donor_and_nothing_more/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p673ly/my_father_is_just_my_sperm_donor_and_nothing_more/",
      "pubDate": "Tue, 25 Nov 2025 08:19:45 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p673ly/my_father_is_just_my_sperm_donor_and_nothing_more/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I hate my sperm donor (SD) so much sampe mikir kalo suatu hari aku ketemu &quot;the one&quot; dan kami menikah, aku <em>NGGAK SUDI</em> dituntun jalan ke altar sama si SD (aku Kristen).</p>\n\n<p>Kenapa? Karena aku berkaca dari nikahan kakakku beberapa waktu yang lalu. Sepanjang 1 hari acara, dia cuma marah-marah, gak sabar, maunya cuma salaman terus CROT terus bubar rubuhin gedung nikahan. Dia lampiasin emosinya ke aku, ibu, dan kakakku (tapi langsung jaim di depan keluarga besar dan keluarga mempelai). Ribuuuuuut gak ada habisnya hanya perkara tamu-tamu yang dia undang dateng suuuuuuuuper telat. Otaknya gesrek, lupa kalo fokus di hari itu adalah ANAK SULUNGNYA YANG LAGI NIKAH, bukan TAMU-TAMU TOLOL YANG BERANGKAT <em>NAEK KAPAL</em> DARI LUAR PULAU BEBERAPA JAM SEBELUM ACARA TERUS MASIH MINTA DIKASIH KAMAR GRATIS SEMALEM DI HOTEL. Kocak.</p>\n\n<p>Si SD ini juga lagi kena kanker although sel kankernya udah tinggal dikit abis pengobatan berbulan-bulan. He lost his voice yg lama-lama menurutku lucu karena itu kayak karma dan teguran dari Tuhan krn dia suka teriak maki-maki orang. He was such an abusive piece of shit; sukanya rendahin orang-orang karena menurutnya lucu. Very patriarchal too, ada masanya mukul2 ibu, larang ibu ambil S2 karena egonya kesentil, sering seenaknya nyuruh ibu masakin lauk buat 50 orang dengan budget sekecil kontolnya biar nanti SD dianggap dermawan udah ngadain perjamuan besar. Nganggep dia harus dilayani, dihormati, disegani, jadi fokus utama. Si yang paling bos besar.</p>\n\n<p>Tapi kalo ngomong soal Tuhan langsung uwu 🥺 Tuhan Yesus 🥺 ampunilah kami 🥺🙏🏽 yang kecil dan berdosa ini 🥺😭💦 Yeee tai ledug, ngomong lembut doang ama Tuhan, ama keluarga sendiri yg notabene titipan dari Tuhan malah disemena-menain. Kocakkkk. Ngapain tiap minggu lu ke gereja anjirrrrr. Oya tapi syukurlah ibu dan SD ini udah cerai dari lama. But the wound is still there. Sebelum ada yg komen, &quot;coba ngomong sama dia&quot;, girl we tried. Gak pernah berhasil karena dia gak pernah ngerasa salah. Dia malah marah dan tersinggung. Jadi yaudah, udah 5 bulan aku cuekin dia and I plan to keep doing it until the day comes.</p>\n\n<p>I just want to say, just because someone is old, lonely, and sick or dying, doesn&#39;t always mean that they&#39;re innocent. Contohnya ya ini. Bete aku kalo ditegur, &quot;sabar dong sama papamu,&quot; atau &quot;heh jangan gitu&quot;. Lho? Ngapain aku harus sabar dan hormatin dia? Dia pernah hormatin aku kah? Udah dibantu rawat berbulan-bulan selama pengobatan kanker masih ngelunjak-ngelunjak aja tuh? Aku harus hormatin dia semata-mata karena statusnya di KK sebagai &quot;bapak&quot;? Girl tukang siomay langgananku treats me better than him. I will respect SD ketika dia bisa bersikap kayak tukang siomay langgananku.</p>\n\n<p>Anyway. Grief itu soal kehilangan. Pas nanti dia mati, aku ngerasa gak bakal kehilangan apapun, karena dari kecil aku gak pernah punya memori yang bagus sekecil apapun itu soal dia. Apa yang bakal aku rasa hilang kalo aku nggak punya apa-apa? Girl bye</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Jogja info + Two way cake recommendations?",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p6ipr1/jogja_info_two_way_cake_recommendations/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p6ipr1/jogja_info_two_way_cake_recommendations/",
      "pubDate": "Tue, 25 Nov 2025 17:32:46 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p6ipr1/jogja_info_two_way_cake_recommendations/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Okay aku mau tanya dua hal since i have a lot of things going on in my mind.</p>\n\n<p>Aku ada rencana mau seminggu ke Jogja bulan depan, sebelumnya sih pernah kesana setiap bulan pre covid dan terakhir around 2022 jadi aku ngerasa kayaknya Jogja udah banyak yang berubah maybe? jadi aku mau tanya ada tips harus ke mana? (prefer local places yg orang jogja kesana like tempat makan, coffee shop, or museum maybe?) atau apa aja yang lagi happening di jogja?</p>\n\n<p>Dan buat two way cake, jadi kulitku tuh badak bgt wkwk alias gampang oksidasi, sejauh ini cuma two way cake yg works in my face.</p>\n\n<p>Udah coba glad2glow punya tp akhir-akhir ini udah oxidize bgt dan ga cocok di mukaku, luxcrime feels too warm and orange for me(?) dan kayak kurang banyak aja shade nya menurutkuu, jadi either shadesnya keterangan bgt atau kegelapan, hiks.</p>\n\n<p>Any recommendations? (oiya kulitku acne sensitive, oily if that helps!)</p>\n\n<p>Thank you in advance!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Need older puans to discuss",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p65ap9/need_older_puans_to_discuss/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p65ap9/need_older_puans_to_discuss/",
      "pubDate": "Tue, 25 Nov 2025 06:26:42 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p65ap9/need_older_puans_to_discuss/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Halo puans... sesuai judul, i (f25) need older puans to discuss about masturbation and sexual stuff huhu. Thanks ij advance yaa</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Fine line tattoo artist Jakarta",
      "link": "/img/629eyukoea3g1.png",
      "guid": "/img/629eyukoea3g1.png",
      "pubDate": "Mon, 24 Nov 2025 23:11:41 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p5wdqo/fine_line_tattoo_artist_jakarta/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi puans, aku kepikiran untuk bikin tato fine lines di Jakarta. Apakah ada yang punya rekomendasi atau mungkin sekedar pernah dengar atau liat akun2 yang style fine line di instagram? Bonus kalau ada yang pernah pengalaman pribadi dan bisa info harga juga hehe.Terima kasih!!</p>\n\n<p>**Contoh style yg aku suka kaya di foto inii.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Pelvic floor therapy?",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p5m9kf/pelvic_floor_therapy/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p5m9kf/pelvic_floor_therapy/",
      "pubDate": "Mon, 24 Nov 2025 16:52:47 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p5m9kf/pelvic_floor_therapy/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Puans, it looks like I’m struggling w vaginismus (massive sigh). I’m seeing a gyno but I’m wondering if there’s a pelvic floor therapist di area Jkt and sekitarnya? I’m interested to tackle this issue holistically (medis + exercise) 😩🙏🏻 thanks puanssss </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Bagusnya bersikap kaya apa di situasi kaya gini?",
      "link": "/img/u1v6tjlsx43g1.jpeg",
      "guid": "/img/u1v6tjlsx43g1.jpeg",
      "pubDate": "Mon, 24 Nov 2025 04:48:14 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p581ix/bagusnya_bersikap_kaya_apa_di_situasi_kaya_gini/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Mungkin tergantung settings juga ya, kalo di professional settings gw cuma bisa poker face. Kalo di social settings gw paling cuma masang muka gaenak dan gak lanjut berkontribusi di obrolan :/</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Puan yang into kegiatan outdoor/hiking, beli gear dimana?",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p5411d/puan_yang_into_kegiatan_outdoorhiking_beli_gear/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p5411d/puan_yang_into_kegiatan_outdoorhiking_beli_gear/",
      "pubDate": "Mon, 24 Nov 2025 01:30:20 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p5411d/puan_yang_into_kegiatan_outdoorhiking_beli_gear/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hiii, aku sedang into hiking dan mau mencoba long day hike (yang lebih dari dua hari) ke beberapa gunung di Indonesia. Tapiii, aku baru sadar aku belum punya gear yang cukup memadai. Permasalahanku ada dua:</p>\n\n<ol>\n<li>Budget. Kalau beli satu masih nggak kerasa, tapi beli banyak langsung berasa banget. Aku akan sangat berterima kasih kalau ada yang bisa nyaranin tempat thrift online atau merk yang affordable. </li>\n<li>Size. Kalau kalian sadar, kebanyakan produk outdoor itu masih mengikuti standar ukuran laki-laki. Terakhir aku beli sepatu paling kecil ukuran 38, tapi masih kegedean banget dan harus pakai dua kaos kaki serta sol tambahan biar nyaman.</li>\n</ol>\n\n<p>Karena dua permasalahan itu, aku cuma punya sedikit gear yang proper. Ada yang size-nya pas, tapi mahal, giliran murah, size-nya nggak pas di aku.</p>\n\n<p>Itu aja, terima kasih semuanya:)</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Curhat",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p4kqcs/curhat/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p4kqcs/curhat/",
      "pubDate": "Sun, 23 Nov 2025 11:43:26 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p4kqcs/curhat/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hai, aku mau cerita. Bulan Oktober akhir lalu aku kontrol ke psikiater. Sambil nunggu obat di farmasi, aku duduk di samping bapak2. Nah si bapak ini nanya ke aku, &quot;Anda dari dokter mana?&quot;\nAku jawab, &quot;Dari dokter psikiater?&quot;\n&quot;Psikiater itu apa?&quot; Bapak itu gak tahu psikiater.\n&quot;Itu dokter jiwa, pak.&quot;\n&quot;Memang kamu sakit apa?&quot; Tanya bapak itu.\n&quot;Saya bipolar.&quot;\n&quot;Bipolar itu apa?&quot; Bapak itu tanya lagi.\n&quot;Bipolar itu gangguan mood. Kadang suasana hati bagus dan buruk.&quot;\nEh si bapak ini bilang, &quot;Sholat tahajud dan berdoa.&quot; Aku syok bgt aku jawab &quot;oh gitu&quot; ke bapak itu. Entah kenapa ya setiap orang punya masalah mental selalu aja kurang dekat sama Tuhan lah imannya lemah lah. Padahal aku selalu berdoa tetap aja mental aku down. Bahkan ortu ku juga jawabannya persis kayak bapak itu. Kalian ada yang sama? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Am I overreacting? gift for making connection!",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p4tf7f/am_i_overreacting_gift_for_making_connection/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p4tf7f/am_i_overreacting_gift_for_making_connection/",
      "pubDate": "Sun, 23 Nov 2025 18:04:20 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p4tf7f/am_i_overreacting_gift_for_making_connection/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hello fellas, I&#39;m planning to make a small gesture of giving small gift - congratulations card to several friends. It&#39;s not pricy but I think it&#39;s appropriate and cutesy, so~ do you think it&#39;s fine for me to come at their final thesis seminar (at my campus it&#39;s open for public) or post - graduation?</p>\n\n<p>I have this intention to get connected and have better luck on my &#39;relasi&#39;? some of them have business, good careers, and future potential as I&#39;ve seen their progress in this damn college era? I think most of them know me through our family but I don&#39;t think we get along well, but I feel like I&#39;m gonna have to work even make some contracts with them on professional matters one day (don&#39;t want to risk my future if there&#39;s any rumors). Guess I don&#39;t want to miss this opportunity? </p>\n\n<p>Honestly I feel like being opportunistic, I&#39;m not feeling well about my intention but I also feel wanting to appreciate those who catch my interest. I&#39;m sure my parents would love this idea, I don&#39;t mind investing my money by giving small gestures juga sih. Am I overreacting?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Saran Outfit",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p4dfa9/saran_outfit/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p4dfa9/saran_outfit/",
      "pubDate": "Sun, 23 Nov 2025 04:22:59 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p4dfa9/saran_outfit/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hii, I want to ask for some advice. If you have a skinny body (I&#39;m underweight ☹), what kind of clothes would look good? Is wearing a sleeveless top a bad choice? And if you know any online stores that are skinny-friendly, please let me know!! Thank you.</p>\n\n<p>P.S. I’m going to an outdoor concert soon, so if you have any outfit suggestions, feel free to share 🤗</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "(TW: SA) My Boyfriend is making me realize how much in deep mess I was",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p39icf/tw_sa_my_boyfriend_is_making_me_realize_how_much/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p39icf/tw_sa_my_boyfriend_is_making_me_realize_how_much/",
      "pubDate": "Fri, 21 Nov 2025 20:32:48 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p39icf/tw_sa_my_boyfriend_is_making_me_realize_how_much/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been with my current boyfriend for almost a year now. He’s a very kind, loving, and respectful gentleman. He’s a yearner… he has a gentle smile and touch, never raises his voice at me, adores me, and sees me as the only person he graciously loves. He communicates well and understands whenever I assert my needs and wants. He respects my boundaries and never crosses them.</p>\n\n<p>I’ve always had a tendency to repress my emotions—my parents used to scold me for crying. That shaped the way I deal with my emotions even now.</p>\n\n<p>Never in my life did I expect that the tenderness my boyfriend shows would remind me of how deeply I had been wronged in the past. Sometimes, in the middle of the day, the chest pain appears, and I suddenly realize I’m crying.</p>\n\n<p>Before him, I was in a relationship with someone who made me incredibly sad whenever I remember everything I tolerated. He guilt-tripped me into having sex with him or sending him nudes just so he would give me love even after I told him that my previous partner had already made me feel like nothing more than a body to be lusted after. Those are besides episodes of emotional abuses too.</p>\n\n<p>He was my friend, he should’ve been my friend before he was a lover, someone I thought I could be vulnerable with.</p>\n\n<p>I felt betrayed…</p>\n\n<p>There are so many things I feel I was wronged for when I was with him. It destroys me that whenever I consciously try to bring everything to the surface and confront it at once, nothing comes up. It only appears little by little, and each time it does, I’m shaken all over again.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Tips di salon mahal?",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p3kipi/tips_di_salon_mahal/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p3kipi/tips_di_salon_mahal/",
      "pubDate": "Sat, 22 Nov 2025 04:50:01 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p3kipi/tips_di_salon_mahal/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Gaisss nanya dong, biasanya aku ke salon2 biasa kan ngasih tips ya.\nKalo misal kita ke Irwan atau Ando n Yun yg ada foreignernya, itu ttp kita kasih tips ga?</p>\n\n<p>Terus biasanya yg nyuci sama yang potong atau color kan beda org, kita kasih yg main stylist nya aja satu atau tiga tiganya?</p>\n\n<p>Terus nominalnya ada rulesnya ga? Misal berapa persen dr harga?\nMakasih gaiss </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Mau tanya buat assessment ADHD atau mental illness in general secara Online.",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p3lml7/mau_tanya_buat_assessment_adhd_atau_mental/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p3lml7/mau_tanya_buat_assessment_adhd_atau_mental/",
      "pubDate": "Sat, 22 Nov 2025 05:51:41 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p3lml7/mau_tanya_buat_assessment_adhd_atau_mental/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi F 30 here, sesuai judul, ada yang pernah pengalaman assessment ADHD atau mental illness in general, bisa sharing pengalaman dan informasi terutama yang bisa assesment online? Saya pernah lihat di iklan di IG ada assesment ADHD sejuta, apakah itu harga normal? dan Assesment adhd dan mental illness apakah berbeda?</p>\n\n<p>Terima kasih banyak, have a good day.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Get to know what facial wash should I consider?🥂",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p33ju5/get_to_know_what_facial_wash_should_i_consider/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p33ju5/get_to_know_what_facial_wash_should_i_consider/",
      "pubDate": "Fri, 21 Nov 2025 16:44:06 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p33ju5/get_to_know_what_facial_wash_should_i_consider/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Malam puan! Sesuai judul, baru-baru ini ingin beralih dan coba cari facial wash if it&#39;s possible yang ada travel size-nya. So far I&#39;ve been using so many products [skin type: dry skin]</p>\n\n<ol>\n<li>Skin 1004 Pink 🩷 \nBagus, but not really work with my skin texture </li>\n<li>Nature E Biru\nBagusss sayangnya kering dikit di wajah, BUT after a day of physical activity - when my face kinda oily this one works so well</li>\n<li>Scor@\nWorst 😭 mine got breakout after seminggu coba + make my skin looks dull; if someone based on Jogja dan cocok pls PM, gonna send to u for free</li>\n<li>Garnier vit c\nKering, not so happy with the results, gampang kusam.. </li>\n</ol>\n\n<p>Do you have any experience with hada labo, cosrx, and others products as well? Please kindly drop your review :( I got trust issues searching on female daily website and sooo many beauty influencer today</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Pengalaman operasi Lasik",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p2wycj/pengalaman_operasi_lasik/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p2wycj/pengalaman_operasi_lasik/",
      "pubDate": "Fri, 21 Nov 2025 12:09:10 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p2wycj/pengalaman_operasi_lasik/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Girls, mau nanya”. Disini ada yg pernah operasi Lasik ReLex Smile Pro di JEC Kedoya?? Kalau pernah, boleh spill minus dan silinder sebelum operasi berapa dan apakah setelah operasi, minus dan silinder nya bener” ga ada lagi? Dan utk sebelum operasi, dokter nya ada nanya” soal minus dan silinder setahun sebelumnya? Apakah kita wajib cek dulu tepat setahun sebelum kita mau operasi?</p>\n\n<p>Soalnya aku terakhir cek awal tahun 2024 dan pertengahan 2023, minus dan silinder ku uda terhitung stabil menurut dokter waktu itu walau ada beda sedikit, beda minus nya -0.5 (mata kiri ku berkurang minusnya dari -6.0 jadi -5.5 dan mata kanan ku bertambah minus nya dari -5 jadi -5.5). Dan aku jg rencana mau operasi nya di awal tahun depan, apakah bisa or lebih baik aku tunda sampai akhir tahun depan aja setelah aku cek mata ku lagi akhir tahun ini? Dan juga soalnya aku asalnya dari luar jawa, jadi aku harus nge-plan kapan mau ngelakuin operasi nya bener”. Thanks in advance.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    }
  ],
  "group": "country",
  "url": "https://redlib.perennialte.ch/r/Perempuan.rss",
  "lastFetched": "2025-11-30T05:41:02.148Z"
}