{
  "title": "indonesiabebas",
  "description": "Buat bahas Indonesia, tapi bingung kemana? kesini aja. Cuma akal sehat jangan sampai kelupaan.",
  "link": "",
  "items": [
    {
      "title": "[Corat Coret] Dinding Belakang Rumah Bu Novia, No.25",
      "link": "https://redlib.perennialte.ch//r/indonesiabebas/comments/1olbcct/corat_coret_dinding_belakang_rumah_bu_novia_no25/",
      "guid": "https://redlib.perennialte.ch//r/indonesiabebas/comments/1olbcct/corat_coret_dinding_belakang_rumah_bu_novia_no25/",
      "pubDate": "Sat, 1 Nov 2025 01:03:21 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1olbcct/corat_coret_dinding_belakang_rumah_bu_novia_no25/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Seperti biasa thread bulanan buat naekin post karma atau diskusi kecil atau nyampah. Silahkan posting disini.</p>\n\n<p>Good luck and have fun ya buat bulan November.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Jika kamu menjadi istri di case ini bagaimana perasaanmu",
      "link": "/img/f75y1h3pwv3g1.jpeg",
      "guid": "/img/f75y1h3pwv3g1.jpeg",
      "pubDate": "Thu, 27 Nov 2025 23:30:06 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p8g1zt/jika_kamu_menjadi_istri_di_case_ini_bagaimana/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p8g1zt/jika_kamu_menjadi_istri_di_case_ini_bagaimana/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Madoera tjahaha asia",
      "link": "/img/s7f4oegt3x3g1.jpeg",
      "guid": "/img/s7f4oegt3x3g1.jpeg",
      "pubDate": "Fri, 28 Nov 2025 03:32:12 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p8kp2n/madoera_tjahaha_asia/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p8kp2n/madoera_tjahaha_asia/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Minta Rekomendasi Backpack",
      "link": "https://redlib.perennialte.ch//r/indonesiabebas/comments/1p8ivy6/minta_rekomendasi_backpack/",
      "guid": "https://redlib.perennialte.ch//r/indonesiabebas/comments/1p8ivy6/minta_rekomendasi_backpack/",
      "pubDate": "Fri, 28 Nov 2025 01:56:14 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p8ivy6/minta_rekomendasi_backpack/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Misi, saya mau cari backpack. Ada beberapa poin yg perlu diketahui</p>\n\n<ol>\n<li><p>Bawa laptop 15 inch dan tab. Plus charger dan alat lainnya</p></li>\n<li><p>Kadang bawa baju</p></li>\n<li><p>Sekarang pake Thule</p></li>\n<li><p>Budget max 2 juta</p></li>\n<li><p>Kalau ada tempat sepatu atau payung is a bonus. Ada tempat air mesti ada</p></li>\n<li><p>Warna hitam, abu2 boleh. Tapi bebas aja sih</p></li>\n<li><p>Sering dipake commute di KRL Baswe dsb</p></li>\n</ol>\n\n<p>Terima kasih</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How to better rephrase this sentence",
      "link": "/img/3y78yq3cus3g1.jpeg",
      "guid": "/img/3y78yq3cus3g1.jpeg",
      "pubDate": "Thu, 27 Nov 2025 13:11:30 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p81uzj/how_to_better_rephrase_this_sentence/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>For me lu muslim mau menjalankan rukun islam 2 dari 5 butuh lu kaya masa lu ga mau usaha biar lu bisa menuhin 5 5nya dan malah berlindung di kata rezekinya sudah begini padahal lu malas buat berusaha </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Fufufafa IQ gorilla",
      "link": "",
      "guid": "",
      "pubDate": "Fri, 28 Nov 2025 04:14:18 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p8lgxw/fufufafa_iq_gorilla/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p8lgxw/fufufafa_iq_gorilla/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "seberapa besar kemungkinan kena penyakit seksual kalau sering beli experience di indonesia kek dibawah? adakah kemungkinan bakal aman terus, ga kena std ato semacamnya gitu?",
      "link": "",
      "guid": "",
      "pubDate": "Thu, 27 Nov 2025 15:27:48 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p84y7q/seberapa_besar_kemungkinan_kena_penyakit_seksual/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p84y7q/seberapa_besar_kemungkinan_kena_penyakit_seksual/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Alasan Anak Muda Memilih Tidak Menikah",
      "link": "/img/yxgndvu2sq3g1.jpeg",
      "guid": "/img/yxgndvu2sq3g1.jpeg",
      "pubDate": "Thu, 27 Nov 2025 06:15:18 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7uvr7/alasan_anak_muda_memilih_tidak_menikah/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7uvr7/alasan_anak_muda_memilih_tidak_menikah/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Found this EV scooter route planner for Indonesia",
      "link": "/img/tcyqvsgz3u3g1.jpeg",
      "guid": "/img/tcyqvsgz3u3g1.jpeg",
      "pubDate": "Fri, 28 Nov 2025 04:40:12 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p8lxxc/found_this_ev_scooter_route_planner_for_indonesia/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p8lxxc/found_this_ev_scooter_route_planner_for_indonesia/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Leveling dimana kaka? Ajari dong caranya naik level cpat skali",
      "link": "/img/20x6xp444x3g1.jpeg",
      "guid": "/img/20x6xp444x3g1.jpeg",
      "pubDate": "Fri, 28 Nov 2025 04:26:08 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p8look/leveling_dimana_kaka_ajari_dong_caranya_naik/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p8look/leveling_dimana_kaka_ajari_dong_caranya_naik/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Pemerintah Tak Tetapkan Status Bencana Nasional untuk Banjir Sumatera",
      "link": "https://www.tempo.co/politik/pemerintah-tak-tetapkan-status-bencana-nasional-untuk-banjir-sumatera-2093683",
      "guid": "https://www.tempo.co/politik/pemerintah-tak-tetapkan-status-bencana-nasional-untuk-banjir-sumatera-2093683",
      "pubDate": "Thu, 27 Nov 2025 17:34:44 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p883w3/pemerintah_tak_tetapkan_status_bencana_nasional/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Banjir dan tanah longsor terjadi di tiga provinsi di Sumatera, yaitu Aceh, Sumatera Utara, dan Sumatera Barat.</p>\n\n<p>PEMERINTAH belum berencana menetapkan status bencana nasional untuk banjir yang terjadi di sejumlah kabupaten/kota di wilayah Sumatera. Menteri Koordinator Bidang Pemberdayaan Manusia dan Kebudayaan Pratikno mengatakan status kebencanaan saat ini masih dianggap sebagai bencana daerah.</p>\n\n<p>Banjir dan tanah longsor terjadi di tiga provinsi di Sumatera, yaitu Aceh, Sumatera Utara, dan Sumatera Barat. Masing-masing wilayah, kata Pratikno, sudah menetapkan status bencana daerah. &quot;Dengan status darurat bencana daerah,&quot; kata Pratikno seusai rapat tanggap bencana di kantor Badan Nasional Penanggulangan Bencana (BNPB), Jakarta Timur pada Kamis, 27 November 2025.</p>\n\n<p>Pratikno menilai status bencana daerah saat ini cukup untuk menjadi dasar melakukan berbagai tindakan penanganan di wilayah terdampak. &quot;Jadi tidak ada masalah sejauh ini karena masing-masing daerah sudah menyatakan ini kondisi darurat bencana,&quot; ucapnya.</p>\n\n<p>Mantan menteri sekretaris negara ini berujar pemerintah menentukan status kebencanaan sesuai dengan Undang-Undang Nomor 24 Tahun 2007 tentang Penanggulangan Bencana. Tindakan yang bisa diambil pemerintah juga diatur dalam undang-undang itu.</p>\n\n<p>Tindakan yang diambil, kata Pratikno, bertujuan mempermudah penanganan bencana di wilayah terdampak. Di antaranya melalui penggunaan Dana Siap Pakai, pengerahan bantuan, hingga perbaikan infrastruktur. Dia berujar pemerintah juga harus memastikan agar pemeberian bantuan tidak bermasalah secara administratif keuangan nantinya.</p>\n\n<p>Pratikno pun berharap penanganan bencana di Sumatera bisa berlangsung dengan baik. &quot;Ini adalah masalah kemanusiaan yang harus kita selesaikan secepat-cepatnya, semaksimal mungkin,&quot; tuturnya.</p>\n\n<p>Anggota Dewan Perwakilan Rakyat (DPR), Nasir Djamil, sebelumnya meminta Presiden Prabowo Subianto agar segera menetapkan status bencana nasional atas banjir yang melanda sejumlah provinsi di Indonesia. Politikus Partai Keadilan Sejahtera ini menilai penanganan bencana akan terhambat apabila pemerintah pusat belum menetapkan status bencana nasional.</p>\n\n<p>“Jika tidak segera ditetapkan sebagai bencana nasional, saya khawatir jumlah korban akan terus bertambah. Dengan kerendahan hati, saya meminta dan mendorong Presiden Prabowo Subianto untuk menetapkan status tersebut,&quot; kata legislator dari Aceh itu seperti dilaporkan Antara pada Kamis, 27 November 2025.</p>\n\n<p>Cuaca ekstrem mengakibatkan banjir dan tanah longsor di sejumlah kota dan kabupaten di Sumatera Utara, Sumatera Barat, dan Aceh dalam beberapa hari terakhir. Kepala Pusat Data, Informasi, dan Komunikasi Kebencanaan BNPB  Abdul Muhari mengatakan banjir yang terjadi dalam dua hari kemarin mengalir cukup deras dan menghantam rumah warga di beberapa daerah.</p>\n\n<p>Bencana itu menyeret kendaraan hingga infrastruktur lain yang dilewatinya. “Arus air juga membawa material seperti lumpur, batang pohon, puing bangunan, dan sampah rumah tangga,” kata Abdul melalui keterangan tertulis pada Rabu, 26 November 2025.</p>\n\n<p>Banjir dan tanah longsor turut menyebabkan terputusnya akses jalan ke beberapa kabupaten/kota. Jaringan listrik dan komunikasi di sejumlah wilayah juga terputus akibat bencana ini.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "KAI Mediasi Anita Dewi Pemilik Tumbler Tuku dan Petugas Stasiun, Ini Hasilnya",
      "link": "https://www.liputan6.com/bisnis/read/6223081/kai-mediasi-anita-dewi-pemilik-tumbler-tuku-dan-petugas-stasiun-ini-hasilnya?page=4",
      "guid": "https://www.liputan6.com/bisnis/read/6223081/kai-mediasi-anita-dewi-pemilik-tumbler-tuku-dan-petugas-stasiun-ini-hasilnya?page=4",
      "pubDate": "Fri, 28 Nov 2025 02:53:48 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p8jzh8/kai_mediasi_anita_dewi_pemilik_tumbler_tuku_dan/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p><strong>Begini proses mediasi antara Petugas Passenger Service Stasiun Rangkasbitung dan Anita Dewi, salah satu pengguna KAI Commuter Line yang sebelumnya melaporkan barang bawaannya berupa cooler bag berisi tumbler dan labu ASI.</strong></p>\n\n<p>Nama Anita Dewi tengah menjadi sorotan netizen setelah unggahannya di Threads tentang tumbler Tuku yang hilang di KRL viral di media sosial. Insiden ini terjadi pada 25 November 2025 ketika dia pulang kerja dan tanpa sadar meninggalkan cooler bag berisi tumbler dan labu ASI di KRL Commuter Line.</p>\n\n<p>Usai kejadian tersebut, PT Kereta Api Indonesia (Persero) melakukan proses mediasi antara Petugas Passenger Service Stasiun Rangkasbitung dan Anita Dewi, salah satu pengguna Commuter Line yang sebelumnya melaporkan barang bawaannya berupa cooler bag berisi tumbler dan labu ASI di KRL Commuter Line tertinggal di dalam kereta.</p>\n\n<p>Pertemuan kekeluargaan yang berlangsung di Kantor KAI Wisata, Stasiun Gondangdia, Jakarta, Kamis (27/11) malam ini menghasilkan kesepahaman bersama dari seluruh pihak. Melalui proses tersebut, KAI berharap persepsi publik menjadi lebih selaras dan informasi yang beredar di media sosial dapat kembali ke proporsi yang tepat.</p>\n\n<p>Direktur Utama KAI Bobby Rasyidin menegaskan bahwa perusahaan menjunjung tinggi profesionalitas layanan, sekaligus memastikan setiap Insan perusahaan memperoleh dukungan penuh dalam menjalankan tugas.</p>\n\n<p>“Setiap Insan KAI berkomitmen melayani pelanggan dengan dedikasi yang tinggi. Pada saat yang sama, perusahaan berkewajiban melindungi dan memberikan dukungan kepada seluruh pekerja dalam menjalankan peran mereka. Argi tetap menjadi karyawan KAI Group serta bagian dari garda terdepan pelayanan. Terus semangat bertugas dan memberikan layanan terbaik kepada pelanggan,” ujar Bobby, dikutip Jumat (28/11/2025).</p>\n\n<p>Vice President Corporate Communications KAI Anne Purba pada kesempatan terpisah menyampaikan bahwa langkah penyelesaian secara kekeluargaan ini merupakan bentuk keterbukaan KAI Group terhadap setiap masukan pelanggan.</p>\n\n<p>“KAI memastikan seluruh proses pelayanan pelanggan berjalan sesuai ketentuan. Kami juga menegaskan bahwa tidak ada pemecatan terhadap petugas terkait sebagaimana isu yang sebelumnya beredar,” jelas Anne.</p>\n\n<p><em>&quot;KAI Evaluasi Menyeluruh</em>*</p>\n\n<p>Anne menambahkan bahwa KAI Group melalui KAI Commuter dan KAI Wisata akan melakukan evaluasi menyeluruh untuk memperkuat koordinasi layanan, termasuk prosedur pengelolaan barang tertinggal (lost and found).</p>\n\n<p>“Kami terus meningkatkan integritas dan kesiapsiagaan seluruh pekerja, baik di area stasiun maupun selama perjalanan, agar layanan semakin responsif dan terpercaya,” ujar Anne.</p>\n\n<p>KAI mengimbau seluruh pelanggan untuk tetap memastikan barang bawaan berada dalam pengawasan, baik di area stasiun maupun selama berada di dalam layanan kereta api, Commuter Line, dan layanan KAI Group lainnya.</p>\n\n<p><strong>Nasib Petugas Stasiun Usai Viral Tumbler Anita Dewi Hilang, KAI Bantah Pecat: Pihak Mitra Masih Evaluasi</strong></p>\n\n<p>Sebelumnya, PT Kereta Api Indonesia (KAI) membantah melakukan pemecatan terhadap pegawainya usai viral curhatan penumpang kehilangan sebuah tumbler di KRL. Dalam unggahannya di media sosial X, penumpang bernama Anita Dewi bercerita tumbler miliknya hilang saat berada di dalam KRL. Kasus ini viral dan berimbas petugas Passenger Service stasiun mengaku dipecat.</p>\n\n<p>VP Corporate Secretary KAI Commuter Karina Amanda menuturkan, pihaknya melakukan penelusuran untuk memastikan kejadian sebenarnya. KAI Commuter mengaku tidak melakukan pemecatan sebagaimana isu beredar. Alasannya, ada aturan dan prosedur terkait kepegawaian yang tetap mengacu pada regulasi ketenagakerjaan.</p>\n\n<p>“Sebagai tahap awal, tentunya kami melakukan koordinasi kepada pihak mitra pengelola petugas front liner” ujar Karina melalui keterangan tertulis, Kamis (27/11/2025).</p>\n\n<p>Karina juga menegaskan bahwa tidak ada pemberhentian terhadap petugas front liner seperti yang ramai dibahas di media sosial. “Pihak mitra masih melakukan evaluasi internal untuk melihat lebih jelas kondisi yang terjadi,” tegasnya.</p>\n\n<p>Karina menambahkan, seluruh petugas di lapangan selalu diarahkan untuk menjalankan SOP dengan baik agar pelayanan kepada pengguna tetap terjaga. Dia juga mengingatkan bahwa barang pribadi merupakan tanggung jawab penumpang.</p>\n\n<p>&quot;Barang bawaan merupakan tanggung jawab pelanggan,&quot; tegas Karina.</p>\n\n<p>Menurut dia, setiap stasiun memiliki layanan lost and found dan setiap barang yang ditemukan akan didata dan disimpan oleh petugas. Jika tidak diambil dalam kurun waktu tertentu di stasiun tujuan akhir, maka barang tersebut akan dipindahkan ke gudang pusat untuk penyimpanan lebih lanjut.</p>\n\n<p>&quot;Kami tetap mengajak seluruh pengguna commuter line untuk memastikan barang bawaannya aman dan tidak tertinggal,&quot; tutup Karina.</p>\n\n<p><strong>Awal Mula Viral Tumbler Hilang</strong></p>\n\n<p>Sebuah utas berisi curhatan penumpang kehilangan sebuah tumbler di KRL. Dalam unggahannya di media sosial X, penumpang tersebut bercerita tumbler miliknya hilang saat berada di dalam KRL.</p>\n\n<p>Unggahan penumpang tersebut ramai lantaran petugas Passenger Service KAI Commuter dipecat karena menemukan tas berisi tumbler tersebut. Nahasnya, tumbler tersebut ternyata hilang dari dalam cooler bag.</p>\n\n<p>&quot;TUMBLER TUKU-ku GONE ATAS KE-TIDAK TANGGUNG JAWAB PETUGAS PT ΚΑΙ @commuterline Jadi ceritanya gini. Disclaimer aku minta maaf juga sebelumnya karna faktor lupa jadi ketinggalan coolerbag-ku di bagasi kereta,&quot; tulisnya akun @anitadewi dikutip Kamis (27/11/2025).</p>\n\n<p>Kejadian ini bermula saat penumpang tersebut pulang kerja dari Stasiun Tanah Abang menuju Rangkasbitung pukul 19.00 WIB. Dia menyadari jika cooler bag miliknya itu tertinggal saat turun di Stasiun Rawa Buntu sekitar pukul 19.40 WIB.</p>\n\n<p>&quot;Aku langsung lapor petugas (seragam security), aku menjelaskan keberadaan cooler bag-ku itu di gerbong khusus wanita,” tulis dia.</p>\n\n<p>Petugas KRL langsung menindaklanjuti laporan tersebut. Petugas itu meminta nomor telepon yang bisa dihubungi. Tak lama kemudian, petugas mengirimkan foto sebagai bukti bahwa cooler bag milik penumpang tersebut sudah ditemukan lengkap beserta isi.</p>\n\n<p>Penumpang tersebut mengambilnya tas tersebut di Stasiun Rangkasbitung keesokan harinya. Dia kaget ketika melihat tumbler yang berada di dalam tas tersebut hilang.</p>\n\n<p>&quot;Singkat cerita aku sudah terima cooler bag-ku. Dan… jeng-jeng, shock berat pas dibuka kok ada yang hilang! Tumbler Tuku-ku tidak ada,&quot; ujar dia.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Gempa 6,3 M Getarkan Simeulue Aceh: Sejumlah Bangunan Rusak, Ada 6 Gempa Susulan",
      "link": "/img/0mc6erepfs3g1.jpeg",
      "guid": "/img/0mc6erepfs3g1.jpeg",
      "pubDate": "Thu, 27 Nov 2025 11:49:31 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p80b2v/gempa_63_m_getarkan_simeulue_aceh_sejumlah/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://m.kumparan.com/kumparannews/gempa-6-3-m-getarkan-simeulue-aceh-sejumlah-bangunan-rusak-ada-6-gempa-susulan-26KA785xILC/1\">link</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Sumbar Diterjang Banjir Bandang, 3 Orang Tewas",
      "link": "",
      "guid": "",
      "pubDate": "Thu, 27 Nov 2025 08:08:08 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7wrm6/sumbar_diterjang_banjir_bandang_3_orang_tewas/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7wrm6/sumbar_diterjang_banjir_bandang_3_orang_tewas/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Ketagihan pengen nyopot gigi sendiri",
      "link": "https://redlib.perennialte.ch//r/indonesiabebas/comments/1p80xhw/ketagihan_pengen_nyopot_gigi_sendiri/",
      "guid": "https://redlib.perennialte.ch//r/indonesiabebas/comments/1p80xhw/ketagihan_pengen_nyopot_gigi_sendiri/",
      "pubDate": "Thu, 27 Nov 2025 12:24:29 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p80xhw/ketagihan_pengen_nyopot_gigi_sendiri/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Teman² aku punya pertanyaan, gigiku bagian geraham belakangan ini nyut²an. Ngidelah ambil tang kecil (steril) goyang²in gigi yang nyut²an, sakit sih tapi sakitnya enak.\nPertanyaannya ini kalo dicabut paksa bahaya kah? Soalnya udah keburu sakit enak kayak ngopein koreng asli dah dan pake obat apa biar ga infeksi setelah dicabut.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Banjir Aceh Meluas! Warga Terjebak Di Atap Rumah",
      "link": "",
      "guid": "",
      "pubDate": "Thu, 27 Nov 2025 02:40:32 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7qw19/banjir_aceh_meluas_warga_terjebak_di_atap_rumah/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7qw19/banjir_aceh_meluas_warga_terjebak_di_atap_rumah/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "wanita mana lagi yg harus ku percaya?",
      "link": "/img/buwekb8bbo3g1.jpeg",
      "guid": "/img/buwekb8bbo3g1.jpeg",
      "pubDate": "Wed, 26 Nov 2025 21:57:46 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7ksih/wanita_mana_lagi_yg_harus_ku_percaya/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7ksih/wanita_mana_lagi_yg_harus_ku_percaya/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Bocoran dari Pusat, Wapres Gibran Bakal Mulai Bekerja di IKN Pada 2026",
      "link": "/img/5f0snovufp3g1.jpeg",
      "guid": "/img/5f0snovufp3g1.jpeg",
      "pubDate": "Thu, 27 Nov 2025 01:45:02 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7pt08/bocoran_dari_pusat_wapres_gibran_bakal_mulai/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://kaltim.tribunnews.com/news/1127985/bocoran-dari-pusat-wapres-gibran-bakal-mulai-bekerja-di-ikn-pada-2026\">link</a></p>\n\n<p>Ayo sukseskan biar ga nguap gitu aja tuh pengeluaran negara</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Cloudflare dan Komdigi Lakukan Audiensi, Ini Hasilnya",
      "link": "/gallery/1p7pg0z",
      "guid": "/gallery/1p7pg0z",
      "pubDate": "Thu, 27 Nov 2025 01:26:32 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7pg0z/cloudflare_dan_komdigi_lakukan_audiensi_ini/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Cloudflare kooperatif! Audiensi dengan Komdigi hasilkan komitmen baru soal PSE dan moderasi konten.</p>\n\n<hr/>\n\n<p>KOMPAS.com - Kementerian Komunikasi dan Digital Republik Indonesia (Komdigi) melalui Direktorat Jenderal Pengawasan Ruang Digital melakukan audiensi dengan perusahaan infrastruktur web asal Amerika Serikat, Cloudflare. Audiensi dilakukan secara daring, Selasa (25/11/2025). Direktur Jenderal Pengawasan Ruang Digital, Alexander Sabar mengatakan bahwa pertemuan virtual ini menjadi langkah awal dialog konstruktif antara pemerintah dan Clouflare, terkait pemenuhan regulasi Penyelenggara Sistem Elektronik (PSE) Lingkup Privat Asing di Indonesia.</p>\n\n<p>“Pertemuan ini menunjukkan bahwa dialog tetap kami kedepankan untuk memastikan kepatuhan berjalan baik,” kata Alexander dalam keterangan resmi yang diterima KompasTekno, Rabu (26/11/2025).</p>\n\n<p>Dalam pertemuan ini, Cloudflare diwakili oleh Carly Ramsey, Head of Public Policy APAC, dan Smrithi Ramesh, Lead for Government Outreach APAC.</p>\n\n<p>Ada dua agenda utama yang dibahas. Pertama adalah pemenuhan kewajiban pendaftaran PSE Lingkup Privat dan kedua, adalah penguatan kerja sama moderasi konten. Alxander mengatakan bahwa Cloudflare berupaya melakukan itikad baik dengan mempelajari lebih lanjut reguasi pendaftaran PSE.</p>\n\n<p>Mereka juga siap menyediakan kanal pelaporan khusus bagi Komdigi untuk mendukung proses moderasi konten. Selain itu, Cloudflare juga menjelaskan keterbatasan peran mereka sebagai penyedia infrastruktur yang tidak melakukan kurasi konten secara langsung.</p>\n\n<p>Kemungkinan, hal tersebut berkaitan dengan temuan sebelumnya, di mana Komdigi mengeklaim bahwa banyak situs judi online menggunakan infrastruktur Cloudflare.</p>\n\n<p>Sebanyak 10.000 data sampling terhadap situs judol untuk periode 1–2 November 2025, ada 76 persen situs yang menggunakan layanan Cloudflare.</p>\n\n<p>Data tersebut mencakup penyamaran alamat IP demi mempercepat perpindahan domain untuk menghindari pemblokiran.</p>\n\n<p>Sebelumnya, Alexander mengatakan bahwa Cloudflare seharusnya bisa lebih selektif dalam memoderasi konten.</p>\n\n<p>Lewat audiensi, Komdigi pun memahami keterbatasan Cloudflare sebagai penyedia infrastruktur. Oleh karena itu, salah satu solusi yang ditawarkan adalah penyediaan kanal pelaporan sebagai bentuk dukungan konkrit.</p>\n\n<p>Alexander menegaskan bahwa audiensi ini tidak menggugurkan kewajiban Cloudflare untuk mematuhi regulasi PSE Lingkup Privat.</p>\n\n<p>“Kepatuhan terhadap kewajiban pendaftaran merupakan bagian penting dari upaya menjaga kedaulatan digital dan memastikan seluruh layanan yang beroperasi di Indonesia tunduk pada aturan yang sama,” kata Alexander.</p>\n\n<p><a href=\"https://tekno.kompas.com/read/2025/11/26/06570007/cloudflare-dan-komdigi-lakukan-audiensi-ini-hasilnya?page=all#page2\">https://tekno.kompas.com/read/2025/11/26/06570007/cloudflare-dan-komdigi-lakukan-audiensi-ini-hasilnya?page=all#page2</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Alasan Driver Ojol Makassar Tolak Jadi Karyawan Tetap dan Potongan 10 Persen",
      "link": "/img/46peoa1ngp3g1.jpeg",
      "guid": "/img/46peoa1ngp3g1.jpeg",
      "pubDate": "Thu, 27 Nov 2025 01:49:23 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7pw2h/alasan_driver_ojol_makassar_tolak_jadi_karyawan/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://makassar.tribunnews.com/makassar/1820442/alasan-driver-ojol-makassar-tolak-jadi-karyawan-tetap-dan-potongan-10-persen\">link</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Skandal \"Jeruk Makan Jeruk\" Polda Sumut: Modus Kabid Propam Diduga Peras Polisi hingga Rp1 Miliar",
      "link": "/img/o4edzkblep3g1.jpeg",
      "guid": "/img/o4edzkblep3g1.jpeg",
      "pubDate": "Thu, 27 Nov 2025 01:37:56 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7po3t/skandal_jeruk_makan_jeruk_polda_sumut_modus_kabid/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://jateng.tribunnews.com/news/1233707/skandal-jeruk-makan-jeruk-polda-sumut-modus-kabid-propam-diduga-peras-polisi-hingga-rp1-miliar\">link</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Momen langka! Di tengah perjalanan menuju Pacitan, Pak SBY spontan berhenti di warung degan di Desa Guwotirto, Wonogiri dan langsung melukis on the spot",
      "link": "",
      "guid": "",
      "pubDate": "Wed, 26 Nov 2025 09:34:21 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p73j1e/momen_langka_di_tengah_perjalanan_menuju_pacitan/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://m.facebook.com/story.php?story_fbid=1166438532261936&amp;id=100066874009594\">https://m.facebook.com/story.php?story_fbid=1166438532261936&amp;id=100066874009594</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Gawat, Tanggul Pantai Mutiara Rembes",
      "link": "/img/j6536pfhdp3g1.jpeg",
      "guid": "/img/j6536pfhdp3g1.jpeg",
      "pubDate": "Thu, 27 Nov 2025 01:31:43 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7pjoh/gawat_tanggul_pantai_mutiara_rembes/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7pjoh/gawat_tanggul_pantai_mutiara_rembes/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "[Discussion] BIN (Intelligence services) Di perusahaan lokal?",
      "link": "https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7igeh/discussion_bin_intelligence_services_di/",
      "guid": "https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7igeh/discussion_bin_intelligence_services_di/",
      "pubDate": "Wed, 26 Nov 2025 20:24:37 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p7igeh/discussion_bin_intelligence_services_di/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone....this is just a random thought in my head that i need answers for</p>\n\n<p>Just for context, my dad owns a large company that deals with mainly japanese automatives based in jakarta that deals with the whole country</p>\n\n<p>I found out something was wrong when my dad refused my close friend an internship at his company. He told her that someone in the company was leaking confidential company secrets. He told my friend that the person leaking it was a bunch of interns from local universities...he mentioned UI, Udayana, ITB. She relayed this information to me which quite stunned me.</p>\n\n<p>So i pressed my dad for more answers, he said that the leaks included company tax returns, shipping routes, fleet size (company mobile carriers &amp; tankers), Company personnel, and for some reason their salaries. </p>\n\n<p>The red flags started to pop up when the chinese manufacturers started coming in to indonesia and undermined my dad&#39;s company in terms of shipping and routes. Some of the employees even started to move to those said companies. After the company started investigating they found out about the leaks and who kept leaking them. Because of this my dad&#39;s company and it&#39;s immediate subsidiaries + close friends of the company started banning interns from all universities (except if they&#39;re close family members and their relatives)</p>\n\n<p>My question is that is BIN or other agencies are involved?</p>\n\n<p>Have they done something similar to this?</p>\n\n<p>This looks too coordinated to be a coincidence </p>\n\n<p>My thought was that someone from those local universities contacted the interns to give them confidential information regarding the company. But i have no proof :(</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Komdigi siapkan aturan baru, pemilik HP wajib rekam wajah",
      "link": "/img/mycux03xll3g1.jpeg",
      "guid": "/img/mycux03xll3g1.jpeg",
      "pubDate": "Wed, 26 Nov 2025 12:52:05 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesiabebas/comments/1p76yct/komdigi_siapkan_aturan_baru_pemilik_hp_wajib/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Kementerian Komunikasi dan Digital (Komdigi) tengah menyiapkan aturan baru yang akan mewajibkan pelanggan seluler melakukan registrasi menggunakan data kependudukan biometrik pengenalan wajah (face recognition).</p>\n\n<p>Sebelumnya, proses registrasi pelanggan jasa telekomunikasi hanya menggunakan Nomor Induk Kependudukan (NIK)dan nomor Kartu Keluarga (KK). Namun, mekanisme tersebut dinilai masih membuka peluang penyalahgunaan identitas milik orang lain untuk berbagai tindakan kejahatan seperti penyebaran hoaks, judi online, SMS spam, dan penipuan.</p>\n\n<p>&quot;Sehingga perlu dilakukan penyempurnaan terhadap ketentuan registrasi pelanggan jasa telekomunikasi agar mampu memastikan validitas data pelanggan jasa telekomunikasi dilakukan secara aman, efektif, dan efisien,&quot; ujar Komdigi dalam pernyataan tertulisnya.</p>\n\n<p>Komdigi menjelaskan bahwa sesuai Pasal 153 ayat (2) PM 5/2021, penyelenggara jasa telekomunikasi wajib menerapkan prinsip mengenal pelanggan (Know Your Customer/KYC). Prinsip ini dapat dilakukan melalui registrasi menggunakan data kependudukan biometrik pengenalan wajah (face recognition). Namun, aturan teknis mengenai penggunaan biometrik tersebut belum diatur dalam PM 5/2021.</p>\n\n<p>&quot;Berdasarkan pertimbangan tersebut di atas, perlu adanya Peraturan Menteri yang mengatur ketentuan teknis registrasi pelanggan jasa telekomunikasi menggunakan data kependudukan biometrik pengenalan wajah (face recognition) untuk meningkatkan validitas data pelanggan guna memperkuat keamanan digital secara nasional melalui Peraturan Menteri tentang Registrasi Pelanggan Jasa Telekomunikasi Melalui Jaringan Bergerak Seluler (RPM Registrasi Pelanggan),&quot; tambah Komdigi.</p>\n\n<p>Rancangan Peraturan Menteri (RPM) Registrasi Pelanggan ini merupakan bagian dari Program Kerja Kementerian Komunikasi dan Digital Tahun Anggaran 2025.</p>\n\n<p>Beberapa poin material baru yang akan diatur dalam RPM tersebut, antara lain:</p>\n\n<blockquote>\n<ol>\n<li>Kewajiban registrasi bagi calon pelanggan WNI, meliputi:</li>\n</ol>\n\n<p>Nomor MSISDN atau nomor Pelanggan Jasa Telekomunikasi;</p>\n\n<p>Data kependudukan berupa NIK;</p>\n\n<p>Data kependudukan biometrik berupa teknologi pengenalan wajah (face recognition).</p>\n\n<ol>\n<li>Ketentuan khusus bagi calon pelanggan berusia di bawah 17 tahun dan belum menikah, yang belum memiliki KTP elektronik maupun data biometrik. Registrasi wajib menggunakan:</li>\n</ol>\n\n<p>Nomor MSISDN yang digunakan;</p>\n\n<p>NIK calon pelanggan;</p>\n\n<p>NIK dan data biometrik kepala keluarga sesuai data pada Kartu Keluarga.</p>\n\n<ol>\n<li>Kewajiban registrasi untuk pelanggan eSIM, yaitu menggunakan:</li>\n</ol>\n\n<p>Nomor MSISDN atau nomor pelanggan;</p>\n\n<p>NIK dan data biometrik pengenalan wajah (face recognition).</p>\n</blockquote>\n\n<p>Komdigi mengatakan beberapa hal pokok yang diatur dalam RPM Registrasi Pelanggan mencakup Registrasi pelanggan jasa telekomunikasi, baik prabayar maupun pascabayar, Keamanan data pelanggan, Perlindungan nomor pelanggan, Pengawasan dan pengendalian, dan Ketentuan peralihan.</p>\n\n<p>Adapun, penerapan aturan ini akan dilakukan secara bertahap selama satu tahun sejak Peraturan Menteri diundangkan, registrasi masih dapat menggunakan NIK dan No. KK, sementara biometrik face recognition bersifat opsional. Tahap ini bertujuan memberikan ruang sosialisasi serta memastikan kesiapan penyelenggara telekomunikasi.</p>\n\n<p>Setelah masa satu tahun berakhir, registrasi hanya dapat dilakukan menggunakan NIK dan biometrik face recognition.</p>\n\n<p>Komdigi menyebutkan bahwa ketentuan penggunaan biometrik ini hanya berlaku bagi pelanggan baru. Pelanggan eksisting yang telah teregistrasi menggunakan NIK dan No. KK tidak diwajibkan melakukan registrasi ulang (opsional).</p>\n\n<p>Selengkapnya di detikinet</p>\n\n<p>inet detik com/law-and-policy/d-8226062/komdigi-siapkan-aturan-baru-pemilik-hp-wajib-rekam-wajah </p>\n\n<p><a href=\"https://m.facebook.com/story.php?story_fbid=1396427731831445&amp;id=100043926949275\">https://m.facebook.com/story.php?story_fbid=1396427731831445&amp;id=100043926949275</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    }
  ],
  "group": "country",
  "url": "https://redlib.perennialte.ch/r/indonesiabebas.rss",
  "lastFetched": "2025-11-28T04:45:14.004Z"
}