{
  "title": "Perempuan",
  "description": "Welcome to r/Perempuan, a community for Indonesian Female Empowerment!\nPlease use user flair before commenting.",
  "link": "",
  "items": [
    {
      "title": "Weekly Chat Thread (WCT)",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p4rs35/weekly_chat_thread_wct/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p4rs35/weekly_chat_thread_wct/",
      "pubDate": "Sun, 23 Nov 2025 17:00:31 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p4rs35/weekly_chat_thread_wct/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p4rs35/weekly_chat_thread_wct/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Need older puans to discuss",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p65ap9/need_older_puans_to_discuss/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p65ap9/need_older_puans_to_discuss/",
      "pubDate": "Tue, 25 Nov 2025 06:26:42 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p65ap9/need_older_puans_to_discuss/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Halo puans... sesuai judul, i (f25) need older puans to discuss about masturbation and sexual stuff huhu. Thanks ij advance yaa</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Fine line tattoo artist Jakarta",
      "link": "/img/629eyukoea3g1.png",
      "guid": "/img/629eyukoea3g1.png",
      "pubDate": "Mon, 24 Nov 2025 23:11:41 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p5wdqo/fine_line_tattoo_artist_jakarta/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi puans, aku kepikiran untuk bikin tato fine lines di Jakarta. Apakah ada yang punya rekomendasi atau mungkin sekedar pernah dengar atau liat akun2 yang style fine line di instagram? Bonus kalau ada yang pernah pengalaman pribadi dan bisa info harga juga hehe.Terima kasih!!</p>\n\n<p>**Contoh style yg aku suka kaya di foto inii.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Pelvic floor therapy?",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p5m9kf/pelvic_floor_therapy/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p5m9kf/pelvic_floor_therapy/",
      "pubDate": "Mon, 24 Nov 2025 16:52:47 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p5m9kf/pelvic_floor_therapy/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Puans, it looks like I’m struggling w vaginismus (massive sigh). I’m seeing a gyno but I’m wondering if there’s a pelvic floor therapist di area Jkt and sekitarnya? I’m interested to tackle this issue holistically (medis + exercise) 😩🙏🏻 thanks puanssss </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Bagusnya bersikap kaya apa di situasi kaya gini?",
      "link": "/img/u1v6tjlsx43g1.jpeg",
      "guid": "/img/u1v6tjlsx43g1.jpeg",
      "pubDate": "Mon, 24 Nov 2025 04:48:14 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p581ix/bagusnya_bersikap_kaya_apa_di_situasi_kaya_gini/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Mungkin tergantung settings juga ya, kalo di professional settings gw cuma bisa poker face. Kalo di social settings gw paling cuma masang muka gaenak dan gak lanjut berkontribusi di obrolan :/</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Puan yang into kegiatan outdoor/hiking, beli gear dimana?",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p5411d/puan_yang_into_kegiatan_outdoorhiking_beli_gear/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p5411d/puan_yang_into_kegiatan_outdoorhiking_beli_gear/",
      "pubDate": "Mon, 24 Nov 2025 01:30:20 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p5411d/puan_yang_into_kegiatan_outdoorhiking_beli_gear/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hiii, aku sedang into hiking dan mau mencoba long day hike (yang lebih dari dua hari) ke beberapa gunung di Indonesia. Tapiii, aku baru sadar aku belum punya gear yang cukup memadai. Permasalahanku ada dua:</p>\n\n<ol>\n<li>Budget. Kalau beli satu masih nggak kerasa, tapi beli banyak langsung berasa banget. Aku akan sangat berterima kasih kalau ada yang bisa nyaranin tempat thrift online atau merk yang affordable. </li>\n<li>Size. Kalau kalian sadar, kebanyakan produk outdoor itu masih mengikuti standar ukuran laki-laki. Terakhir aku beli sepatu paling kecil ukuran 38, tapi masih kegedean banget dan harus pakai dua kaos kaki serta sol tambahan biar nyaman.</li>\n</ol>\n\n<p>Karena dua permasalahan itu, aku cuma punya sedikit gear yang proper. Ada yang size-nya pas, tapi mahal, giliran murah, size-nya nggak pas di aku.</p>\n\n<p>Itu aja, terima kasih semuanya:)</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Curhat",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p4kqcs/curhat/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p4kqcs/curhat/",
      "pubDate": "Sun, 23 Nov 2025 11:43:26 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p4kqcs/curhat/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hai, aku mau cerita. Bulan Oktober akhir lalu aku kontrol ke psikiater. Sambil nunggu obat di farmasi, aku duduk di samping bapak2. Nah si bapak ini nanya ke aku, &quot;Anda dari dokter mana?&quot;\nAku jawab, &quot;Dari dokter psikiater?&quot;\n&quot;Psikiater itu apa?&quot; Bapak itu gak tahu psikiater.\n&quot;Itu dokter jiwa, pak.&quot;\n&quot;Memang kamu sakit apa?&quot; Tanya bapak itu.\n&quot;Saya bipolar.&quot;\n&quot;Bipolar itu apa?&quot; Bapak itu tanya lagi.\n&quot;Bipolar itu gangguan mood. Kadang suasana hati bagus dan buruk.&quot;\nEh si bapak ini bilang, &quot;Sholat tahajud dan berdoa.&quot; Aku syok bgt aku jawab &quot;oh gitu&quot; ke bapak itu. Entah kenapa ya setiap orang punya masalah mental selalu aja kurang dekat sama Tuhan lah imannya lemah lah. Padahal aku selalu berdoa tetap aja mental aku down. Bahkan ortu ku juga jawabannya persis kayak bapak itu. Kalian ada yang sama? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Am I overreacting? gift for making connection!",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p4tf7f/am_i_overreacting_gift_for_making_connection/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p4tf7f/am_i_overreacting_gift_for_making_connection/",
      "pubDate": "Sun, 23 Nov 2025 18:04:20 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p4tf7f/am_i_overreacting_gift_for_making_connection/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hello fellas, I&#39;m planning to make a small gesture of giving small gift - congratulations card to several friends. It&#39;s not pricy but I think it&#39;s appropriate and cutesy, so~ do you think it&#39;s fine for me to come at their final thesis seminar (at my campus it&#39;s open for public) or post - graduation?</p>\n\n<p>I have this intention to get connected and have better luck on my &#39;relasi&#39;? some of them have business, good careers, and future potential as I&#39;ve seen their progress in this damn college era? I think most of them know me through our family but I don&#39;t think we get along well, but I feel like I&#39;m gonna have to work even make some contracts with them on professional matters one day (don&#39;t want to risk my future if there&#39;s any rumors). Guess I don&#39;t want to miss this opportunity? </p>\n\n<p>Honestly I feel like being opportunistic, I&#39;m not feeling well about my intention but I also feel wanting to appreciate those who catch my interest. I&#39;m sure my parents would love this idea, I don&#39;t mind investing my money by giving small gestures juga sih. Am I overreacting?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Saran Outfit",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p4dfa9/saran_outfit/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p4dfa9/saran_outfit/",
      "pubDate": "Sun, 23 Nov 2025 04:22:59 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p4dfa9/saran_outfit/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hii, I want to ask for some advice. If you have a skinny body (I&#39;m underweight ☹), what kind of clothes would look good? Is wearing a sleeveless top a bad choice? And if you know any online stores that are skinny-friendly, please let me know!! Thank you.</p>\n\n<p>P.S. I’m going to an outdoor concert soon, so if you have any outfit suggestions, feel free to share 🤗</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "(TW: SA) My Boyfriend is making me realize how much in deep mess I was",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p39icf/tw_sa_my_boyfriend_is_making_me_realize_how_much/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p39icf/tw_sa_my_boyfriend_is_making_me_realize_how_much/",
      "pubDate": "Fri, 21 Nov 2025 20:32:48 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p39icf/tw_sa_my_boyfriend_is_making_me_realize_how_much/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been with my current boyfriend for almost a year now. He’s a very kind, loving, and respectful gentleman. He’s a yearner… he has a gentle smile and touch, never raises his voice at me, adores me, and sees me as the only person he graciously loves. He communicates well and understands whenever I assert my needs and wants. He respects my boundaries and never crosses them.</p>\n\n<p>I’ve always had a tendency to repress my emotions—my parents used to scold me for crying. That shaped the way I deal with my emotions even now.</p>\n\n<p>Never in my life did I expect that the tenderness my boyfriend shows would remind me of how deeply I had been wronged in the past. Sometimes, in the middle of the day, the chest pain appears, and I suddenly realize I’m crying.</p>\n\n<p>Before him, I was in a relationship with someone who made me incredibly sad whenever I remember everything I tolerated. He guilt-tripped me into having sex with him or sending him nudes just so he would give me love even after I told him that my previous partner had already made me feel like nothing more than a body to be lusted after. Those are besides episodes of emotional abuses too.</p>\n\n<p>He was my friend, he should’ve been my friend before he was a lover, someone I thought I could be vulnerable with.</p>\n\n<p>I felt betrayed…</p>\n\n<p>There are so many things I feel I was wronged for when I was with him. It destroys me that whenever I consciously try to bring everything to the surface and confront it at once, nothing comes up. It only appears little by little, and each time it does, I’m shaken all over again.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Tips di salon mahal?",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p3kipi/tips_di_salon_mahal/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p3kipi/tips_di_salon_mahal/",
      "pubDate": "Sat, 22 Nov 2025 04:50:01 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p3kipi/tips_di_salon_mahal/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Gaisss nanya dong, biasanya aku ke salon2 biasa kan ngasih tips ya.\nKalo misal kita ke Irwan atau Ando n Yun yg ada foreignernya, itu ttp kita kasih tips ga?</p>\n\n<p>Terus biasanya yg nyuci sama yang potong atau color kan beda org, kita kasih yg main stylist nya aja satu atau tiga tiganya?</p>\n\n<p>Terus nominalnya ada rulesnya ga? Misal berapa persen dr harga?\nMakasih gaiss </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Mau tanya buat assessment ADHD atau mental illness in general secara Online.",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p3lml7/mau_tanya_buat_assessment_adhd_atau_mental/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p3lml7/mau_tanya_buat_assessment_adhd_atau_mental/",
      "pubDate": "Sat, 22 Nov 2025 05:51:41 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p3lml7/mau_tanya_buat_assessment_adhd_atau_mental/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi F 30 here, sesuai judul, ada yang pernah pengalaman assessment ADHD atau mental illness in general, bisa sharing pengalaman dan informasi terutama yang bisa assesment online? Saya pernah lihat di iklan di IG ada assesment ADHD sejuta, apakah itu harga normal? dan Assesment adhd dan mental illness apakah berbeda?</p>\n\n<p>Terima kasih banyak, have a good day.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Get to know what facial wash should I consider?🥂",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p33ju5/get_to_know_what_facial_wash_should_i_consider/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p33ju5/get_to_know_what_facial_wash_should_i_consider/",
      "pubDate": "Fri, 21 Nov 2025 16:44:06 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p33ju5/get_to_know_what_facial_wash_should_i_consider/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Malam puan! Sesuai judul, baru-baru ini ingin beralih dan coba cari facial wash if it&#39;s possible yang ada travel size-nya. So far I&#39;ve been using so many products [skin type: dry skin]</p>\n\n<ol>\n<li>Skin 1004 Pink 🩷 \nBagus, but not really work with my skin texture </li>\n<li>Nature E Biru\nBagusss sayangnya kering dikit di wajah, BUT after a day of physical activity - when my face kinda oily this one works so well</li>\n<li>Scor@\nWorst 😭 mine got breakout after seminggu coba + make my skin looks dull; if someone based on Jogja dan cocok pls PM, gonna send to u for free</li>\n<li>Garnier vit c\nKering, not so happy with the results, gampang kusam.. </li>\n</ol>\n\n<p>Do you have any experience with hada labo, cosrx, and others products as well? Please kindly drop your review :( I got trust issues searching on female daily website and sooo many beauty influencer today</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Pengalaman operasi Lasik",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p2wycj/pengalaman_operasi_lasik/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p2wycj/pengalaman_operasi_lasik/",
      "pubDate": "Fri, 21 Nov 2025 12:09:10 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p2wycj/pengalaman_operasi_lasik/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Girls, mau nanya”. Disini ada yg pernah operasi Lasik ReLex Smile Pro di JEC Kedoya?? Kalau pernah, boleh spill minus dan silinder sebelum operasi berapa dan apakah setelah operasi, minus dan silinder nya bener” ga ada lagi? Dan utk sebelum operasi, dokter nya ada nanya” soal minus dan silinder setahun sebelumnya? Apakah kita wajib cek dulu tepat setahun sebelum kita mau operasi?</p>\n\n<p>Soalnya aku terakhir cek awal tahun 2024 dan pertengahan 2023, minus dan silinder ku uda terhitung stabil menurut dokter waktu itu walau ada beda sedikit, beda minus nya -0.5 (mata kiri ku berkurang minusnya dari -6.0 jadi -5.5 dan mata kanan ku bertambah minus nya dari -5 jadi -5.5). Dan aku jg rencana mau operasi nya di awal tahun depan, apakah bisa or lebih baik aku tunda sampai akhir tahun depan aja setelah aku cek mata ku lagi akhir tahun ini? Dan juga soalnya aku asalnya dari luar jawa, jadi aku harus nge-plan kapan mau ngelakuin operasi nya bener”. Thanks in advance.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Need support",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p2m0lt/need_support/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p2m0lt/need_support/",
      "pubDate": "Fri, 21 Nov 2025 01:55:09 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p2m0lt/need_support/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I’m 8 weeks pregnant (first time) and I feel sick ALL. THE. TIME. I’m not throwing up much, but I’m never not nauseated. I hate it 😭 Like, I’m happy to be pregnant and excited to be a mom but I’m so tired of feeling like this. I can’t leave the house or go anywhere or do anything because I just feel horrible. There’s also the exhaustion, dizziness, and constant bloating. </p>\n\n<p>Its also stressing me out so much because I know I need to eat well, real food for my baby. But even the smell of rice is GAGGING me so much. I’m so hungry, my body constantly asking for food but the moment I saw/smell the food, my body rejected it. </p>\n\n<p>I tried to tell myself that all every other mom in this world going through the same thing and maybe I’m just too whiny. But I feel very down and useless right now. I just want to rant/vent a bit to people who will understand.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Therapist specializing in phobia?",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p2meac/therapist_specializing_in_phobia/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p2meac/therapist_specializing_in_phobia/",
      "pubDate": "Fri, 21 Nov 2025 02:12:37 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p2meac/therapist_specializing_in_phobia/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Halo puans, saya sedang sangat struggling karna phobia yg saya miliki. Sudah 25 tahun lamanya saya mengalami phobia ini dan saat ini kehidupan sehari2 saya sudah sangat affected dan mungkin kedepannya hidup saya akan rusak karna ini.</p>\n\n<p>Adakah yg punya rekomendasi therapist atau psychologist yg paham dan memang bisa menangani kasus phobia? </p>\n\n<p>Saya ingin recover dan menjadi seperti orang normal lainnya, tapi belum menemukan therapist yg cocok.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Scare of taking postinor",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p2l2bi/scare_of_taking_postinor/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p2l2bi/scare_of_taking_postinor/",
      "pubDate": "Fri, 21 Nov 2025 01:10:51 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p2l2bi/scare_of_taking_postinor/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi puans\nSo I was having unprotected sex with my GF\nWe did it 3 session and I always pull out and ejaculate outside.\nBut we were anxious because its seems like we do intercourse on her fertile window.</p>\n\n<p>She is always have a regular cycle and her predicted period is usually came by 28th - 2nd</p>\n\n<p>Now we were planning to take postinor just to make sure its safe but i just taught that postinor only work if she haven&#39;t ovulated yet.\nMy GF is usually STOP having cervics muccus by 21st (today) and I assume that&#39;s a sign of ovulation already end?\nAnd we also scared with the side effect of the pill.</p>\n\n<p>TLDR : unprotected sex, should we take postinor even tho I THINK her ovulation is over?\nAnd how scary is the side effect? I really worried for her to take the postinor. I don&#39;t want her to take it if she doesn&#39;t need to.</p>\n\n<p>Let me know what you think of our situation!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Pengalaman dilamar",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p2d6o3/pengalaman_dilamar/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p2d6o3/pengalaman_dilamar/",
      "pubDate": "Thu, 20 Nov 2025 19:53:11 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p2d6o3/pengalaman_dilamar/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hai puan</p>\n\n<p>Aku cuma penasaran sebagai seorang pria. Kalian pernah dapat lamaran dari cowok? Kalau pernah boleh ceritakan pengalamannya gak. Gimana perasaan kalian waktu itu? Pernah dapat lamaran dari laki-laki yang kalian kurang minat? Atau mungkin kalian minat tapi malah kalian tolak?</p>\n\n<p>Sama, kalau kalian mau terima atau tolak itu apa yang kalian pertimbangkan?</p>\n\n<p>Kalau kalian belum pernah, apakah pernah berharap untuk dapat lamaran?</p>\n\n<p>Feel free to pur your thoughts ya penasaran mau dapat persepektif dari para puan</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Usg",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p1urze/usg/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p1urze/usg/",
      "pubDate": "Thu, 20 Nov 2025 05:14:24 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p1urze/usg/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Haloo, adakah rekomendasi klinik untuk usg kehamilan yg nakesnya ga judgy? Aku (F23) unmarried, mau usg. Lokasi jogja. Terimakasih </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Teman mandi",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p1wlkv/teman_mandi/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p1wlkv/teman_mandi/",
      "pubDate": "Thu, 20 Nov 2025 07:01:20 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p1wlkv/teman_mandi/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>click bait(?) title lol maaf jadi gini, aku bosen mandi pakai shower puff/loofah. sempet liat ada yg jual alat dua sisi satu sikat satu shower puff tapi kayak takut sikat terlalu kasar (kulit aku badak sih tp) dan sisi satunya tetep puff jadi agak males.</p>\n\n<p>aku mau tanya teman-teman sekalian apakah ada rekomendasi atau pengalaman pakai alat lain untuk eksfoliasi/gosok2 badan? kayak yang bentuk glove, silicon, etc. </p>\n\n<p>one additional question, kalo luluran itu gosoknya cukup pake tangan aja ya gausah pakai alat? atau?</p>\n\n<p>thank you in advance bagi yang berkenan sharing 🙏</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Recommended dentist for scalling",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p1rzjd/recommended_dentist_for_scalling/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p1rzjd/recommended_dentist_for_scalling/",
      "pubDate": "Thu, 20 Nov 2025 02:53:06 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p1rzjd/recommended_dentist_for_scalling/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi fellass, gw rencananya mau scalling. Seumur-umur belum pernah discalling. Antara fdc dan sozo ok yg mana ya dentistnya? Perefer di klinik ada di area Cibubur. Budget max 200rb. Gw liat dua klinik tersebut lg byk promo. Semoga bisa sharing² disini ataupun kalau ada rekomendasi tempat yg lain. Thank you.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "(probably) final attempt, bingung bibirnya pake apaaa",
      "link": "/img/zyb16d16y72g1.png",
      "guid": "/img/zyb16d16y72g1.png",
      "pubDate": "Wed, 19 Nov 2025 13:51:28 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p187un/probably_final_attempt_bingung_bibirnya_pake_apaaa/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Wow tidak terasa udah mau wisuda dan udah memasuki final attempt(s) (krn hasilnya udah konsisten dan udah lengkap produknya)...</p>\n\n<p>Tapi masih bingung lip nya pake apa yah... Ini hasil racikan liquid blush + lip tint 😂 dan aku ngerasa kayak monoton bgt krn dr mata, pipi, dan bibir sama?? </p>\n\n<p>Any inputs are welcome! Especially regarding the lipsss! Pengen yg glossy, tp kalopun rekomen shadenya ada di produk matte gpp jg sih, bisa pake lipgloss aja...?</p>\n\n<p>Makasiiii puansss!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Who should I listen more? Partner or friends?",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p1055r/who_should_i_listen_more_partner_or_friends/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p1055r/who_should_i_listen_more_partner_or_friends/",
      "pubDate": "Wed, 19 Nov 2025 06:25:34 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p1055r/who_should_i_listen_more_partner_or_friends/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>My parents divorced when I was 15 and they have a cold relationship ever since then. My dad would blame my mom for listening to her friends, ngeyel &amp; stuff, but in my mom&#39;s defense, my dad was abusive (ngomong kasar, suka misuh, gabisa diajak diskusi), but my mom cheated on him when my dad was working hard for the family.</p>\n\n<p>I&#39;m confused, who should I listen more now? I have a partner now,  he&#39;s pretty much like my dad, but it&#39;s also me who&#39;s stubborn and I treated him poorly (looking down on him just because he isn&#39;t graduated yet  &amp; etc). My friends are telling me to leave him, and my partner don&#39;t like my friends, I&#39;m confused :(</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How do I deal with relatives who might livestream or post my mixed-race baby without consent when I go back home?",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p0qwr4/how_do_i_deal_with_relatives_who_might_livestream/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p0qwr4/how_do_i_deal_with_relatives_who_might_livestream/",
      "pubDate": "Tue, 18 Nov 2025 23:01:25 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p0qwr4/how_do_i_deal_with_relatives_who_might_livestream/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone, I really need some advice.</p>\n\n<p>I’ll be going back to Indonesia soon with my husband and our baby. I come from a place where family gatherings and “welcoming the child/grandchild” ceremonies are very normal whenever someone comes home. I’m totally okay with the tradition itself, it’s part of my culture and I respect that.</p>\n\n<p>But my concern is about privacy, especially with how common it is nowadays for people to livestream or post everything on social media without thinking. One of the reasons I’m really worried is because I’ve seen people in my community do online streaming even at funerals. So I know that many of them simply don’t have boundaries when it comes to cameras and social media.</p>\n\n<p>Another recent event confirmed my worries: someone in the town married a “bule,” and during his stay, people kept taking pictures of him even when he was just casually walking on the street. Many were posting his face on their social media with captions like “There’s a bule in town!” just to not miss out (FOMO). Seeing how people react to anyone who looks “different” makes me even more anxious about how they might treat my child.</p>\n\n<p>My husband and I have a strict rule: we never post our child’s photos or videos on social media. Ever. Only in the private family group chat. Our child is mixed race, and I’m honestly worried that people will see them as “interesting/exotic” and feel entitled to take photos or videos.</p>\n\n<p>I’ve already told my mom about this concern, but she brushed it off and said it’s “not a big deal” if relatives or neighbors take pictures of her grandchild and upload them. For her, it’s normal and harmless. For us, it’s a huge boundary.</p>\n\n<p>I’m stressed because:</p>\n\n<p>• ⁠I can’t control the crowd during family events.\n• ⁠I don’t want to cause drama, but I also don’t want my child’s face online.\n• ⁠I worry that saying “please don’t record” will make me look rude or “too Westernized.”\n• ⁠And I’m scared someone will livestream the event without asking.</p>\n\n<p>Has anyone dealt with this before? How do I set boundaries in a culture where people often don’t see this as a problem? Should I be firm, or will that just create family tension? Any scripts or strategies would be really helpful.</p>\n\n<p>Thanks in advance.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Sexual Harrasment",
      "link": "https://redlib.perennialte.ch//r/Perempuan/comments/1p06f4l/sexual_harrasment/",
      "guid": "https://redlib.perennialte.ch//r/Perempuan/comments/1p06f4l/sexual_harrasment/",
      "pubDate": "Tue, 18 Nov 2025 08:14:18 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/Perempuan/comments/1p06f4l/sexual_harrasment/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Girls, aku mau cerita. Tadi aku main apk litmatch terus ada status cewek begini &quot;Cowok jangan mesum komennya.&quot; inti dari statusnya kalo dia merasa risih dengan cowok2 di litmatch mesum. Eh ada salah satu komen cewek umur 21 gini, &quot;Salah sendiri cewek gak nutup aurat makanya kena pelecehan.&quot; What the hell this is comment that I made angry. Sexual harassment doesn&#39;t regardless clothes. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    }
  ],
  "group": "country",
  "url": "https://redlib.perennialte.ch/r/Perempuan.rss",
  "lastFetched": "2025-11-25T07:34:57.398Z"
}