{
  "title": "Ask Us Anything about Singapore",
  "description": "A place for all your Singapore related questions.",
  "link": "",
  "items": [
    {
      "title": "What am I missing from Singapore? Why is it not an amazing place to consider living?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbwk9j/what_am_i_missing_from_singapore_why_is_it_not_an/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbwk9j/what_am_i_missing_from_singapore_why_is_it_not_an/",
      "pubDate": "Tue, 2 Dec 2025 02:28:13 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbwk9j/what_am_i_missing_from_singapore_why_is_it_not_an/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I visited Singapore recently and really impressed intentional the city feels in its design. I’m not assuming it is perfect, so I’m really curious what locals and long-term expats think I might be missing.</p>\n\n<p><strong>TL;DR</strong> With the (mostly sunny) weather, the affordable hawker stall food, the safety, the efficiency and the urban planning, Singapore feels like an amazing place to live. What downsides or realities am I not seeing? I&#39;m assuming it&#39;s a mix of humidity, high cost of living and size of the country. </p>\n\n<p><strong>1. Transit and rush hour</strong>\nI expected the kind of packed &amp; overwhelming rush hours you see in Tokyo or parts of China given the density and size of the city. Instead, everything felt calm and manageable... From what I understand, offices are spread across the country rather than concentrated in one downtown core. This seems to reduce the pressure on any single area and creates more balanced, bi-directional commuting. Since everything is about 30 minutes away, commuting felt surprisingly stress-free.</p>\n\n<p><strong>2. Cars</strong>\nCars seem intentionally positioned as a luxury. The licensing system means paying around ~$100K for a license just for the right to own a car, and something like a Toyota Corolla can cost $150K+. This results in fewer cars on the road, smoother traffic, and safer driving conditions. I relied on public transit and Grab, which felt cheap and convenient. It makes sense to me, even if it looks extreme at first glance.</p>\n\n<p><strong>3. Punishment and surveillance</strong>\nFrom a Western perspective, Singapore’s punishments (like caning) and strict laws seem harsh. But as a &quot;regular&quot; person who does not plan on breaking the law, I didn’t feel personally affected. What I did notice was a complete feeling of safety as I never saw police, guns, or conflict. I saw cameras and well-lit public spaces. It felt like a place where crime is genuinely deterred, in part because of canings. </p>\n\n<p><strong>4. Housing and religion</strong>\nI was struck by the themes of respect and balance and I know these are a strange thing to pair together. Housing-wise, I think ~80% of the population live in public housing where the gov&#39;t assigns housing based on the country’s demographic mix which prevents the formation of super ethnic neighborhoods. In the west, it&#39;s super common to see neighborhoods that are predominantly one ethnic group, which this seems to &#39;solve&#39;. While I don&#39;t think it&#39;s a problem per se, my guess is that it helps reduce racial tensions and ensures kids grow up side by side with other groups. Religiously, I also walked past a street with a church, mosque, and temple all next to each other in Chinatown. The idea of peaceful coexistence of religions felt very intentional and I found that really thoughtful.</p>\n\n<p><strong>5. Safety and homelessness</strong>\nI didn&#39;t see any homeless people during my visit. I did see migrant workers and people doing physically demanding jobs, but no one who appeared unhoused. Compared to many US/Canadian cities that struggle with homelessness, drug issues, and unsafe public spaces (SF, LA, NYC, Toronto etc.), Singapore felt incredibly safe. I’m not sure how homelessness is addressed behind the scenes though. Are people rehoused, supported, relocated, or managed in some other way?</p>\n\n<p><strong>6. Mandatory military service</strong>\nMandatory military service seems intense from a Western standpoint, where military service is usually a last resort for people with fewer options (this is my personal opinion lol). In Singapore, it seems like a rite of passage for men - it builds fitness, discipline, brotherhood, and leadership skills (specifically the brotherhood one sticks out to me because of the loneliness epidemic, this is also coming from someone without many friends that wants stronger male role models and brothers in my life). Since the country is small, some training even happens abroad I think, which seems like a pretty unique experience.</p>\n\n<p><strong>7. Politics</strong>\nFrom the outside, having one dominant political party appears to create stability and allow for long-term planning. I think there&#39;s debate to be had here on whether that&#39;s good or not since China and North Korea have a single party system. I&#39;d say in US/Canada, we pride ourselves on having democracy and ability to vote... but, in practice, as of late, it really just feels we have two parties to choose from and that has its own problems. Leadership changes every four years and major projects often stall or get reversed, I can&#39;t imagine a public/private company having leadership changes that frequently and being able to make any meaningful progress. Singapore’s consistency looks like a big part of why the city functions so well.</p>\n\n<p>Overall, with the weather, food, safety, and sense of order, Singapore feels extremely livable to me. But as a visitor, I know there are things I probably missed or oversimplified. <strong>What am I missing? Why should I not try to live here (aside from cost of living)?</strong></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "secondhand and thirdhand smoke are causing my child and our whole family immense suffering",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbet8k/secondhand_and_thirdhand_smoke_are_causing_my/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbet8k/secondhand_and_thirdhand_smoke_are_causing_my/",
      "pubDate": "Mon, 1 Dec 2025 14:55:03 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbet8k/secondhand_and_thirdhand_smoke_are_causing_my/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>For the past few years, my entire neighbourhood has smelled like one giant ashtray after 8pm. People smoke at the park, the void deck, and even right outside the food court. Most of these areas are supposed to be non-smoking zones, but the rules are completely ignored. </p>\n\n<p>My child was born with underdeveloped lungs and a weak heart, so the situation affects us even more. Our clothes keep picking up secondhand smoke, and we’re exposed to it every time we enter or leave the house. Because of that, my child has been having more frequent asthma attacks, trouble breathing, and just last week even coughed up blood. I had to take her to the hospital. The doctor diagnosed my child with acute bronchitis, caused by long-term exposure to secondhand smoke and clothes contaminated with thirdhand smoke. and the doctor also advised us not to hang our clothes outside and to keep the windows closed. But we are a low-income family, the elderly at home already have health issues that are expensive to manage. We can’t afford a dryer, an air purifier, or the extra electricity anymore. And still every single day, we have to walk through smoke just to get around our own neighbourhood. I’ve been in so much pain because of this. Sometimes I can’t help but think if only I could have given my child fully developed lungs during my pregnancy, maybe she wouldn’t be suffering like this now.</p>\n\n<p>We’ve reported this many times, but nothing has changed. NEA always gives us a very standard reply and says the issue has been “resolved” but I can tell you the situation has only gotten worse in the past few months, maybe it’s because many vapers quit vaping and went back to cigarettes. Last month, I once requested an uncle who was riding the lift with my child and me, to not smoke in the lift. Then he verbally abused me, nearly hit me, and even blew smoke directly at my child, leaving me carrying fear all the way home. </p>\n\n<p>Secondhand and thirdhand smoke are far more serious than people realize. For a financially strained family like ours, life is already hard enough. Without proper enforcement and legal protection, we can’t even have something as basic as clean air, one of the most fundamental things everyone should be able to rely on.</p>\n\n<p>If smokers stayed in the designated smoking areas, no one would be affected and there would be no problem. But now they’ve become increasingly reckless and inconsiderate. My family and I are living in constant discomfort, and I don’t think I’m the only one struggling with this secondhand smoke issue. We’re just an ordinary financially strained household as we can’t even afford a dryer to protect our clothes from the smoke. I’m not asking for the world to feel sorry for us, but it’s hard to watch my child suffer from asthma and breathing problems because of something we have no control over. </p>\n\n<p>I understand that the government strictly regulate vaping, but I hope they also realize that after banning vapes, smokers start lighting up freely in non-smoking areas, and that this situation needs stronger enforcement. What can I do to make the government take this seriously and enforce stronger laws to stop this secondhand smoke problem?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "what is normal working hours in singapore, how to find a actual 9-5... most are over those times",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbem4n/what_is_normal_working_hours_in_singapore_how_to/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbem4n/what_is_normal_working_hours_in_singapore_how_to/",
      "pubDate": "Mon, 1 Dec 2025 14:46:49 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbem4n/what_is_normal_working_hours_in_singapore_how_to/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Are entry level jobs supposed to be longer than 9-6 pm .... like 9-6:45 which is basically 9-7 pm... it seems really long and added with travel time is so much longer than expected especially compared to Australia... its literally 50 hours instead of 38 hours... </p>\n\n<p>Is this normal? Or its possible to have shorter hours in office job.. This is design job btw</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How to deal with family member's bad temper?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbvj4j/how_to_deal_with_family_members_bad_temper/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbvj4j/how_to_deal_with_family_members_bad_temper/",
      "pubDate": "Tue, 2 Dec 2025 01:41:55 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbvj4j/how_to_deal_with_family_members_bad_temper/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>My brother (late twenties) temper has been getting from bad to worse. He is angry most of the time, stomping at home, glaring at us, slamming things, hostile tone. When he really explodes he would threaten me to teach me a lesson, or hit me (rarely as I would lock the door to protect myself).</p>\n\n<p>This bad temper started during NS and gotten worse in his new job which requires shift work. </p>\n\n<p>I&#39;m walking on eggshells and on a verge of a panic attack when he&#39;s at home. When confronted he would deny that he is angry or wouldn&#39;t tell us the reason he is angry. </p>\n\n<p>To add on, he can be egoistic and delusional making it hard for us and others to communicate with him. Parents have tried talking things out with him, suggesting him to go for counselling but he feels that he does not have a problem, sustaining the issue.</p>\n\n<p>What should me and my parents do? I&#39;m not sure how long I can tahan his behaviour. Moving out is not an option now. If you have or know of someone with bad temper and managed to overcome it please feel free to share as well. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What are the precautions and contingency plans when driving into Malaysia?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbtdgw/what_are_the_precautions_and_contingency_plans/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbtdgw/what_are_the_precautions_and_contingency_plans/",
      "pubDate": "Tue, 2 Dec 2025 00:07:55 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbtdgw/what_are_the_precautions_and_contingency_plans/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hello, what are the precautions and contact points y’all have when driving up north?</p>\n\n<p>Example, say when car tyre puncture / car breakdown along highway or in carpark, who do you call? And to tow where? I presume if it’s a battery you will get it settled at nearby workshop instead of towing to SG.</p>\n\n<p>Also, if car is undrivable, how do you all get back into SG? Really just take a taxi to the customs?</p>\n\n<p>Any other precautions and contingency plans to share?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Lacking behind and feeling burnout",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbcbmr/lacking_behind_and_feeling_burnout/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbcbmr/lacking_behind_and_feeling_burnout/",
      "pubDate": "Mon, 1 Dec 2025 13:07:58 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbcbmr/lacking_behind_and_feeling_burnout/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys! 32M and single here with a new job role with only 3k pay. It feels like I am lacking behind in life so much already as compared to others. All my younger colleagues were asking me why I took up this role because I seem educated and deserved so much better. This got me to question myself if I am doing this right. </p>\n\n<p>Backstory: </p>\n\n<p>1) Took longer time to graduate due to bad mental health. Mental state has cause me to suffered a lot. Not even a local uni grad. </p>\n\n<p>2) Did sales role but didn’t last. Jobs like ops and contract job didn’t last long either. I am too scattered.</p>\n\n<p>3) Did a swimming instructor part time job in the weekend for extra income and setting it as a backup for the long run. Recently completed a freelance coding instructor role under MOE going around primary school to teach coding and AI. </p>\n\n<p>4) Not much savings due to the fact that I have closed myself off so much in my 20s due to my failure and mentally ill mother influence. Covid lockdown didn’t help either.</p>\n\n<p>Current state:</p>\n\n<p>1) New role with only 3k but it’s very tiring due to the demands of being a backend support. </p>\n\n<p>2) Got an offer to continue the freelance coding trainer with a 50% bump in rate but unsure if I can commit to it due to me having a full time now. </p>\n\n<p>3) Mental state is still in a burnout state and feeling like a constant blur on a daily basis. Even my colleagues noticed this and are concerned about me. </p>\n\n<p>TDLR; I am way behind in life. I am burning out while looking at how screwed my career is now. I can only blame myself for not being strong enough and let my environment influence me and now I am suffering for it. My resume is screwed too so at this point in time, I wasn’t sure how I can keep this up all the time. I envy how others are able to do it while I don’t have the capacity to even be able to fake a smile and keep my heads up. </p>\n\n<p>I don’t have a lot of people to talk to either since most of my friends have their own family and talking to my own family would only make me feel worst because I don’t feel heard at all. </p>\n\n<p>I used to be ambitious and I want to give my family a better life by changing things. Nobody listens to the advices I shared despite my warnings on how I see certain things coming. In the end we all suffered because nobody listens and I don’t know when I got into this mental spiralling even though I suspected I have anxiety issues since young.  </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Is it normal to have bosses which are ‘my way or the highway’?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbiuvb/is_it_normal_to_have_bosses_which_are_my_way_or/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbiuvb/is_it_normal_to_have_bosses_which_are_my_way_or/",
      "pubDate": "Mon, 1 Dec 2025 17:26:00 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbiuvb/is_it_normal_to_have_bosses_which_are_my_way_or/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I don’t have much YOE (&lt;5), but I recently changed company this year and ended up in a place where I constantly need to prove myself to my bosses day in and day out. During meetings I’ll get met with words like ‘if you don’t like it u can get out’, ‘when I tell u to jump u ask how high’, ‘I don’t trust you at all, don’t make my life difficult’. </p>\n\n<p>My probation period is ending soon and it feels like I’m going to fail probation. Does anyone have any similar stories of their bosses being ‘my way or the highway’? Have been crying about this for the past 2 months but haven’t been able to figure out why is such a painful </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "My mom is being bullied by her boss to OT for free, what can I do about it?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbbjxj/my_mom_is_being_bullied_by_her_boss_to_ot_for/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbbjxj/my_mom_is_being_bullied_by_her_boss_to_ot_for/",
      "pubDate": "Mon, 1 Dec 2025 12:31:24 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbbjxj/my_mom_is_being_bullied_by_her_boss_to_ot_for/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>So in context, my mom has been coming home 8:30PM+ almost everyday, usually she would end at 5:30pm (as stated at her employer contract) and head home reaching around 6 and now she ends late due to her new boss, who wants everyone in the department to do their work “finished” but its near impossible to finish since every report done, five more would appear. Also the new boss “threaten” her by saying, “don’t be surprised if your appraisal is low” I also ask her if she get paid to OT but she say she and her colleagues didn’t get any OT. So what can I do about it?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Interested to hear real stories of how you take revenge (without breaking the law) on pricks, bullies and other nasty people in SG!",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pb8il7/interested_to_hear_real_stories_of_how_you_take/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pb8il7/interested_to_hear_real_stories_of_how_you_take/",
      "pubDate": "Mon, 1 Dec 2025 09:33:38 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pb8il7/interested_to_hear_real_stories_of_how_you_take/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I genuinely feel that there are a-holes who get away with obnoxious, abhorrent behaviour and yet are not punished and there’s no way to hold them accountable. So I am interested to hear real stories on how anyone gets back at shitty people who have done them wrong without falling foul of our laws. PS: Not encouraging vigilantes here.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Deep cleaner recommendations for new resale flats",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbtvjo/deep_cleaner_recommendations_for_new_resale_flats/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbtvjo/deep_cleaner_recommendations_for_new_resale_flats/",
      "pubDate": "Tue, 2 Dec 2025 00:28:54 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbtvjo/deep_cleaner_recommendations_for_new_resale_flats/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hello! My partner and I are getting the keys to our resale flat soon and we don&#39;t plan on doing any major reno, because the previous owner left a lot of in built features that can still be used. But we want to hire some professionals to do a 1 time deep clean of everything before we move in. Has anyone used these services before? Any to recommend or avoid? What did they clean for you? What did they not clean?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Ladies, how do you all manage your hair in SG's heat and humidity?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbfozj/ladies_how_do_you_all_manage_your_hair_in_sgs/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbfozj/ladies_how_do_you_all_manage_your_hair_in_sgs/",
      "pubDate": "Mon, 1 Dec 2025 15:29:04 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbfozj/ladies_how_do_you_all_manage_your_hair_in_sgs/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>It has been raining recently but honestly there are days that it is just so humid and warm. And with climate change, it will only get worse in the future.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How Do People Cope with Life Here? Esp Those with Kids",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbc83y/how_do_people_cope_with_life_here_esp_those_with/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbc83y/how_do_people_cope_with_life_here_esp_those_with/",
      "pubDate": "Mon, 1 Dec 2025 13:03:32 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbc83y/how_do_people_cope_with_life_here_esp_those_with/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>TLDR: I have been wondering how people cope with life? With work, family, other personal issue? Like how do people survive daily?</p>\n\n<p>It has been a while since work becomes even busier and I am preparing for my wedding next year. But sadly I really have no time to prepare or think about my wedding. Same goes with my fiance.\nThinking about the future, I thought I would be excited on the thought of getting married, having my own family, my own house. But I am only getting scared. Moreover, my parents and my in law will only get older... there will be time when I will need to care for them too.</p>\n\n<p>Me and my fiance, we want to have at least 1 kid... people said when it happens, it will just work out magically. But I cannot help but being worried. If I am pregnant and I need to work like now, honestly I am not sure if I can do it. And when the baby is born, even if there is daycare, what if I don&#39;t have time to pick him up? Or even taking care of him when I bring him home?</p>\n\n<p>We plan to bring my in law to live with us. She is an adult but of course me and my husband to be need to care for her. Like taking her out, bringing her for health check, etc. I am afraid we will not have the brain for that if our work is like this.</p>\n\n<p>I wonder if I can cope with everything happening at once: work, housework, kids, parents?</p>\n\n<p>I am not sure if it is just me... Maybe I am too negative about everything when I should be thankful to have a job in this economy? But how about my mental and physical health? Everyday I just feel very drained.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How do families in Singapore resolve conflicts?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbcy7i/how_do_families_in_singapore_resolve_conflicts/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbcy7i/how_do_families_in_singapore_resolve_conflicts/",
      "pubDate": "Mon, 1 Dec 2025 13:36:27 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbcy7i/how_do_families_in_singapore_resolve_conflicts/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Got into a fight with my mom recently, and it seems to me that most asian families do not talk about conflicts or resolve things through talking about their feelings etc. after fights. For example, my parents have always brushed things under the rug and pretended that it didn&#39;t happen or avoid talking about it entirely. </p>\n\n<p>From my experience, it had led to a lot of resentment and underlying tension that has built up throughout the years. I felt that it’s made me very distant from my mom. It’s very different with my partner, where we communicate with each other kindly and with empathy. Don&#39;t really want to go into that much detail about my own family but I&#39;m really curious if this is the same sentiment amongst other families in Singapore.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How much education does our construction workers have?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pb0p9h/how_much_education_does_our_construction_workers/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pb0p9h/how_much_education_does_our_construction_workers/",
      "pubDate": "Mon, 1 Dec 2025 02:21:35 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pb0p9h/how_much_education_does_our_construction_workers/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Sooo my partner thinks that construction work is unskilled and &quot;just have to show up at work and listen to instructions&quot;. Meanwhile her job is more skilled because you need to learn communication skills and presentation skills and computer skills which is tough for them because they&#39;ve never seen a phone in their whole lives!</p>\n\n<p>Yeah I don&#39;t agree with her viewpoint at all but I don&#39;t think I can change her mind.</p>\n\n<p>These workers definitely come to Singapore for a better work life but I don&#39;t believe that they&#39;re as dumb as they say. Manual labor can be learned on the job but obviously you have to know the theory first before even attempting something that can kill you first try.</p>\n\n<p>And that theory is education and school. </p>\n\n<p>No way my fucking boss will let me operate a crane day 1 or even day 10.</p>\n\n<p>Edit: I&#39;ll slowly read through all your comments lol</p>\n\n<p>Edit: This convo came from talking about immigrants &quot;taking jobs&quot;. While I also personally think there are too many people in Singapore, we should blame the government and companies for hiring cheap labour and not the foreigners looking for a job. </p>\n\n<p>And nah, I&#39;m not going to break up over her thinking, because I&#39;ve only complained about the bad and not talked about the good.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "With the drastic fall in birth rates, why doesn’t there seem to be any reversion in school placement competitiveness?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pb2y3s/with_the_drastic_fall_in_birth_rates_why_doesnt/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pb2y3s/with_the_drastic_fall_in_birth_rates_why_doesnt/",
      "pubDate": "Mon, 1 Dec 2025 04:08:44 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pb2y3s/with_the_drastic_fall_in_birth_rates_why_doesnt/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>When I was a kid, I distinctly remember the narrative being told to us is that there were just too few spots in the “upper echelons” of education and having too little national resources to divide amongst all of us.</p>\n\n<p>However as I have grown up, it seems that the education system has only gotten more competitive even while schools being closed left and right due to lack of students (and NOT a lack of resources). </p>\n\n<p>I mean, how is this possible? The government has even calculated that by 2030 the SAF will experience a reduction of manpower by about 1/3, if that’s the case, why the hell are kids still having to torture themselves for spots in better schools in search of opportunities? Why not just move all the kids up a spot for every “missing” Singaporean kid (which should be something like half considering current birthrates).</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Working adults out there, do you meal prep to work?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pb9tge/working_adults_out_there_do_you_meal_prep_to_work/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pb9tge/working_adults_out_there_do_you_meal_prep_to_work/",
      "pubDate": "Mon, 1 Dec 2025 10:55:12 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pb9tge/working_adults_out_there_do_you_meal_prep_to_work/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Meal prepping is not that common in singapore as compared to other countries. </p>\n\n<p>For those that meal prep to work, what are your reasons for doing so? Do you feel awkward for eating your meal prep / using the microwave? And is it a common thing in your workplace? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Singapore reviews on any order",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbbhw5/singapore_reviews_on_any_order/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbbhw5/singapore_reviews_on_any_order/",
      "pubDate": "Mon, 1 Dec 2025 12:28:39 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbbhw5/singapore_reviews_on_any_order/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Im wondering why customers in Singapore usually comment about how nicely package are wrapped and fast delivery and thank sellers. Mostly on shoppee, lazada.</p>\n\n<p>It would be nice if customers actually give review after using the products within a few days or few weeks. </p>\n\n<p>Its very important to give honest reviews on  products that are ordered. Right? Not just about wrapped box, delivery. 🫣</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Ideas for gift bag for a bangladeshi worker",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbivla/ideas_for_gift_bag_for_a_bangladeshi_worker/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbivla/ideas_for_gift_bag_for_a_bangladeshi_worker/",
      "pubDate": "Mon, 1 Dec 2025 17:26:43 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbivla/ideas_for_gift_bag_for_a_bangladeshi_worker/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Recently interacted with bangladeshi worker and found out he was trying to buy some nice things for his 3 yr old son back home. Spouse decided to get it for him which got me to thinking how else can we make it more meaningful for him. Seeking ideas/suggestions in the comments. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Travel insurance for theft &amp; trip curtailment",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbm4j3/travel_insurance_for_theft_trip_curtailment/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbm4j3/travel_insurance_for_theft_trip_curtailment/",
      "pubDate": "Mon, 1 Dec 2025 19:23:42 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbm4j3/travel_insurance_for_theft_trip_curtailment/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>hihi my phone was stolen on the first leg of my trip so i had to cancel my flight to the 2nd country and book a flight back home too. would anyone know if travel insurance (allianz) covers this, and if so in what regard? any prior experiences with them would help too, thanks!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Is my job scope stretched too far as an analyst",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pb5ecn/is_my_job_scope_stretched_too_far_as_an_analyst/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pb5ecn/is_my_job_scope_stretched_too_far_as_an_analyst/",
      "pubDate": "Mon, 1 Dec 2025 06:18:23 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pb5ecn/is_my_job_scope_stretched_too_far_as_an_analyst/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I joined a company as a data analyst. When I came in, the main project assigned to me was to build a full visualization tool for the data we collect. </p>\n\n<p>This included database design, writing APIs, building the frontend and then making the charts/visuals followed by deployment.</p>\n\n<p>Now my boss is also expecting me to gain domain knowledge so I can understand why we collect the data, how it should be interpreted, and how to guide decisions with it.</p>\n\n<p>I do understand that domain knowledge is valuable for an analyst, but I have been doing the full stack for months and it does feel like I am no longer in the analyst role anymore. When the boss questioned me for insights today, my mind was totally blank. But I also feel like if you are expecting me to develop a whole app then I shouldn&#39;t need to know all this?</p>\n\n<p>I’m starting to feel like my role has expanded far beyond just one role. Is this kind of workload normal? Just thought it is better to ask here for Singapore context</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Other must visit places for someone visiting Singapore",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbdfam/other_must_visit_places_for_someone_visiting/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbdfam/other_must_visit_places_for_someone_visiting/",
      "pubDate": "Mon, 1 Dec 2025 13:57:25 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbdfam/other_must_visit_places_for_someone_visiting/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m traveling to Singapore in December and I&#39;m looking for some fresh ideas of things to do in Singapore. This will be my 4th time in Singapore so I&#39;m looking for quirky or places tourists wouldn&#39;t normally go. </p>\n\n<p>So far on my list:\n- Explore Bencoolen and Katong\n- Go to the local hawker centres like old airport road food centre. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Meet parents first dinner spot",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbc4iz/meet_parents_first_dinner_spot/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbc4iz/meet_parents_first_dinner_spot/",
      "pubDate": "Mon, 1 Dec 2025 12:59:07 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbc4iz/meet_parents_first_dinner_spot/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi fellow Singaporeans,</p>\n\n<p>This is my first time bringing my girlfriend to meet my parents. Is there any restaurant/ venue/ spot recommendations. My parents are excited to meet my girlfriend but for me I am nervous and my girlfriend is a little scared too. We are setting the venue but we got no idea. Any personal favourite spot you guys go to recommendations will be greatly appreciated. </p>\n\n<p>Basic info: </p>\n\n<p>Chinese family \nBudget: $250 - $300 max\nPax: 4 \nDay: Friday night 7pm\nVibe: chill and not rushed by venue \nCuisine: prefer on safer side for parents. </p>\n\n<p>I thank everyone in advance for any input given. </p>\n\n<p>Thank you ☺️ </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Where to get scissors professionally sharpened?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbsulw/where_to_get_scissors_professionally_sharpened/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pbsulw/where_to_get_scissors_professionally_sharpened/",
      "pubDate": "Mon, 1 Dec 2025 23:45:50 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pbsulw/where_to_get_scissors_professionally_sharpened/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I want to bring every pair of scissors I own to be professionally sharpened. Where can I do so? Would be good if a price range is included. Thanks! </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "BTO/SBF Renovation tips and budgeting",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1pb9gr0/btosbf_renovation_tips_and_budgeting/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1pb9gr0/btosbf_renovation_tips_and_budgeting/",
      "pubDate": "Mon, 1 Dec 2025 10:33:26 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1pb9gr0/btosbf_renovation_tips_and_budgeting/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>We will be getting our keys for an SBF repurchased unit soon, and the unit is completely bare.</p>\n\n<p>We’re trying to spend as little as possible on renovation, appliances, and furniture, but we also understand that some things shouldn’t be skimped on.</p>\n\n<p>We would love to hear from others about which items are worth investing in and which ones you feel are unnecessary to spend more on, based on your experience.</p>\n\n<p>Thank you!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Does the lack of child seat in a car increase your culpability in an accident?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1payvlj/does_the_lack_of_child_seat_in_a_car_increase/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1payvlj/does_the_lack_of_child_seat_in_a_car_increase/",
      "pubDate": "Mon, 1 Dec 2025 00:56:20 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1payvlj/does_the_lack_of_child_seat_in_a_car_increase/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>My friend got into a minor car accident in which he bumped into the car in front</p>\n\n<p>He told me that he knows it&#39;s kinda his fault. But when he saw the car in front had a toddler but no car seat, he immediately took photos</p>\n\n<p>Using that, he was able to argue the case until &quot;things went his way&quot;</p>\n\n<p>(He didn&#39;t explain if that meant the car insurance didn&#39;t think it was his fault, or that private settlement was in his favor, or something else entirely)</p>\n\n<p>Is my friend bullshitting, or does lack of child seat in your car that has a toddler increase your culpability in an accident even if it isn&#39;t your fault?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    }
  ],
  "group": "country",
  "url": "https://redlib.perennialte.ch/r/askSingapore.rss",
  "lastFetched": "2025-12-02T03:45:07.044Z"
}