{
  "title": "indonesia",
  "description": "Welcome to /r/indonesia. Selamat datang di subreddit /r/indonesia.\n\nPlease follow the rules and respect others. Mohon patuhi peraturan subreddit dan hormati orang lain.",
  "link": "",
  "items": [
    {
      "title": "29 November 2025 - Weekend Chat Thread",
      "link": "https://redlib.perennialte.ch//r/indonesia/comments/1p9ah8d/29_november_2025_weekend_chat_thread/",
      "guid": "https://redlib.perennialte.ch//r/indonesia/comments/1p9ah8d/29_november_2025_weekend_chat_thread/",
      "pubDate": "Sat, 29 Nov 2025 00:15:30 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9ah8d/29_november_2025_weekend_chat_thread/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Yo, Vulcan is here, annual Chat Thread series creator since 2016 <del>and a massive weeb</del></p>\n\n<p>So, welcome to the Weekend Chat Thread of <a href=\"/r/Indonesia\">r/Indonesia</a>. Unwind your mind and enjoy the weekend goodness!</p>\n\n<p><strong>24 hours a day/7 days a week of chat, inspiration, humour, and joy! Have something to talk about or share? This is the right place!</strong></p>\n\n<p>Have fun chatting inside this thread, otsukare!</p>\n\n<p><sup>Questions</sup> <sup>about</sup> <sup>this</sup> <sup>post?</sup> <sup>Ping</sup> <a href=\"/u/Vulphere\">u/Vulphere</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Count Your Blessings Thread - November 2025",
      "link": "https://redlib.perennialte.ch//r/indonesia/comments/1p838th/count_your_blessings_thread_november_2025/",
      "guid": "https://redlib.perennialte.ch//r/indonesia/comments/1p838th/count_your_blessings_thread_november_2025/",
      "pubDate": "Thu, 27 Nov 2025 14:15:33 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p838th/count_your_blessings_thread_november_2025/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p><em>This special thread series was originally maintained by</em> <a href=\"/u/mbok_jamu\">u/mbok_jamu</a>, <em>since the scheduled post feature is now available on Reddit I will take over this monthly series - Vulcan</em></p>\n\n<p>Thank you for sharing your joy and gratitude on the previous Count Your Blessings thread. I&#39;m so proud to see your gratitude and positive energy towards every single thing - even the smallest ones - that you&#39;ve had in life.</p>\n\n<p>It&#39;s time to take a look at the best moments that happened this month. What makes you laugh? Who makes you smile? What makes you proud of yourself? What was the most wholesome moment of the month?</p>\n\n<p>Forget all your problems for a while. Be grateful. Be brave. Be your better self. So tomorrow you will start your new day with gratitude and positivity.</p>\n\n<p>Share your love and joy by helping those in need through these charity events and organisations:</p>\n\n<ul>\n<li>Help increasing literacy in Indonesia by donating your old books. How to donate? visit this link <a href=\"http://donasibuku.kemdikbud.go.id/\">Ministry of Education Book Donation Programme</a></li>\n<li>Donate your unused goods <a href=\"https://www.instagram.com/p/B74hcVCgJq5/?igshid=4bbbevx56nwb\">here</a></li>\n<li>For women Redditors who have excess breast milk, you can share to <a href=\"https://instagram.com/lactashare?igshid=1l72l2dm9iyr9\">Lactashare</a> for babies who need breast milk.</li>\n</ul>\n\n<p><em>PS: If the information listed above is outdated or not accurate, feel free to contact the moderator team via</em> <a href=\"/message/compose?to=/r/indonesia\"><em>modmail</em></a><em>.</em></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "rekaman oleh WNI yang menjadi awak kapal \"shadow fleet\" target penyerangan drone Ukraina di Laut Hitam (28/11/2025)",
      "link": "",
      "guid": "",
      "pubDate": "Sun, 30 Nov 2025 06:25:02 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pabaes/rekaman_oleh_wni_yang_menjadi_awak_kapal_shadow/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pabaes/rekaman_oleh_wni_yang_menjadi_awak_kapal_shadow/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Pecinta alam = wahabi lingkungan kau masih tidak paham juga boomer kolot",
      "link": "/img/pl2xl9i1ec4g1.jpeg",
      "guid": "/img/pl2xl9i1ec4g1.jpeg",
      "pubDate": "Sun, 30 Nov 2025 06:55:52 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pabshe/pecinta_alam_wahabi_lingkungan_kau_masih_tidak/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pabshe/pecinta_alam_wahabi_lingkungan_kau_masih_tidak/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "TIL dulu ada arena balap kuda di daerah Empire XXI Yogyakarta",
      "link": "/gallery/1pabztq",
      "guid": "/gallery/1pabztq",
      "pubDate": "Sun, 30 Nov 2025 07:08:14 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pabztq/til_dulu_ada_arena_balap_kuda_di_daerah_empire/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Sumber: INI GRUP UMAMUSUME TAPI ISINYA UMA LOKAL SEMUA (IGUTIULS)</p>\n\n<p><a href=\"https://m.facebook.com/story.php?story_fbid=848560384424461&amp;id=817518577528642\">https://m.facebook.com/story.php?story_fbid=848560384424461&amp;id=817518577528642</a></p>\n\n<p>Link peta: <a href=\"https://maps.app.goo.gl/CtGKqRaB5WBQh36Z6\">https://maps.app.goo.gl/CtGKqRaB5WBQh36Z6</a></p>\n\n<p>Link peta jadul: National library of Australia </p>\n\n<p><a href=\"https://catalogue.nla.gov.au/catalog/7754049\">https://catalogue.nla.gov.au/catalog/7754049</a>?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Mahasiswa Malang Kirim Pesan Pilu ke Adik Sebelum Bunuh Diri di Suhat",
      "link": "https://www.detik.com/jatim/berita/d-8234678/mahasiswa-malang-kirim-pesan-pilu-ke-adik-sebelum-bunuh-diri-di-suhat",
      "guid": "https://www.detik.com/jatim/berita/d-8234678/mahasiswa-malang-kirim-pesan-pilu-ke-adik-sebelum-bunuh-diri-di-suhat",
      "pubDate": "Sun, 30 Nov 2025 07:50:28 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pacnk7/mahasiswa_malang_kirim_pesan_pilu_ke_adik_sebelum/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pacnk7/mahasiswa_malang_kirim_pesan_pilu_ke_adik_sebelum/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Ketika ngomongin orang dan orangnya dibelakang",
      "link": "/img/4oo36f6gya4g1.jpeg",
      "guid": "/img/4oo36f6gya4g1.jpeg",
      "pubDate": "Sun, 30 Nov 2025 02:06:38 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pa6dx4/ketika_ngomongin_orang_dan_orangnya_dibelakang/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pa6dx4/ketika_ngomongin_orang_dan_orangnya_dibelakang/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Pengendara Pajero Diperingatkan Warga Supaya Tidak Menerobos Jalanan Banjir, Ngeyel Tetap Terobos, Terjebak Di Situ Hingga Tengah Malam.",
      "link": "",
      "guid": "",
      "pubDate": "Sat, 29 Nov 2025 16:14:41 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9sr5l/pengendara_pajero_diperingatkan_warga_supaya/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9sr5l/pengendara_pajero_diperingatkan_warga_supaya/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Audit Keuangan terkait Gus Yahya Ungkap Dugaan Fraud Sumbangan Muslim World League Rp52,6 M ke PBNU",
      "link": "https://www.inilah.com/audit-keuangan-terkait-gus-yahya-ungkap-dugaan-fraud-sumbangan-muslim-world-league-rp526-m-ke-pbnu",
      "guid": "https://www.inilah.com/audit-keuangan-terkait-gus-yahya-ungkap-dugaan-fraud-sumbangan-muslim-world-league-rp526-m-ke-pbnu",
      "pubDate": "Sat, 29 Nov 2025 23:45:56 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pa3fhz/audit_keuangan_terkait_gus_yahya_ungkap_dugaan/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Tim Audit Akuntan Publik Gatot Permadi, Azwir dan Abimail (GPAA) menemukan dugaan penyimpangan atau kecurangan (fraud) dalam pengelolaan dana penyelenggaraan Religion 20 (R20) di Bali pada 2022 yang diterima PBNU dari Rabithah Alam Islami atau Muslim World League (MLW).</p>\n\n<p>Dalam laporan evaluasi audit terungkap bahwa PBNU menerima sumbangan dana sebesar Rp52.629.144.750 (Rp52,629 miliar) miliar dari MLW yang dikirimkan dalam dua tahap, yakni Rp25,767 miliar pada 16 September 2022 dan Rp26,861 miliar pada 24 Oktober 2022.</p>\n\n<p>Dana tersebut dikirim Rabithah Alam Islami ke rekening Mandiri PBNU yang dalam laporan audit disebut dikendalikan oleh Mardani H. Maming, yang saat itu menjabat sebagai Bendahara Umum PBNU sekaligus eks Bupati Tanah Bumbu, Provinsi Kalimantan Selatan.</p>\n\n<p>&quot;Rabithah Alam Islami memberikan dukungan dana untuk biaya penyelenggaraan R20 sebesar Rp 52.629.144.750,-. Dana sejumlah tersebut ditransfer dalam dua termin, masing-masing sebesar Rp 25.767.719.250,- pada 16 September 2022 dan Rp 26.861.425.500,- pada 24 Oktober 2022,&quot; tulis audit dalam dokumen yang dikutip pada Jumat (28/11/2025).</p>\n\n<p>Dari total dana tersebut, audit menemukan dana digunakan untuk transfer ke rekening bank di luar negeri senilai Rp23,178 miliar. Transfer pertama dilakukan pada 19 September 2022 sebesar Rp11,31 miliar melalui rekening Bank Mandiri 12xxx, dan transfer kedua dilakukan pada 7 November 2022 sebesar Rp11,86 miliar melalui rekening Bank Mandiri 10xxx.\nTangkapan layar hasil audit GPAA ke Ketum PBNU Gus Yahya berjudul\nTangkapan layar hasil audit GPAA ke Ketum PBNU Gus Yahya berjudul  &quot;Analisis Atas Laporan Penerimaan dan Pengeluaran Beserta Laporan Auditor Atas Prosedur Yang Disepakati Periode 1 Januari-31 Desember 2022 &quot;(Dok: inilah.com)</p>\n\n<p>Selain transfer ke luar negeri, audit juga mencatat tidak terdapat dokumen atau bukti pertanggungjawaban atas pengeluaran yang dibukukan sebesar Rp51,74 miliar dalam kegiatan acara tersebut. Setelah dikurangi nilai transfer ke luar negeri, masih terdapat sisa pengeluaran Rp28,57 miliar yang tidak dapat diverifikasi terkait eksistensi kegiatan R20 tersebut.</p>\n\n<p>&quot;Belum diperolehnya dokumen atau bukti pertanggungjawaban penggunaan uang atau pengeluaran dana kegiatan R20 oleh Tim Audit menunjukkan bahwa pengelolaan keuangan R20 tidak memenuhi standar akuntansi yang berlaku umum atau melanggar ketentuan Pasal 98 Ayat (1) ART NU,&quot; tulis dokumen tersebut.</p>\n\n<p>Pada saat yang sama, kondisi ini dinilai bertentangan dengan tujuan kerja sama antara Pengurus Besar Nahdlatul Ulama dan Rabithah Alam Islami.</p>\n\n<p>&quot;Kondisi tersebut juga menimbulkan kecurigaan adanya indikasi kecurangan atau fraud dalam pengelolaan dana sumbangan/sponsorship untuk kegiatan R20,&quot; tegas Tim Audit.</p>\n\n<p>Hal itu juga dinilai bertentangan dengan prinsip pengelolaan keuangan dan kekayaan Nahdlatul Ulama sebagaimana diatur dalam Pasal 97–98 Anggaran Rumah Tangga Nahdlatul Ulama (ART NU). Pasal 98 Ayat (1) ART NU mengatur bahwa &quot;Kekayaan Nahdlatul Ulama dan perangkat perkumpulannya berupa dana, harta benda bergerak dan/atau harta benda tidak bergerak harus dicatatkan sebagai kekayaan Perkumpulan Nahdlatul Ulama sesuai dengan standar akuntansi yang berlaku umum&quot;. </p>\n\n<p>Selanjutnya, Pasal 98 Ayat (2) ART NU mengatur bahwa &quot;Perolehan, pengalihan, dan pengelolaan kekayaan serta penerimaan dan pengeluaran keuangan Nahdlatul Ulama diaudit setiap tahun oleh akuntan publik&quot;.</p>\n\n<p>Dokumen audit ini diperkuat kebenarannya oleh pernyataan Katib Syuriyah PBNU, KH Sarmidi Husna, yang membenarkan keberadaan dokumen tersebut. Ia menyebut temuan terkait tata kelola keuangan menjadi salah satu alasan pemecatan KH Yahya Cholil Staquf (Gus Yahya) dari jabatan Ketua Umum PBNU.</p>\n\n<p>“Itu salah satu alasan. Kan ada alasan-alasan tuh, poin 1,2,3, nah itu kan alasan. Itu masuk poin 3, soal tata kelola keuangan,” kata Sarmidi saat ditemui di Hotel Sultan, Jakarta, Kamis (27/11/2025).</p>\n\n<p>Sarmidi juga menegaskan adanya aliran dana sebagaimana muncul dalam pemberitaan, meski PBNU belum dapat menjelaskan secara rinci kepada publik.</p>\n\n<p>“Itu kalau kami melihat data yang ada, itu benar, benar adanya ada aliran yang masuk itu. Tapi secara rinci kami memang tidak bisa menjelaskan secara rinci depan panjenengan semua. Saya kira sudah dapat dipahami,” ujarnya.</p>\n\n<p>Diketahui, Pengurus Besar Nahdlatul Ulama (PBNU) menginisiasi pelaksanaan Forum R20 bekerja sama dengan Liga Muslim Dunia (MWL). Forum ini digelar pada 2–3 November 2022 di Bali dengan menghadirkan pemimpin agama dan sekte-sekte dunia, baik dari negara anggota G20 maupun negara di luar presidensi G20. Sebanyak 32 negara terkonfirmasi hadir dengan total peserta mencapai 464 partisipan, serta 40 pembicara dari lima benua.</p>\n\n<p>Adapun topik yang dikaji dalam forum tersebut mencakup Historical Grievances (Kepedihan Sejarah), Pengungkapan Kebenaran, Rekonsiliasi, dan Pengampunan; Mengidentifikasi dan Merangkul Nilai-Nilai Mulia dari Agama dan Peradaban Besar Dunia; Rekontekstualisasi Ajaran Agama yang Usang dan Bermasalah; Identifikasi Nilai-Nilai yang Diperlukan untuk Menjamin Koeksistensi Damai; serta Ekologi Spiritual. Forum R20 diselenggarakan secara berkesinambungan mengikuti urutan presidensi G20, yakni di India pada 2023, Brasil pada 2024, dan Afrika Selatan pada 2025.\nRp100 Miliar dari Mardani H Maming</p>\n\n<p>Sebelumnya, Audit keuangan internal PBNU juga mengungkap serangkaian aliran dana masuk dan keluar yang melibatkan Mardani H. Maming, mantan Bendahara Umum PBNU sekaligus eks Bupati Tanah Bumbu, Kalimantan Selatan. Dokumen tersebut menunjukkan dugaan aliran dana Tindak Pidana Pencucian Uang (TPPU) senilai Rp100 miliar ke rekening PBNU pada 2022, selain sejumlah transaksi besar lainnya melalui rekening Bank Mandiri PBNU yang dikendalikan Maming.</p>\n\n<p>Analisis dokumen berasal dari laporan audit yang dilakukan Kantor Akuntan Publik Gatot Permadi, Azwir dan Abimail (GPAA). Laporan ini disusun sebagai bahan pertimbangan Rais Aam, pemegang mandat Syuriyah, dan mengacu pada laporan penerimaan dan pengeluaran PBNU serta prosedur audit yang disepakati untuk periode 1 Januari hingga 31 Desember 2022.</p>\n\n<p>Dokumen audit mencatat dana masuk ke rekening PBNU berasal dari Grup PT Batulicin Enam Sembilan milik Maming, dengan total Rp100 miliar yang ditransfer dalam empat tahap: 20 Juni 2022 sebesar Rp20 miliar dan Rp30 miliar, serta 21 Juni 2022 sebesar Rp35 miliar dan Rp15 miliar. Semua transaksi tercatat untuk HUT ke-100 PBNU dan operasional kegiatan lain.</p>\n\n<p>“Berdasarkan data yang ada diketahui bahwa dana sejumlah Rp100 miliar yang masuk ke rekening Bank Mandiri atas nama PBNU pada tanggal 20 dan 21 Juni 2022 dalam empat kali transaksi adalah berasal dari Grup PT Batulicin Enam Sembilan milik Mardani H. Maming,” tulis dokumen tersebut, dikutip Kamis (27/11/2025).</p>\n\n<p>Sehari setelah aliran dana masuk, pada 22 Juni 2022, Maming ditetapkan sebagai tersangka oleh KPK dalam kasus dugaan suap izin usaha pertambangan (IUP).</p>\n\n<p>“Pada tanggal 22 Juni 2022, Mardani H. Maming diumumkan oleh Komisi Pemberantasan Korupsi sebagai tersangka dugaan suap pemberian izin usaha pertambangan saat menjabat sebagai Bupati Tanah Bumbu,” tulis dokumen audit.</p>\n\n<p>PBNU Bantah</p>\n\n<p>Sementara itu PBNU membantah adanya dugaan tindak pidana pencucian uang (TPPU) terkait temuan dana Rp100 miliar yang masuk ke rekening PBNU pada 2022. Bendahara Umum PBNU Sumantri Suwarno menegaskan, seluruh transaksi keluar dan masuk dalam rekening tersebut merupakan instruksi langsung dari Mardani H. Maming, yang ketika itu menjabat Bendahara Umum PBNU.</p>\n\n<p>Tanggapan Sumantri ini juga berdasarkan delegasi dari Ketua Umum PBNU Yahya Cholil Staquf atau Gus Yahya.</p>\n\n<p>Menurut Sumantri, dokumen yang beredar tersebut bukanlah hasil audit final sehingga tidak bisa dijadikan dasar penilaian hukum maupun organisatoris. Menurut dia, audit yang belum rampung tidak layak dijadikan acuan untuk menarik kesimpulan, termasuk terkait isu TPPU.</p>\n\n<p>“Oke, jadi pertama ini jelas bisa dikutip bahwa hasil audit itu sebenarnya belum selesai. Dan audit ini audit umum yang tidak bisa mengambil kesimpulan ini ada TPPU atau tidak,&quot; kata Sumantri saat dihubungi inilah.com di Jakarta, Sabtu (29/11/2025).</p>\n\n<p>Sumantri menilai narasi bahwa PBNU bisa terseret TPPU adalah keliru. Ia menjelaskan TPPU hanya dapat diproses ketika terdapat pidana asal yang telah dinyatakan terbukti di pengadilan. Ia menegaskan, dalam kasus Mardani Maming, tidak ada vonis TPPU.</p>\n\n<p>“Kalau dalam kasus Maming, kan Maming tidak kena pidana vonis TPPU. Jadi ancaman TPPU itu nggak relevan,&quot; kata Sumantri.</p>\n\n<p>Lebih lanjut ia menyebut aliran dana Rp100 miliar, baik masuk maupun keluar, dikelola sepenuhnya atas instruksi Mardani Maming. “Mardani Maming waktu itu bendara umum, dia tahu nomor rekeningnya dan dia juga pernah tanda tangan cek,&quot; ujarnya.</p>\n\n<p>Ia juga menerangkan dana tersebut merupakan setoran dari perusahaan milik Maming. Menurutnya, PBNU saat itu hanya menerima perintah.</p>\n\n<p>“Lah dia bendum, yang masukin uang dia sendiri dari rekening perusahaan dia. Ya buat saya, ketika dia memerintahkan untuk mengeluarkan lagi, kita keluarkan,&quot; katanya.</p>\n\n<p>Sumantri menyebut posisinya hanya menjalankan fungsi administratif saat Maming berstatus tersangka dan tidak dapat menandatangani cek sendiri.</p>\n\n<p>“Ceknya diberikan lewat saya karena kan Maming tersangka. Jadi dia nyuruh orang dari PBNU, maksudnya karena saya bendara, ceknya ke saya, saya kasih tim dia,&quot; kata Sumantri.</p>\n\n<p>Ia menambahkan seluruh transaksi tersebut atas perintah Maming dan telah diklarifikasi oleh auditor.</p>\n\n<p>Selain itu, ia juga menyebut PBNU tidak memiliki pengetahuan maupun peran aktif dalam sumber dana yang disetor ke rekening organisasi. “PBNU ini pasif, kita nggak ngerti,&quot; ucap dia.</p>\n\n<p>&quot;Duit keluar masuk itu semua memang dikendalikan oleh Maming karena Maming posisinya masih sebagai bendara umum,&quot; sambung Sumantri.</p>\n\n<p>Sumantri mengingatkan, dugaan korupsi yang menjerat Maming di KPK terjadi saat ia menjadi Bupati Tanah Bumbu pada 2012–2018, jauh sebelum ia masuk PBNU pada 2022.</p>\n\n<p>“Maming itu kena korupsi waktu dia jadi bupati, yaitu 2012-2018. Dia itu masuk PBNU 2022. Batas waktu tindakan korupsi dia dengan dia jadi bendara umum aja jauh,&quot; katanya.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Travelio Unit Viewing Fee of  RP. 20,000",
      "link": "/gallery/1pa87ah",
      "guid": "/gallery/1pa87ah",
      "pubDate": "Sun, 30 Nov 2025 03:38:39 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pa87ah/travelio_unit_viewing_fee_of_rp_20000/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Selamat Siang semua, I’m a Chinese who just moved to Indonesia for working this month. I found this App called Travelio which can help me with renting houses and apartments.</p>\n\n<p>But when I tried to request a unit visit, the staff from Travelio asked for a unit viewing fee of RP. 20,000.</p>\n\n<p>😳I just want to know is this normal when renting houses in Indonesia? Because in China we don’t have this unit viewing fee, and the service fee is usually included in the rent.</p>\n\n<p>Terima kasih banyak for your answering !</p>\n\n<p>P.S. Could you kindly introduce how to rent a house or apartment in Indonesia?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Indonesia STOLE the Luxury Boot World and No One Saw It Coming",
      "link": "https://youtu.be/Jb7YOoquK_k?si=rkAMESviD7QjtyIQ",
      "guid": "https://youtu.be/Jb7YOoquK_k?si=rkAMESviD7QjtyIQ",
      "pubDate": "Sun, 30 Nov 2025 06:23:31 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pab9i3/indonesia_stole_the_luxury_boot_world_and_no_one/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pab9i3/indonesia_stole_the_luxury_boot_world_and_no_one/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Table Chart of Indonesia Presidents",
      "link": "/img/nbgf6dj4v64g1.jpeg",
      "guid": "/img/nbgf6dj4v64g1.jpeg",
      "pubDate": "Sat, 29 Nov 2025 12:21:19 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9nndv/table_chart_of_indonesia_presidents/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9nndv/table_chart_of_indonesia_presidents/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Minimarket di daerah terkena banjir menjadi target penjarahan (Sibolga, Tapanuli Tengah)",
      "link": "",
      "guid": "",
      "pubDate": "Sat, 29 Nov 2025 12:31:12 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9nu2u/minimarket_di_daerah_terkena_banjir_menjadi/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9nu2u/minimarket_di_daerah_terkena_banjir_menjadi/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Dedi Mulyadi Sindir Bobibos yang Menghilang: Jerami Siap Diolah Jadi Bahan Bakar, Saya Tunggu",
      "link": "",
      "guid": "",
      "pubDate": "Sat, 29 Nov 2025 19:59:28 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9y8q0/dedi_mulyadi_sindir_bobibos_yang_menghilang/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9y8q0/dedi_mulyadi_sindir_bobibos_yang_menghilang/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Bank Indonesia Forecasts 5.7% Economic Growth in 2026",
      "link": "https://en.tempo.co/read/2069656/bank-indonesia-forecasts-5-7-economic-growth-in-2026",
      "guid": "https://en.tempo.co/read/2069656/bank-indonesia-forecasts-5-7-economic-growth-in-2026",
      "pubDate": "Sun, 30 Nov 2025 07:07:53 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pabzm3/bank_indonesia_forecasts_57_economic_growth_in/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pabzm3/bank_indonesia_forecasts_57_economic_growth_in/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Zulkifli Hasan, Juara Lepas Izin Hutan Jadi Perkebunan",
      "link": "/img/w9ujqsylk74g1.jpeg",
      "guid": "/img/w9ujqsylk74g1.jpeg",
      "pubDate": "Sat, 29 Nov 2025 14:46:27 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9qofi/zulkifli_hasan_juara_lepas_izin_hutan_jadi/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>CNN Indonesia. 2018. <em>Zulkifli Hasan, Juara Lepas Izin Hutan Jadi Perkebunan.</em> <a href=\"https://www.cnnindonesia.com/nasional/20180322172216-23-285106/zulkifli-hasan-juara-lepas-izin-hutan-jadi-perkebunan\">https://www.cnnindonesia.com/nasional/20180322172216-23-285106/zulkifli-hasan-juara-lepas-izin-hutan-jadi-perkebunan</a> diakses pada 29 November 2025.</p>\n\n<p>Sudah, berhenti hujat Anita tumbler. Ada mangsa baru sekarang. Mungkin sekarang orang kesel karena sifat plonga plongonya saat diwawancarai oleh pak Harrison Ford. Tetapi ternyata jauh dari itu. Bahkan sudah melampaui laut dari pulau Sumatera saja (yang menjadi objek utama obrolan deforestasi pak Ford). Waktu ditanya soal Tesso Nilo malah tertawa, bukankah itu sifat sosiopat?</p>\n\n<p>Dan sekarang adalah momen waktu menjawabnya. Kita sudah tahu siapa pelakunya sementara ini, nanti akan bertambah. Kalau korban banjir kemarin ada banyak yang wafat, maka beliau harus segera diwafatkan.</p>\n\n<p>TIL, Zulkifli Hasan adalah penyebab banjir di Aceh-Sumut-Sumbar</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Iklan Kompas TV menjelang Peluncuran Resminya pada 9 September 2011",
      "link": "/img/l422635z6b4g1.jpeg",
      "guid": "/img/l422635z6b4g1.jpeg",
      "pubDate": "Sun, 30 Nov 2025 02:55:06 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pa7chi/iklan_kompas_tv_menjelang_peluncuran_resminya/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Sumber : <a href=\"https://x.com/KompasTV/status/107307367779147776?lang=ar\">https://x.com/KompasTV/status/107307367779147776?lang=ar</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Kumpulan foto bencana banjir Aceh-Sumut-Padang",
      "link": "/gallery/1p9kso6",
      "guid": "/gallery/1p9kso6",
      "pubDate": "Sat, 29 Nov 2025 09:29:10 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9kso6/kumpulan_foto_bencana_banjir_acehsumutpadang/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><ol>\n<li>Lembah Anai</li>\n</ol>\n\n<p>2, 3. Gapura Padang Panjang</p>\n\n<ol>\n<li><p>Sibolga</p></li>\n<li><p>Medan</p></li>\n</ol>\n\n<p>6, 7. Tapanuli Selatan</p>\n\n<ol>\n<li><p>Kab. Agam</p></li>\n<li><p>Pidie Aceh</p></li>\n<li><p>Pidie Jaya</p></li>\n<li><p>Tapanuli Utara</p></li>\n<li><p>Tapanuli Tengah</p></li>\n<li><p>Padang</p></li>\n</ol>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "BNPB Umumkan Lonjakan Korban Banjir dan Longsor di Sumatra: 303 Orang Meninggal, 279 Hilang",
      "link": "https://www.kompas.tv/regional/634386/bnpb-umumkan-lonjakan-korban-banjir-dan-longsor-di-sumatra-303-orang-meninggal-279-hilang",
      "guid": "https://www.kompas.tv/regional/634386/bnpb-umumkan-lonjakan-korban-banjir-dan-longsor-di-sumatra-303-orang-meninggal-279-hilang",
      "pubDate": "Sat, 29 Nov 2025 16:50:48 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9tn27/bnpb_umumkan_lonjakan_korban_banjir_dan_longsor/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9tn27/bnpb_umumkan_lonjakan_korban_banjir_dan_longsor/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Throwback Masa-Masa \"Work From Home\" Dan \"Learn From Home\"",
      "link": "/img/omn15sv0674g1.jpeg",
      "guid": "/img/omn15sv0674g1.jpeg",
      "pubDate": "Sat, 29 Nov 2025 13:22:44 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9out8/throwback_masamasa_work_from_home_dan_learn_from/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9out8/throwback_masamasa_work_from_home_dan_learn_from/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Denger dari petugas posyandu sekarang MBG juga dikasihkan ke balita sama bumil",
      "link": "https://redlib.perennialte.ch//r/indonesia/comments/1pa35ib/denger_dari_petugas_posyandu_sekarang_mbg_juga/",
      "guid": "https://redlib.perennialte.ch//r/indonesia/comments/1pa35ib/denger_dari_petugas_posyandu_sekarang_mbg_juga/",
      "pubDate": "Sat, 29 Nov 2025 23:33:08 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1pa35ib/denger_dari_petugas_posyandu_sekarang_mbg_juga/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Jadi ada petugas posyandu dirumah buat minta kemangi terus ngobrol sama nyokap dan ngeluh masalah pendataan MBG yang mau dibagikan ke bumil sama balita. Gimana menurut kalian? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "KDM Dikepung warga yang menolak penggusuran bangli dan menolak uang kompensasi 10 juta sampai membawa nama presiden prabowo",
      "link": "",
      "guid": "",
      "pubDate": "Sat, 29 Nov 2025 12:06:52 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9ndt4/kdm_dikepung_warga_yang_menolak_penggusuran/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9ndt4/kdm_dikepung_warga_yang_menolak_penggusuran/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "trio candu",
      "link": "/img/tnlqcwqe044g1.jpeg",
      "guid": "/img/tnlqcwqe044g1.jpeg",
      "pubDate": "Sat, 29 Nov 2025 02:45:09 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9dlbt/trio_candu/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Data BPS tahun 2024 mencatat rokok menjadi komoditas dengan pengeluaran terbesar kedua masyarakat Indonesia setelah beras. Rata-rata pengeluaran untuk rokok mencapai Rp37.590 per batang per kapita per bulan, jauh melampaui kebutuhan pokok lain seperti daging ayam yang berada di posisi ketiga sebesar Rp13.827 per kg per kapita per bulan.</p>\n\n<p>Sebanyak 9,71% pemuda mengisap 1-3 batang rokok per hari, sementara 20,83% lainnya mengonsumsi 4-6 batang. Sebagian besar perokok, yaitu 42,12%, berada pada kategori konsumsi 7-12 batang per hari. Selanjutnya, 22,89% pemuda mengisap 13-24 batang per hari, dan 4,46% lainnya bahkan mengonsumsi lebih dari 25 batang per hari. Angka-angka ini menggambarkan intensitas merokok yang cukup tinggi di kalangan pemuda.</p>\n\n<p><a href=\"https://data.goodstats.id/statistic/23-pemuda-indonesia-merokok-rata-rata-12-batang-per-hari-qCPDM\">https://data.goodstats.id/statistic/23-pemuda-indonesia-merokok-rata-rata-12-batang-per-hari-qCPDM</a></p>\n\n<p>also a nice infographic by kompas:</p>\n\n<p><a href=\"https://assetd.kompas.id/ktRZxBQ9F4qiu9lYFulxaPdKE38=/1024x3218/smart/filters:format(webp):quality(65)/https://asset.kgnewsroom.com/photo/pre/2021/01/31/0210131-ADI-Rokok-mumed_1612092092_png.png\">https://assetd.kompas.id/ktRZxBQ9F4qiu9lYFulxaPdKE38=/1024x3218/smart/filters:format(webp):quality(65)/https://asset.kgnewsroom.com/photo/pre/2021/01/31/0210131-ADI-Rokok-mumed_1612092092_png.png</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Fatwa terbaru MUI: Haram membuang sampah ke laut, sungai, dan danau",
      "link": "https://www.cna.id/indonesia/fatwa-terbaru-mui-haram-membuang-sampah-ke-laut-sungai-dan-danau-41221",
      "guid": "https://www.cna.id/indonesia/fatwa-terbaru-mui-haram-membuang-sampah-ke-laut-sungai-dan-danau-41221",
      "pubDate": "Sat, 29 Nov 2025 08:38:27 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9jzns/fatwa_terbaru_mui_haram_membuang_sampah_ke_laut/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9jzns/fatwa_terbaru_mui_haram_membuang_sampah_ke_laut/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "acting like it was their first time passing through there",
      "link": "/img/jxevj3jfp64g1.jpeg",
      "guid": "/img/jxevj3jfp64g1.jpeg",
      "pubDate": "Sat, 29 Nov 2025 11:48:57 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/indonesia/comments/1p9n2iz/acting_like_it_was_their_first_time_passing/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Gak tau di kota lain gimana, kalau di Kota Bandung, macet itu hampir bisa terprediksi. Daerah/jalan tertentu di jam tertentu. Dan bisa diantisipasi dengan berangkat 15-30 menit lebih awal</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    }
  ],
  "group": "country",
  "url": "https://redlib.perennialte.ch/r/indonesia.rss",
  "lastFetched": "2025-11-30T09:33:18.550Z"
}