{
  "title": "Ask Us Anything about Singapore",
  "description": "A place for all your Singapore related questions.",
  "link": "",
  "items": [
    {
      "title": "How do you manage toxic workaholic boss in private sector?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7q4e9/how_do_you_manage_toxic_workaholic_boss_in/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7q4e9/how_do_you_manage_toxic_workaholic_boss_in/",
      "pubDate": "Thu, 27 Nov 2025 02:01:12 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p7q4e9/how_do_you_manage_toxic_workaholic_boss_in/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>34M here who was working for 6.5 years in ministry doing Marketing &amp; Comms. Left after scholarship bond finished as I felt I was not growing and learning in my job anymore.</p>\n\n<p>I have since transitioned to private sector (senior marketing exec in automotive industry) for the past 6 months and am struggling with the transition. I am not sure if it is just my current boss&#39;s behavior or if this is common throughout private sector.</p>\n\n<p>My current boss who was my hiring manager when I secured this role got promoted to a director level position and told me that the manager position she was initially at would be left empty for me to prove myself and get promoted to. She shared that there would be no definitely timeline she can commit to. I did feel she might just be baiting me to work super hard but I wanted to prove myself to her.</p>\n\n<p>Since then, I have been feeling severely overworked as my boss seems to be a workaholic who would message me on teams even when I am on leave and end up scolding me if I do not reply timely. The amount of workload I am having to handle causes me to be working even when I go back home. I literally eat dinner at home while working on my work laptop.</p>\n\n<p>Initially, I chose endure as I was the one who wanted the jump from public sector to private sector. I also believed that I had to manage my expectations since this was private sector which was far more cutthroat and profit driven. However, I subsequently learned that besides my predecessor who quit due to burnout, two others have also left the team due to the workload. Their replacements who joined later than me have all shared how toxic our boss is and how she does not respect our boundaries at all even if we are on leave or on MC.</p>\n\n<p>Recently, I felt infuriated when I learnt that she doesn&#39;t read any emails she is cc-ed on. I wrote her a very detailed HOTO email on the tasks I was handing over to her and even had a call with her about it. She listened to everything but still kept pinging me during my holiday even though I was in a different timezone. It felt worse when she was reaching out to me constantly for information which was clearly stated in the email.</p>\n\n<p>Is this a common occurrence in private sector? Do senior bosses not even care about their emails due to the sheer number of emails they get cc-ed in? Do people in private sector ever manage to protect their own time while ensuring they dont end up getting fired?</p>\n\n<p>Definitely appreciate any advice, hopefully from manager/director level individuals in private sector. Would welcome any other comments too. How would you deal with the situation I am in without just quitting?</p>\n\n<p><em>PS I do sometimes regret quitting civil service as it provided far more job security, but I am learning so much more in this current role which gives me job satisfaction. I am just worried my boss&#39;s mood and temper will one day cause me to be unemployed even though the whole team is struggling and dying. With the existing job market, I do not want to quit and find another role without giving this job a few years at least. I am just worried that I might get fired by then.</em></p>\n\n<p>Thank you in advance for any tips or advice in this matter.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "last day in singapore looking for brands similar to late morning and frm. ytd?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7r3m3/last_day_in_singapore_looking_for_brands_similar/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7r3m3/last_day_in_singapore_looking_for_brands_similar/",
      "pubDate": "Thu, 27 Nov 2025 02:51:23 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p7r3m3/last_day_in_singapore_looking_for_brands_similar/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>hey all!!!! so far, so freaking good in singapore and i&#39;m absolutely loving the food and culture here!! yesterday i visited chinatown- went to this shop called late morning, and picked up a perfume from there, which got me thinking - - are there more places like this around singapore? i&#39;d love to explore and grab more indie and niche brands for fragrance, skincare, and clothing. i&#39;m kinda over the usual uniqlo stuff and really looking for something different. it&#39;s my last day here today, so if anyone knows where i can find more cool, unique brands, let me know!! i have exactly 8-10 hours XDD</p>\n\n<p>Edit: YOU GUYS ARE SO FREAKING COOL TYSM FOR SAVING MY DAY &lt;333333</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What are your thoughts on overconsumerism in Singapore?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7apnm/what_are_your_thoughts_on_overconsumerism_in/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7apnm/what_are_your_thoughts_on_overconsumerism_in/",
      "pubDate": "Wed, 26 Nov 2025 15:32:09 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p7apnm/what_are_your_thoughts_on_overconsumerism_in/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>No idea if it’s just me, but lately it feels like Singapore is getting very… buy-buy-buy all the time. Everywhere I go, there’s some new hype thing cafés, clothes, gadgets, “must-have” viral items. Even in the heartlands, the malls are packed with people shopping like it’s a sport. Further, with shoppee, taobao, and lazada adding to the buy-buy-buy all the time mentality.</p>\n\n<p>At the same time, everything is getting more expensive. But people are still queuing for limited drops such as labubus and popmart, switching Iphones every year, or buying stuff just because other people are buying it. Sometimes I look around and wonder if I’m the weird one for not wanting to constantly spend. Honestly, I do not even remember the last time I bought something nice for myself.</p>\n\n<p>Is this just normal city behaviour, or do we really have an issue with over-consumerism here? Do you all feel pressured to keep up, or is it just something I’m noticing more as I get older?<br/>\nMoreover, people always buy things they do not need and it gets thrown away.<br/>\nDo people nowadays just have more disposable income despite the high cost of living?</p>\n\n<p>Curious to hear how others see it.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "SG gym etiquette - dealing with rude people",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p72g3c/sg_gym_etiquette_dealing_with_rude_people/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p72g3c/sg_gym_etiquette_dealing_with_rude_people/",
      "pubDate": "Wed, 26 Nov 2025 08:21:35 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p72g3c/sg_gym_etiquette_dealing_with_rude_people/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Encountered an entitled fella at the gym today.</p>\n\n<p>I was doing my cool down (~5mins) in the space to the right of the resistance band and saw a dude sitting down at the rower machine on his phone.</p>\n\n<p>I moved over to the common bar for my cool down with the resistance band and assumed that he’s using the rower machine, so I shifted the stool to a vertical position.</p>\n\n<p>He suddenly gets up, kicks the stool back to horizontal and kept staring at me while I set up the resistance bands. I was confused so I stopped, apologised and ask if he’s using the common bar but he gestured to go ahead with my workout.</p>\n\n<p>Naturally, I’d assume he’s using the punching bag since he’s closer to it. Out of goodwill, I shifted the stool away. He then got aggro and told me “want to shift it back for me?”</p>\n\n<p>At this point I was like wtf?! I asked if u’re using the punching bag but u didn’t correct me that u are using the pull up bar. Had he said so, i wont even shift the stool as i can position myself anywhere with the resistance band.</p>\n\n<p>I went sarcastically “oh u are using the pull up bar?”,  push back the stool, quickly finish up my last set and walked off.</p>\n\n<p>The past me before marriage and kids would’ve started an altercation and I know my reaction was the right choice but just feel so indignant to let these idiots get away with their entitled ways.</p>\n\n<p>How would u guys have reacted?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Any recommendation for good marriage/pre marital preparation course?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7nr1q/any_recommendation_for_good_marriagepre_marital/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7nr1q/any_recommendation_for_good_marriagepre_marital/",
      "pubDate": "Thu, 27 Nov 2025 00:05:26 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p7nr1q/any_recommendation_for_good_marriagepre_marital/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi all,</p>\n\n<p>I’ve been browsing the feeds and saw a few recommendations, but with mixed reviews. I’d like to go for marriage preparation course with my partner, preferably with some structure/questions to let us discover things we never discussed about or never knew.</p>\n\n<p>I’m not looking for targetted course that focuses on the issues as there isn’t any.</p>\n\n<p>Appreciate if anyone can drop your recommendations - I know the suggested list is available via the ROM website but since the courses are pretty long I just wanted to make sure it’s something good and effective. Thank you </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "My room has a weird moisture/gas smell",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7sx8z/my_room_has_a_weird_moisturegas_smell/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7sx8z/my_room_has_a_weird_moisturegas_smell/",
      "pubDate": "Thu, 27 Nov 2025 04:27:55 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p7sx8z/my_room_has_a_weird_moisturegas_smell/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I don’t know if anyone has experienced something like this and shared your suggestion. </p>\n\n<p>My room has this weird smell that when you breathe in, you can “feel” the impact from your throat (like itchy feeling that can trigger cough). When I close all doors, the smell becomes stronger, like breathing a very condensed contaminated air. </p>\n\n<p>I have open all doors for about a month to ventilate my room. Checking and smelling around the room but can’t find any source. I just service the aircon so it’s likely not a problem. There’s no water leakage and moisture spot. The smell is still there no matter how hard I try to clean my room. </p>\n\n<p>Do I need to involve an inspection company in this case and which one that you suggest.  </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What’s something in Singapore everyone pretends to understand… but actually nobody does?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p74ruf/whats_something_in_singapore_everyone_pretends_to/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p74ruf/whats_something_in_singapore_everyone_pretends_to/",
      "pubDate": "Wed, 26 Nov 2025 10:52:20 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p74ruf/whats_something_in_singapore_everyone_pretends_to/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>SG got a lot of things we all pretend to understand sia.</p>\n\n<p>COE? ERP? Property? CPF?</p>\n\n<p>Everyone talk like expert but inside blur like sotong.</p>\n\n<p>What else you all act pro but actually don’t know one? 😂</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "how do you deal with the uwu bird right outside your window",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p72dng/how_do_you_deal_with_the_uwu_bird_right_outside/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p72dng/how_do_you_deal_with_the_uwu_bird_right_outside/",
      "pubDate": "Wed, 26 Nov 2025 08:17:00 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p72dng/how_do_you_deal_with_the_uwu_bird_right_outside/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>its so loud im geniunely losing my mind. Closed windows &amp; earplugs to sleep but cause the tree is right outside my window its so loud.</p>\n\n<p>I&#39;m become that crazy neighbour thats screaming and banging at 5am to shoo the bird away</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What does it mean to be a British Protected Person in Singapore?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p71kyy/what_does_it_mean_to_be_a_british_protected/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p71kyy/what_does_it_mean_to_be_a_british_protected/",
      "pubDate": "Wed, 26 Nov 2025 07:27:46 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p71kyy/what_does_it_mean_to_be_a_british_protected/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Just saw my father&#39;s birth certificate and my grandmother&#39;s nationality is listed as &quot;British Protected Person&quot;. Did a quick Google and it says:</p>\n\n<p>You would have become a British protected person on 1 January 1983 if you:</p>\n\n<ul>\n<li>were a citizen or national of Brunei</li>\n<li>were already a British protected person</li>\n<li>would otherwise have been born stateless (without a country) in the UK or an overseas territory because, when you were born, one of your parents was a British protected person</li>\n</ul>\n\n<p>From what I know, my grandma was born in Malaysia and married to a SC (granpa was listed as SC).</p>\n\n<p>Why was she not listed as Singapore/Malaysia Citizen? Are there any difference/limitations living as &quot;British Protected Person&quot; in Singapore compared to being a citizen? Any other meanings?</p>\n\n<p>Sorry, was just curious about this.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How do you typically handle your workload in your company?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p749aj/how_do_you_typically_handle_your_workload_in_your/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p749aj/how_do_you_typically_handle_your_workload_in_your/",
      "pubDate": "Wed, 26 Nov 2025 10:20:09 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p749aj/how_do_you_typically_handle_your_workload_in_your/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>My workload continously keep on piling and most of them have to be &quot;prioritised&quot;. But I still chose to leave work on time because my brain is basically fried and no point staying to OT with minimum productivity.</p>\n\n<p>I understand many people do OT and some even till midnight. Its just horrendous for 1 individual stacked with so many tasks. It pretty stressed me out as well.</p>\n\n<p>Thinking to switch company, probably and hopefully a more focused role. However, many people seems to be wearing multiple hats nowadays and need to handle tasks or even issue that is not really your problem.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What are some unspoken rules or 'common knowledge' in your estate/block?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p75qq8/what_are_some_unspoken_rules_or_common_knowledge/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p75qq8/what_are_some_unspoken_rules_or_common_knowledge/",
      "pubDate": "Wed, 26 Nov 2025 11:49:15 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p75qq8/what_are_some_unspoken_rules_or_common_knowledge/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>For example, as we know, HDB void deck has that dry riser pipes with that cabinet. Neighbours in my block would put any unwanted or &#39;spare&#39; goodies/snacks/condiments or whatever so anyone is free to take.</p>\n\n<p>And, of course, the community cat... No one will take away the community cat&#39;s &#39;home&#39;. Whenever it is destroyed or taken away, someone will build another with a box for the cat. Everyone looks out for the cat&#39;s wellbeing to ensure they are fed and taken care of. 🥰</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Ways to increase moments of joy in daily life",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p6xbtb/ways_to_increase_moments_of_joy_in_daily_life/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p6xbtb/ways_to_increase_moments_of_joy_in_daily_life/",
      "pubDate": "Wed, 26 Nov 2025 03:33:51 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p6xbtb/ways_to_increase_moments_of_joy_in_daily_life/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>As per title, what are some little ways you make your daily life more enjoyable and fulfilling as a working adult in SG? Or maybe items that increase your quality of life?</p>\n\n<p>So many of us in SG (including myself) are hamsters on the capitalist treadmill, burnt out and living on autopilot. </p>\n\n<p>Wanna take a mid week pause to think about how I can create more intentionally happy moments, instead of feeling like I need to wait until retirement to start living. </p>\n\n<p>I’ll start! \n- I go for lunchtime yoga classes almost daily (using company wellness allowance)\n- Make a nice ice matcha latte to get through afternoon meetings\n- Nicer headset so that my ears don’t hurt after endless virtual calls </p>\n\n<p>What about you? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Is there a Side Hustle Culture in Singapore?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p71s7w/is_there_a_side_hustle_culture_in_singapore/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p71s7w/is_there_a_side_hustle_culture_in_singapore/",
      "pubDate": "Wed, 26 Nov 2025 07:40:19 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p71s7w/is_there_a_side_hustle_culture_in_singapore/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>For the past few months I have been hearing people in Singapore (via YouTube videos, Reddit) doing side hustles, and was wondering if this is common?</p>\n\n<p>For working adults that do side hustles, can you share your perspective on why you are doing them?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Facial reccs for sensitive skin",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7t3we/facial_reccs_for_sensitive_skin/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7t3we/facial_reccs_for_sensitive_skin/",
      "pubDate": "Thu, 27 Nov 2025 04:38:11 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p7t3we/facial_reccs_for_sensitive_skin/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Never done facial before but have been considering it lately. I have very sensitive skin (every other product makes me break out so I mainly only use facial cleanser) also don’t want to spend too much. I’m hoping to do some blackhead extractions + general cleansing etc </p>\n\n<p>Any reccs?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "how did Teens study in schools passed their Final exam post 1945?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p6yttc/how_did_teens_study_in_schools_passed_their_final/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p6yttc/how_did_teens_study_in_schools_passed_their_final/",
      "pubDate": "Wed, 26 Nov 2025 04:51:18 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p6yttc/how_did_teens_study_in_schools_passed_their_final/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Okay because when the Japanese Campaign hit and occupied Singapore the British Education system was rejected and in placed was the 昭南日本学園 (Shōnan Nihon gakuen) to promote Japanese wartime propaganda and Imperialistic Ideology (not a true reflection of Japanese Culture and history of that time) </p>\n\n<p>Assume a girl who was 13 years old in 1942, how would she have studied and passed her final exam in a English school after 1945?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Does anyone feel public transport quality is getting worse especially bus?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p6tqq7/does_anyone_feel_public_transport_quality_is/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p6tqq7/does_anyone_feel_public_transport_quality_is/",
      "pubDate": "Wed, 26 Nov 2025 00:43:21 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p6tqq7/does_anyone_feel_public_transport_quality_is/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>The trains are getting delays every other week but many are not reported anywhere.</p>\n\n<p>Bus timings are getting worse. Sinnce the articles on smrt not earning enough, the bus waiting time have been getting much worse.</p>\n\n<p>Within the first month of that report, there is a clear reduction in number of buses and intervals getting longer from 5min to 10min and now is 15min....</p>\n\n<p>Can&#39;t the CEO just take less bonus or at least provide quality and efficient service.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Kid birthday cake recommendations",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7mvhi/kid_birthday_cake_recommendations/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7mvhi/kid_birthday_cake_recommendations/",
      "pubDate": "Wed, 26 Nov 2025 23:25:01 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p7mvhi/kid_birthday_cake_recommendations/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi all, any recommendations for bakers that can make an Elsa doll cake? We don’t live in Singapore but will be relocating at the end of the year, so completely unfamiliar with what’s available. Any help would be much appreciated :) </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Anywhere to get a good chef's knife in Singapore?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p74d8p/anywhere_to_get_a_good_chefs_knife_in_singapore/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p74d8p/anywhere_to_get_a_good_chefs_knife_in_singapore/",
      "pubDate": "Wed, 26 Nov 2025 10:27:11 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p74d8p/anywhere_to_get_a_good_chefs_knife_in_singapore/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I like to cook and so far I&#39;ve just been using random knives that you can buy in most neighbourhood household shops or places like Daiso/Japan Home. But I&#39;m thinking about getting a proper chef&#39;s knife as an early Christmas gift myself.</p>\n\n<p>Looking for brands like Wusthof or Victorinox. Nothing too expensive (budget $200) but decent enough for daily use. I know I can buy online, but I would love a place where I can hold the knife to test the grip and weight before buying.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Working weekend jobs in addition to corporate jobs",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p721rr/working_weekend_jobs_in_addition_to_corporate_jobs/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p721rr/working_weekend_jobs_in_addition_to_corporate_jobs/",
      "pubDate": "Wed, 26 Nov 2025 07:56:50 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p721rr/working_weekend_jobs_in_addition_to_corporate_jobs/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi all,</p>\n\n<p>I am currently working a 9-7PM corporate job.</p>\n\n<p>I want to supplement my income through a weekend job. </p>\n\n<p>I want to do something that somehow contributes to the culture or running of SG.</p>\n\n<p>These are the 2 that most appeal to me:\n1. Working at a gallery or museum\n2. Doing some admin or back office stuff for a government agency.</p>\n\n<p>Wanting to know if anyone has ever done anything similar as weekend work and how it went.</p>\n\n<p>Is this even feasible given the current market?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "As an adult, how often do you bring your parents overseas?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p6zc00/as_an_adult_how_often_do_you_bring_your_parents/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p6zc00/as_an_adult_how_often_do_you_bring_your_parents/",
      "pubDate": "Wed, 26 Nov 2025 05:17:43 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p6zc00/as_an_adult_how_often_do_you_bring_your_parents/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi, asking how often as an adult (single/ partnered/ with kids), do you bring your parents overseas?</p>\n\n<p>Bringing overseas do involve abit more planning, with more rest stops, food options that they like, restroom stops, less walking, etc. Any tips/ hacks that would help bringing older parents overseas? Thank you!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How can I occupy your free time meaningfully in Singapore by besides working",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7jqci/how_can_i_occupy_your_free_time_meaningfully_in/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7jqci/how_can_i_occupy_your_free_time_meaningfully_in/",
      "pubDate": "Wed, 26 Nov 2025 21:14:49 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p7jqci/how_can_i_occupy_your_free_time_meaningfully_in/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I am on hospitalisation leave for sprained ankle, time passes slowly , and I do not know how to use it meaningfully.</p>\n\n<p>What are the meaningful things to do besides working in Singapore?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Kwan Im Thong Hood Cho Temple Experience",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p73ifb/kwan_im_thong_hood_cho_temple_experience/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p73ifb/kwan_im_thong_hood_cho_temple_experience/",
      "pubDate": "Wed, 26 Nov 2025 09:33:13 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p73ifb/kwan_im_thong_hood_cho_temple_experience/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I heard the lots are very accurate. Does anyone have any stories to share? Would be interested to know!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Where to find alt shoes (Those type of goth boots/shoes)",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p77syc/where_to_find_alt_shoes_those_type_of_goth/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p77syc/where_to_find_alt_shoes_those_type_of_goth/",
      "pubDate": "Wed, 26 Nov 2025 13:31:54 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p77syc/where_to_find_alt_shoes_those_type_of_goth/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been trying to find stores with more alt clothing but i dont have shoes that fit at all... just sneakers or running shoes </p>\n\n<p>just wondering where would be a good place specifically for the shoes? my budget is $50~ but not sure if can find in a physical store for such price </p>\n\n<p>Thank you! </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Has anyone used their ActiveSG credits already?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p73rgx/has_anyone_used_their_activesg_credits_already/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p73rgx/has_anyone_used_their_activesg_credits_already/",
      "pubDate": "Wed, 26 Nov 2025 09:49:24 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p73rgx/has_anyone_used_their_activesg_credits_already/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I tried using the ActiceSG credit today for a fitness class but it doesn’t allow to use the full credit, only partial deduction even though I have enough credits to cover the entire class fee. Anyone encounter similar situation?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Anybody been to the AFA afterparty before?",
      "link": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7qqli/anybody_been_to_the_afa_afterparty_before/",
      "guid": "https://redlib.perennialte.ch//r/askSingapore/comments/1p7qqli/anybody_been_to_the_afa_afterparty_before/",
      "pubDate": "Thu, 27 Nov 2025 02:32:50 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/askSingapore/comments/1p7qqli/anybody_been_to_the_afa_afterparty_before/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Not sure if should be asked here but just wanted to know how the experience was like and if it was worth goin.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    }
  ],
  "group": "country",
  "url": "https://redlib.perennialte.ch/r/askSingapore.rss",
  "lastFetched": "2025-11-27T04:46:39.942Z"
}