{
  "title": "Browsers & Browser technology",
  "description": "Topics on web browsers.",
  "link": "",
  "items": [
    {
      "title": "Browser Recommendation Megathread - November 2025",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1ome8nf/browser_recommendation_megathread_november_2025/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1ome8nf/browser_recommendation_megathread_november_2025/",
      "pubDate": "Sun, 2 Nov 2025 10:47:39 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1ome8nf/browser_recommendation_megathread_november_2025/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>There are constantly a zillion, repetitive &quot;Which browser should I use?&quot;, &quot;What browser should I use for [insert here]&quot;, &quot;Which browser should I switch to?&quot;, &quot;Browser X or Browser Y?&quot;, &quot;What&#39;s your favorite browser?&quot;, &quot;What do you think about browser X? and &quot;What browser has feature X?&quot; posts that are making things a mess here and making it annoying for subscribers to sort through and read other types of posts.</p>\n\n<p><em>If</em> you would like to keep the mess under control a little bit, instead of making a new post for questions like the above, ask in a comment in this thread instead. Then, one can choose to follow this thread if they want. Or, post in <a href=\"/r/suggestabrowser\">r/suggestabrowser</a>.</p>\n\n<p>Previous Recommendation Megathread: <a href=\"/r/browsers/comments/1nxmwt8/browser_recommendation_megathread_october_2025/\">https://www.reddit.com/r/browsers/comments/1nxmwt8/browser_recommendation_megathread_october_2025/</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "X CountryBadge: See their real country and App Store region",
      "link": "",
      "guid": "",
      "pubDate": "Sat, 29 Nov 2025 03:01:57 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p9dxlq/x_countrybadge_see_their_real_country_and_app/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I built <a href=\"https://buildmelon.com/x-countrybadge/\">X CountryBadge</a> to help users verify account locations. </p>\n\n<p>When you click the new pin icon next to any username, the extension fetches that specific account&#39;s location information and displays it right there on your timeline.</p>\n\n<p><strong>Features:</strong></p>\n\n<ul>\n<li>Instantly reveals the country of origin for any account</li>\n<li>Toggle between Flag or Text display modes</li>\n<li>Hover over the badge to see the connected App Store region </li>\n<li>Unlimited fetches, free to use</li>\n<li>Runs entirely locally on your browser for privacy</li>\n</ul>\n\n<p>It is available now on the <a href=\"https://chromewebstore.google.com/detail/fldiebelpcgjgdlmkmbohiljpkdeillj?utm_source=item-share-cb\">Chrome Web Store</a> and <a href=\"https://addons.mozilla.org/en-US/firefox/addon/x-countrybadge/\">Firefox Add-ons</a>.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "I lost all my sessions/tabs after trying to move Brave's cache to another folder. And now I have learned.",
      "link": "/img/kaqvqjftd44g1.png",
      "guid": "/img/kaqvqjftd44g1.png",
      "pubDate": "Sat, 29 Nov 2025 07:37:37 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p9iztz/i_lost_all_my_sessionstabs_after_trying_to_move/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I have been using Brave for many years without issues, but for the past few weeks whenever I use it to download files from MEGA, MEGA would sometimes pause midway to tell me to free up space. Now if anyone of you are familiar with MEGA, you know that it does not download the file directly and instead, downloads the whole file on a webpage (it writes to the browser&#39;s cache directory) before your choose a location to store that file (move cache to the destination folder). The issue with this way of downloading is that cache sometimes does not get deleted after file downloads, so you would have a massive data folder in brave&#39;s installation directory.</p>\n\n<p>I still have 15G left on my C drive so in theory this shouldn&#39;t be a problem (I always download to drive D and E, never drive C), but since this error keeps popping up, yesterday I decided to move Brave&#39;s entire data folder to drive D, which has more than 1T available. And this is when the nightmare starts.</p>\n\n<p> </p>\n\n<p>According to Google and even Brave themselves, this is where brave&#39;s data folder resides: C:\\Users\\&lt;Username&gt;\\AppData\\Local\\BraveSoftware\\Brave-Browser\\User Data. This folder contains your browsing history, sessions/tabs opened, bookmarks, everything. So all I have to do is to map this to a folder on drive D, right? Well sort of. After some failed attempts I was able to create a symbolic link that connects this folder to a folder on drive D. Once the link is correctly established, everything started working as they should, history is there, tabs are there. If the link isn’t done properly then I lose history, tabs, passwords, etc. basically all user data. That’s how I know the link works. Well, everything works, except when I download from MEGA it still writes to C drive.</p>\n\n<p> </p>\n\n<p>So I pulled up resource monitor to see where all that traffic is going, and when Brave downloads I can see it writing to a folder called data in Brave&#39;s installation directory, in my case C:\\SW\\Brave\\data, this is the location where I installed brave, and brave seems to keep cache here instead of the aforementioned users/appdata folder. But the confusing thing is, the contents in this folder is nearly identical to the aforementioned appdata folder. File and folder names were the same, even folder size were similar. I have never seen a browser keeping 2 identical copies of user data, but oh well. I created another symbolic link that redirects cache to drive D, and this time MEGA is finally writing to Drive D.</p>\n\n<p> </p>\n\n<p>Looking back I really wish I could have stopped here, but I was just too curious. I have never seen a browser keeping 2 identical copies of user data in different locations. I was not using any backup software, nor do I have windows restore point enabled, and that rules out the possibility of windows doing the backup for me. Everything tells me that one of the two folders isn’t being used.</p>\n\n<p> </p>\n\n<p>So, you guessed it, I deleted C:\\SW\\Brave\\data first, thinking it was this folder. Got a brave window with no prior sessions, tabs or history. Must be the other folder I thought, so I restored this folder and deleted the other one, and I was again greeted with the same blank page. I restored both folders, and guess what? Everything came back, the booksmarks, the history, the extensions, all there. Except the tabs. Before I started this whole thing I have 3 windows opened with around 40 tabs, and now they are gone.</p>\n\n<p> </p>\n\n<p>I spent the next 9 hours frantically googling, and came back with the reality that my tabs are really and truly, gone. Like a puff of smoke, never to be retrieved ever again. Brave stores your sessions in &lt;brave install directory&gt;\\data\\Default\\Sessions, in my case, C:\\SW\\Brave\\data\\Default\\Sessions. The unfortunate reality is they only keep 2 sessions. Your current session and your last session. What that means is, in the event of a crash, if you fail to restore the tabs (by clicking the restore last sessions button on the top right) and close Brave, your sessions are gone. Brave will overwrite the session files and no file recovery software will ever be able to retrieve these files ever again, because these files were not deleted, they were overwritten. If you have a hard drive there’s maybe a 0.5% chance that you can retrieve them. If like every laptop these days you have SSD, they are gone. TRIM makes sure everything that isn’t needed is wiped. You can put a person in there and the moment he isn’t needed he would dematerialize.  </p>\n\n<p> </p>\n\n<p>I have learnt my lesson. I have installed a session manager plugin that saves all my sessions at regular intervals, both locally and on cloud. I have made sure that I will never have another session/tab-related nightmare ever again, and I advise every chromium-based browser user to do the same, get an extension that backs up your tabs locally and on cloud at regular intervals. What happened today ruined my weekend, but it doesn’t have to ruin yours.</p>\n\n<p> </p>\n\n<p>To all the lost windows and tabs, I bid you farewell. You fought brilliantly on the forefront before losing to developer neglect and corporate incompetence. May we cross path again.</p>\n\n<p> </p>\n\n<p>To developers of chrome and all chromium-based browsers, for years a blue &#39;restore session&#39; button is all there is that separates a tiny island of hope from an unfathomable ocean of despair. The presence of such button inspires awe while the absence of it struck the deepest level of fear and terror. During these years, gigabytes have become terabytes, dialups have given way to fiber. Is it not finally time for you to move on from archiving a meager 2 sessions to the at least 200? Can us users finally not have to worry about losing all our cherished memories to the push of a button?</p>\n\n<p>TL;DR: brave browser using 2 folders in separate locations to store identical user data, including history, extensions, sessions, etc. Suspect one is not in use. Tried relocating both folders and was fine. Then tried deleting either of them. Lost all my tabs/sessions but not anything else. Despair. Installed tabs manager to prevent similar disasters. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Descarga cancelada sin motivo",
      "link": "",
      "guid": "",
      "pubDate": "Sat, 29 Nov 2025 08:19:14 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p9jorl/descarga_cancelada_sin_motivo/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Me pasa siempre que intento descargar algo, me tiene harto, no pude encontrar nunca una solución. Tengo conexión a internet y funciona perfectamente, no se por qué se me cancelan todas las descargas, solo me pasa en el PC, probé en todos los navegadores (Brave, OperaGX, Edge, Chrome) y tienen el mismo problema. Actualicé todos mis drivers y no ayudó para nada</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "background services",
      "link": "/img/nxcb418z414g1.png",
      "guid": "/img/nxcb418z414g1.png",
      "pubDate": "Fri, 28 Nov 2025 17:06:52 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p904t8/background_services/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I no longer use Brave, but I want to keep it installed. How can I prevent these services from running?</p>\n\n<p>I already tried removing them from the task scheduler, but it didn&#39;t work.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Some websites will not load on my PC why",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p9ch40/some_websites_will_not_load_on_my_pc_why/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p9ch40/some_websites_will_not_load_on_my_pc_why/",
      "pubDate": "Sat, 29 Nov 2025 01:50:03 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p9ch40/some_websites_will_not_load_on_my_pc_why/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Certain websites that I have previously been able to operate on perfectly will not work for me. I either get a &quot;404 Forbidden Cloudflare&quot;, just a wall of text where the content should be, or it just loads forever. I have tried 4 different browsers, removing all extentions, using a VPN, and reaching out to customer service where all they tell me is &quot;try different browsers and remove extentions&quot;. The sites work perfectly on my laptop and phone on the same network, but not my PC and its really really really really annoying. Am I getting detected as a bot or something idk</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Is Firefox really reliable?",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p9d56p/is_firefox_really_reliable/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p9d56p/is_firefox_really_reliable/",
      "pubDate": "Sat, 29 Nov 2025 02:22:54 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p9d56p/is_firefox_really_reliable/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I ask because, while searching seven or eight months ago, a problem arose with Firefox, It was discovered that it had changed its terms and conditions to sell your data and use it for AI. From that moment on, I thought it was untrustworthy, but now I want to know the opinion of people who are more knowledgeable about the subject. Has this problem been resolved? Am I exaggerating? Does Firefox have people&#39;s trust again?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Microsoft edge running 44 tabs when not open and taking all memory of pc",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p9ab12/microsoft_edge_running_44_tabs_when_not_open_and/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p9ab12/microsoft_edge_running_44_tabs_when_not_open_and/",
      "pubDate": "Sat, 29 Nov 2025 00:07:35 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p9ab12/microsoft_edge_running_44_tabs_when_not_open_and/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>ive noticed in task manager it will show microsoft edge (44) and when i click to end task it will QUICKLY fill back up to 30-40 Ive tried edge settings and nothing helped its starting to mess up the pc</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Brave vs Firefox",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p93npi/brave_vs_firefox/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p93npi/brave_vs_firefox/",
      "pubDate": "Fri, 28 Nov 2025 19:24:29 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p93npi/brave_vs_firefox/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"/preview/pre/z9vnpycdt14g1.png?width=507&amp;format=png&amp;auto=webp&amp;s=e29d7dd7e04dd995f9dbbb5abc60ea39a887da87\">Just Dave&#39;s Redistricting</a></p>\n\n<p><a href=\"/preview/pre/hw8648wdt14g1.png?width=501&amp;format=png&amp;auto=webp&amp;s=663b734b3e59a2137635643453703cce16adcfe3\">My normal tabs</a></p>\n\n<p><a href=\"/preview/pre/y5hej63et14g1.png?width=505&amp;format=png&amp;auto=webp&amp;s=007b08eb0350d8582929bcbc9998774dd6ecb08f\">Same four websites</a></p>\n\n<p>Hello, I&#39;ve been using Brave for a while but recently its been having a lot of lag and freezing problems, especially when using the website &#39;Daves Redistricting&#39;. I know the site will take up a lot of resources but its been much worse recently.</p>\n\n<p>I tried doing some tests to compare Brave and Firefox, and this is what I got. Brave was using less RAM but in some instances was using a crap ton of my CPU</p>\n\n<p>In terms of using not a lot of resources, what is the best browser to use? also why is brave taking up so much of my CPU and how do I fix that?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Are there any other Android browsers besides Samsung Internet that have stacked tabs?",
      "link": "/img/o2fpzxuafz3g1.jpeg",
      "guid": "/img/o2fpzxuafz3g1.jpeg",
      "pubDate": "Fri, 28 Nov 2025 11:19:42 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p8sfid/are_there_any_other_android_browsers_besides/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p8sfid/are_there_any_other_android_browsers_besides/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Chrome eats my RAM, recommend me another browser",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p97bas/chrome_eats_my_ram_recommend_me_another_browser/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p97bas/chrome_eats_my_ram_recommend_me_another_browser/",
      "pubDate": "Fri, 28 Nov 2025 21:55:42 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p97bas/chrome_eats_my_ram_recommend_me_another_browser/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I need one that seamlessly integrates bookmarks etc and isn’t resource intensive</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Quick fact check",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p8wamp/quick_fact_check/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p8wamp/quick_fact_check/",
      "pubDate": "Fri, 28 Nov 2025 14:33:09 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p8wamp/quick_fact_check/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>So I have seen a lot of RAM comparisons and used to believe them but now in recent times I believe that it depends and there is no right answer<br/>\nLike some browsers excel at multi tab low RAM usage other may seem to perform good but it is that they have better 1 tab RAM usage like CPU cores<br/>\nAnd also how much total and allocated RAM your system has and the RAM you have allocated</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Vivaldi and new tabs",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p8uww7/vivaldi_and_new_tabs/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p8uww7/vivaldi_and_new_tabs/",
      "pubDate": "Fri, 28 Nov 2025 13:31:24 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p8uww7/vivaldi_and_new_tabs/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I recently switched to Vivaldi as my main browser and it fits almost perfectly... But one thing makes me go insane. \nEach new tab is opening in a completely new window – it only transforms to a tab after I close it with X. \nI&#39;ve even reinstalled the whole thing, and for a few days it worked fine. Then the problem came back. I&#39;ve never heard anyone mentioning this. \nI work on different workspaces if it&#39;s relevant. The new window problem regards all of them... </p>\n\n<p>Could anyone share a fix or explain what is the source of the problem. It borderline makes me want to swap browsers completely. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "browsers with these requirements",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p8n4e3/browsers_with_these_requirements/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p8n4e3/browsers_with_these_requirements/",
      "pubDate": "Fri, 28 Nov 2025 05:46:07 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p8n4e3/browsers_with_these_requirements/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>For some time now, I have been needing more features that I consider necessary for my daily life. I use Brave, but for years the community has been asking for certain features, but apparently they don&#39;t care, so I need to change browsers.</p>\n\n<p>I only ask for these requirements:</p>\n\n<ul>\n<li>Optimal use of resources</li>\n<li>Ability to hibernate tabs</li>\n<li>Workspaces</li>\n</ul>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How Safe Is Shift Browser?",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p8klvt/how_safe_is_shift_browser/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p8klvt/how_safe_is_shift_browser/",
      "pubDate": "Fri, 28 Nov 2025 03:27:20 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p8klvt/how_safe_is_shift_browser/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>So I just installed shift browser, from the official website <a href=\"http://shift.com\">shift.com</a> </p>\n\n<p>And I have just been wondering if it was malware, or spyware. Mainly because I have seen people getting their into stolen, or having it installed on people&#39;s computer without them doing anything. </p>\n\n<p>So is it safe, is it malware?</p>\n\n<p>P.S. I have had a good experience so far, nothing bad. But very customizable.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What is the most compatible browser for iOS, Mac and Windows? I need specialy sync tabs and groups in all my devices, at this point I don't care about other functionalities.",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p8tki9/what_is_the_most_compatible_browser_for_ios_mac/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p8tki9/what_is_the_most_compatible_browser_for_ios_mac/",
      "pubDate": "Fri, 28 Nov 2025 12:24:59 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p8tki9/what_is_the_most_compatible_browser_for_ios_mac/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p8tki9/what_is_the_most_compatible_browser_for_ios_mac/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Looking for a fast and customizable browser",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p8p1n5/looking_for_a_fast_and_customizable_browser/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p8p1n5/looking_for_a_fast_and_customizable_browser/",
      "pubDate": "Fri, 28 Nov 2025 07:42:29 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p8p1n5/looking_for_a_fast_and_customizable_browser/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I recently made the switch to Linux in an attempt to free myself from the mega-corporations and I&#39;ve been using Opera so far since that&#39;s what I used on Windows.</p>\n\n<p>I&#39;ve really enjoyed the amount of customization and unique features that Opera provides, but the whole browser feels a bit bloated and somewhat questionable <strong>in my opinion.</strong> Anyways I&#39;ve gotten tired of the mild inconveniences and weirdness that I have to deal with when using Opera, it feels like it&#39;s not in my best interest and I would like to switch to something possibly better.</p>\n\n<p>Productivity and workspace management features don&#39;t matter to me, I just want a light, fast and highly customizable chromium-based browser that I don&#39;t have to worry about.</p>\n\n<p>This request might be too specific but I would appreciate any suggestions that are similar to what I described, thanks!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "The perfect browser doesn't exist for my case",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p8c9m6/the_perfect_browser_doesnt_exist_for_my_case/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p8c9m6/the_perfect_browser_doesnt_exist_for_my_case/",
      "pubDate": "Thu, 27 Nov 2025 20:30:12 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p8c9m6/the_perfect_browser_doesnt_exist_for_my_case/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>It irritates me not to find the perfect browser. It seems no one wants to do it. Many come close, in fact, ARC would be the closest to a perfect browser, but it&#39;s not perfect.</p>\n\n<p>I&#39;m looking for a browser that is like ARC, exactly like ARC, but with the possibility of opening web panels, as Vivaldi or Edge have.</p>\n\n<p>Edge or Vivaldi, or even Brave (although it doesn&#39;t have web panels yet, its sidebar is &quot;prepared&quot; for it) lack features that ARC has, such as profile management in the same window or a good design for vertical tabs.</p>\n\n<p>So there&#39;s no way to find the perfect browser, which for me would be ARC with web panels and the ability to open extensions in the side panel like Claude.</p>\n\n<p>In any case, this is just a venting post. For now, I&#39;ll stick with Brave, which lacks a lot, but at least has almost everything I&#39;m looking for.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "SnapText - Free Text Expander: Shortcuts, Snippets &amp; Templates for Productivity",
      "link": "https://chromewebstore.google.com/detail/snaptext-lightning-fast-t/efhoenaaemdphicpkiocfigdopekcgfc",
      "guid": "https://chromewebstore.google.com/detail/snaptext-lightning-fast-t/efhoenaaemdphicpkiocfigdopekcgfc",
      "pubDate": "Fri, 28 Nov 2025 04:56:33 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p8m8ct/snaptext_free_text_expander_shortcuts_snippets/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I kept copy-pasting the same customer support responses, email signatures, and code snippets over and over. TextExpander costs $96/year, and cloud-based alternatives felt overkill for what I needed.</p>\n\n<p><strong>Why I Think It&#39;s Different:</strong></p>\n\n<ul>\n<li>Completely free</li>\n<li>100% private (everything stays on your device)</li>\n<li>Works everywhere: Gmail, Notion, Slack, VS Code, Reddit, etc.</li>\n<li>Modern, clean UI with search and favorites</li>\n<li>No login or setup needed</li>\n</ul>\n\n<p><strong>Who It&#39;s For:</strong></p>\n\n<p>The ultimate text expander for Chrome. Create smart shortcuts and templates for instant productivity. Perfect for customer support, sales emails, developers, students</p>\n\n<p>Would genuinely love any feedback, feature requests, or even just to hear if you think text expanders are useful! Happy to answer questions.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "google’s Chromium team decides it will add JPEG XL support, reverses ‘obsolete’ declaration",
      "link": "https://devclass.com/2025/11/24/googles-chromium-team-decides-it-will-add-jpeg-xl-support-reverses-obsolete-declaration/",
      "guid": "https://devclass.com/2025/11/24/googles-chromium-team-decides-it-will-add-jpeg-xl-support-reverses-obsolete-declaration/",
      "pubDate": "Thu, 27 Nov 2025 07:36:12 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p7w95f/googles_chromium_team_decides_it_will_add_jpeg_xl/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p7w95f/googles_chromium_team_decides_it_will_add_jpeg_xl/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Private Mobile browser",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p8e3an/private_mobile_browser/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p8e3an/private_mobile_browser/",
      "pubDate": "Thu, 27 Nov 2025 21:54:15 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p8e3an/private_mobile_browser/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>What is a good PRIVATE browser for android.I don&#39;t want to hear Brave or Tor (Tor is too slow it&#39;s good but slow) something good,working and private.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Waterfox and User Javascript",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p8l1zd/waterfox_and_user_javascript/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p8l1zd/waterfox_and_user_javascript/",
      "pubDate": "Fri, 28 Nov 2025 03:51:37 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p8l1zd/waterfox_and_user_javascript/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m trying to install Waterfox <a href=\"http://6.6.5.1\">6.6.5.1</a> alongside Firefox 145.0.2 and use them for different purposes, but the user JavaScript (*.us.js) loader that works in Firefox doesn’t function at all in Waterfox.</p>\n\n<p><a href=\"https://github.com/xiaoxiaoflood/firefox-scripts\">https://github.com/xiaoxiaoflood/firefox-scripts</a></p>\n\n<p><a href=\"https://github.com/alice0775/userChrome.js\">https://github.com/alice0775/userChrome.js</a></p>\n\n<p>The icon for managing user scripts (rebuild_userChrome.uc.js) also doesn’t appear.<br/>\nI’ve checked the file locations repeatedly, and even copied the contents of the chrome folder that works in Firefox, but it was useless.</p>\n\n<p>toolkit.legacyUserProfileCustomizations.stylesheets is set to TRUE, but it’s grayed out and I can’t change it.<br/>\nIs there anyone who’s been able to use the custom scripts mentioned above in Waterfox?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Safe setup",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p8e1s6/safe_setup/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p8e1s6/safe_setup/",
      "pubDate": "Thu, 27 Nov 2025 21:52:14 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p8e1s6/safe_setup/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I’m a new Macbook user and want the safest setup for browsers possible.</p>\n\n<p><strong>My plan:</strong></p>\n\n<ul>\n<li>Use <strong>Safari with zero extensions</strong> for personal stuff (banking, email, accounts)</li>\n<li>Use a <strong>second browser</strong> (Brave / Firefox / or similar) <strong>ONLY for streaming movies or shady livestream sites</strong>, with an ad-block extension installed</li>\n<li>Never log in or enter passwords in the second browser</li>\n</ul>\n\n<p><strong>Questions:</strong></p>\n\n<ol>\n<li><strong>Can an extension in the second browser access Safari’s data</strong> like cookies, passwords, or history?</li>\n<li><strong>What are the actual risks</strong> of this setup?</li>\n<li><strong>Why might people warn against it?</strong></li>\n<li>Any concerns about malware, tracking, fingerprinting, or cross-browser leaks?</li>\n</ol>\n\n<p><strong>Goal:</strong></p>\n\n<p>A clean, private Safari for personal use, and a fully isolated “dirty” browser with adblockers for streaming sports and movies only, nothing more.</p>\n\n<p>Is this a safe and practical way to browse?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "[Natsumi + Floorp] Now with transparency!",
      "link": "/img/zqld3f0ctn3g1.png",
      "guid": "/img/zqld3f0ctn3g1.png",
      "pubDate": "Wed, 26 Nov 2025 20:18:20 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p7ianm/natsumi_floorp_now_with_transparency/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>My post yesterday got some decent attention, so I thought I&#39;d follow up with my final touches to Natsumi. New features are getting added all the time, v6 is just around the corner and I&#39;m so excited!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Need help running legacy IE VBA macro on modern Windows / Edge",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p8br7y/need_help_running_legacy_ie_vba_macro_on_modern/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p8br7y/need_help_running_legacy_ie_vba_macro_on_modern/",
      "pubDate": "Thu, 27 Nov 2025 20:07:19 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1p8br7y/need_help_running_legacy_ie_vba_macro_on_modern/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone,</p>\n\n<p>I have a VBA macro in Excel that used to extract data from a web page using Internet Explorer COM automation. The macro works by finding an existing IE window (Shell.Application + ie.document) and reading values from HTML elements.</p>\n\n<p>Since Internet Explorer was retired and replaced by Microsoft Edge, the macro no longer works. My attempts so far:</p>\n\n<p>Opening the page in IE Mode on Edge → macro cannot detect the page, still gives: &quot;Please open the eReferral page in IE first.&quot;</p>\n\n<p>Trying Selenium/Edge automation → works only by opening a new browser, but I really need the macro to work with the page already open like before.</p>\n\n<p>Enabling Internet Explorer in Windows Features → opening IE redirects automatically to Edge, so the macro still cannot detect the IE window.</p>\n\n<p>Essentially, the macro relies on the old IE COM object, and there seems to be no way to connect to an already open page in Edge or IE Mode.</p>\n\n<p>Question: Is there any way to:</p>\n\n<p>Re-enable a “real” Internet Explorer on Windows 10/11 so that VBA COM automation works like before? (Optimal solution).</p>\n\n<p>Or maybe make a legacy VBA macro detect and read a page in IE Mode on Edge?</p>\n\n<p>Any advice or workaround to keep this macro working as it did with IE would be greatly appreciated!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    }
  ],
  "group": "tech",
  "url": "https://redlib.perennialte.ch/r/browsers.rss",
  "lastFetched": "2025-11-29T08:48:21.719Z"
}