{
  "title": "Browsers & Browser technology",
  "description": "Topics on web browsers.",
  "link": "",
  "items": [
    {
      "title": "Browser Recommendation Megathread - December 2025",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pc37ef/browser_recommendation_megathread_december_2025/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pc37ef/browser_recommendation_megathread_december_2025/",
      "pubDate": "Tue, 2 Dec 2025 08:24:47 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pc37ef/browser_recommendation_megathread_december_2025/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>There are constantly a zillion, repetitive &quot;Which browser should I use?&quot;, &quot;What browser should I use for [insert here]&quot;, &quot;Which browser should I switch to?&quot;, &quot;Browser X or Browser Y?&quot;, &quot;What&#39;s your favorite browser?&quot;, &quot;What do you think about browser X? and &quot;What browser has feature X?&quot; posts that are making things a mess here and making it annoying for subscribers to sort through and read other types of posts.</p>\n\n<p><em>If</em> you would like to keep the mess under control a little bit, instead of making a new post for questions like the above, ask in a comment in this thread instead. Then, one can choose to follow this thread if they want. Or, post in <a href=\"/r/suggestabrowser\">r/suggestabrowser</a>.</p>\n\n<p>Previous Recommendation Megathread: <a href=\"/r/browsers/comments/1ome8nf/browser_recommendation_megathread_november_2025/\">https://www.reddit.com/r/browsers/comments/1ome8nf/browser_recommendation_megathread_november_2025/</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Is Edge still in the same state?",
      "link": "/img/9tgnxx4cpx4g1.jpeg",
      "guid": "/img/9tgnxx4cpx4g1.jpeg",
      "pubDate": "Wed, 3 Dec 2025 06:36:32 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pcx1fs/is_edge_still_in_the_same_state/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pcx1fs/is_edge_still_in_the_same_state/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "now donate right now",
      "link": "/img/mzf5jvp9cy4g1.png",
      "guid": "/img/mzf5jvp9cy4g1.png",
      "pubDate": "Wed, 3 Dec 2025 08:45:28 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pcz3i6/now_donate_right_now/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pcz3i6/now_donate_right_now/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Who told Norton they had to make a browser.",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pd2qi7/who_told_norton_they_had_to_make_a_browser/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pd2qi7/who_told_norton_they_had_to_make_a_browser/",
      "pubDate": "Wed, 3 Dec 2025 12:23:19 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pd2qi7/who_told_norton_they_had_to_make_a_browser/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Honestly Norton, avast and avg think they are badass publishing browsers with a flabbergasting amount of ads forced on you. Whoever is out here boosting their confidence, please stop. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Brave browser... (Claim vs reality)",
      "link": "/gallery/1pcas9n",
      "guid": "/gallery/1pcas9n",
      "pubDate": "Tue, 2 Dec 2025 15:06:27 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pcas9n/brave_browser_claim_vs_reality/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pcas9n/brave_browser_claim_vs_reality/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Zen vs Floorp vs Waterfox",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pd3pm7/zen_vs_floorp_vs_waterfox/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pd3pm7/zen_vs_floorp_vs_waterfox/",
      "pubDate": "Wed, 3 Dec 2025 13:09:33 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pd3pm7/zen_vs_floorp_vs_waterfox/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Which one is the best </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Preguntas para mejorar tu experiencia al cien por cien en internet",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pd6x7z/preguntas_para_mejorar_tu_experiencia_al_cien_por/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pd6x7z/preguntas_para_mejorar_tu_experiencia_al_cien_por/",
      "pubDate": "Wed, 3 Dec 2025 15:17:01 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pd6x7z/preguntas_para_mejorar_tu_experiencia_al_cien_por/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hola queridos amigos que siempre estáis atentos a las preguntas de otros algo de mucho agradecimiento me gustaría preguntarles una serie de preguntas muy importantes para mí yo creo que a vosotros también es pueden ser bastante útiles si contestais muchos lo que sabéis con vuestro conocimiento actualmente de internet podéis responderme lo que sepáis lo que no sepáis no pasa nada pero me podrías decir cuál es el mejor navegador que las cosas sean super fáciles de encontrar no haga falta ser experto en búsquedas por qué solo los expertos encuentran lo que buscan más fácil que los que no lo son y que pueda encontrar todo tipo de información que estén todos los datos que han existido han sido borrados, ocultados todo tipo de información que ha existido y va apareciendo esta la que más intentan tapar páginas todas las páginas webs que buscas por la barra de búsqueda y te salen da igual si no lo escribes como un experto porque puedes especificar lo que buscas o encontrar lo que buscas de forma muy fácil sin ser un experto y que sea seguro y si no es muy seguro dime qué tengo que hacer para tener la máxima seguridad posible y no me pase nada y que la mayoría de la información sean real no sea falsa que sea todo real o casi todo pero que no haya información falsa ni esas cosas o qué bloquee esos sitios utilizo un android y me cuesta muchimo encontrar lo que busco además me tiro horas preguntándole a la IA de Google y me dice mierda también utilizo esa IA para que me diga si la información es falsa o verdadera de los sitios web y te habla con demasiado realismo me refiero que es creo que es tan realista que al ser tan realista se podría saltar mucha información que podria ser la que estas buscando pero no sé si hacerle caso porque me da señales de que es falso pero no lo escanea y si me pudieras dar algo que escanee totalmente si es falso el sitio osea de estafad y si también pudiera identicar por foto si es un estafador o no el quien hay detras y darme toda la información posible y monstrarme una foto de el sino solo con la información me vale y que sea totalemte gratis o que los más importantes que son esas cosas se puedan utilizar de forma gratuita y y ilimitada y si que que sería la que estas buscando y es que lo que suelo buscar es muy difícil encontrar y muy específico y me he tirado años y he encontrado cosas de suerte pero sino ubiese tenido suerte pues seguiría igual buscando y buscando más años sin parar pero aun así sigo buscando y me tiro las veinticuatro horas de el día y encuentro cosas de suerte pero porque las veo en Instagram pero la mayoría son falsas actualmente lo que he encontrado tampoco es tan sorprendente he encontrado cosas como este foro y cosas así y el navegador pero es tan poco es nada del otro mundo también no te sale lo que buscas directamente o tienes que estar mucho rato buscando este pero me he enterado de lo de russia y la verdad es que no estoy muy seguro sobre todo porque russia me parece un sitio peligroso digitalmente además me he metido ya en muchos sitios como podría borrar la información mis datos y todo absolutamente y que no sepan nada de mí y me podrías responder otra cosa también esto aparte por sino me puedes responder a la otra información pero me gustaría que me respondieras a esto tambien como hago para buscar como un experto para encontrar todo lo que quiera cuáles son los trucos que utizan al buscar que sean los mejores trucos que existan que sea buscar añadiéndole a lo mejor caracteres o código o algo así que no sea pensar mucho si me pudieras contestar estaría muy agradecido muchísimas 🫂</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Are there any virtual machines I can use to play games with locally (non steam workshop) installed mods?",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pd6ldm/are_there_any_virtual_machines_i_can_use_to_play/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pd6ldm/are_there_any_virtual_machines_i_can_use_to_play/",
      "pubDate": "Wed, 3 Dec 2025 15:04:35 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pd6ldm/are_there_any_virtual_machines_i_can_use_to_play/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi all,</p>\n\n<p>As some of you know, Football Manager 26 was released and while it’s received terrible feedback I’m thoroughly enjoying it.  The game uses the Unity engine and demands a lot of computer power, making most laptops struggle to run it at high graphics settings.  Consequently, I’ve been using Boosteriod, a cloud-based gaming service. However, this means I can’t install mods. A few modders have gone to great lengths to enhance the game, but Boosteriod prevents me from using mods that are not on the steam workshop . I’m looking for software or browsers that allow me to run a virtual machine. This way I can install the game and enjoy it with good graphics and performance, fully appreciating its potential. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "I got tired of chrome",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pd4elp/i_got_tired_of_chrome/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pd4elp/i_got_tired_of_chrome/",
      "pubDate": "Wed, 3 Dec 2025 13:38:57 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pd4elp/i_got_tired_of_chrome/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I really love how my bookmarks and my history and tabs are sync between my pc and my phone , and i have a big bookmarks no browser import them correctly,  and my device struggling with chrome pc \nSo is there any browser for pc that sync for chrome , i think no is there ?\nIf it not then is there any low end browser for pc and mobile that keep sync together \nI heard about firefox forks but chatgpt told me its not sync with firefox phone \nSorry for my trash English..</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "O que fazer quando isto aparece?",
      "link": "/img/40i8jci9iz4g1.png",
      "guid": "/img/40i8jci9iz4g1.png",
      "pubDate": "Wed, 3 Dec 2025 12:41:26 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pd33k7/o_que_fazer_quando_isto_aparece/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Olá, estou a ter problemas em entrar num site e não sei como resolver. Se me puderem ajudar.<br/>\nO que fazer quando aparece isto?<br/>\nPede nome de utilizador e password</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "New \"feature\" on Edge Android by default",
      "link": "/img/pyyvetntwy4g1.png",
      "guid": "/img/pyyvetntwy4g1.png",
      "pubDate": "Wed, 3 Dec 2025 10:41:24 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pd0wz5/new_feature_on_edge_android_by_default/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pd0wz5/new_feature_on_edge_android_by_default/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "My experience with an antidetect browser AdsPower after a few months of real use",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pcrwcd/my_experience_with_an_antidetect_browser_adspower/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pcrwcd/my_experience_with_an_antidetect_browser_adspower/",
      "pubDate": "Wed, 3 Dec 2025 02:16:08 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pcrwcd/my_experience_with_an_antidetect_browser_adspower/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I’ve been testing different antidetect browsers lately because I needed something that could handle multiple accounts without mixing cookies, fingerprints, or browsing environments. AdsPower kept coming up, so I tried using it for a while. Here’s my honest take based on what I’ve seen while using it.</p>\n\n<p>Performance &amp; stability</p>\n\n<p>AdsPower’s whole thing is creating separate “browser profiles” that isolate cookies, local storage, fingerprints, and other identifiers. According to the official documentation, each profile runs in its own independent browser environment and generates its own device fingerprint.</p>\n\n<p>In real use, that means each profile basically behaves like a standalone Chromium instance. When I run several profiles at once, it works fine, but obviously the resource usage stacks because that’s just how multiple Chromium windows behave, not an AdsPower-specific issue.</p>\n\n<p>UI &amp; usability </p>\n\n<p>The interface matches what the website shows, including a dashboard for managing profiles, proxy management, team collaboration, automation tools, and extension settings.</p>\n\n<p>Creating a profile follows the official workflow: choose or generate a fingerprint, set up proxy info, select the browser core, and save. Nothing hidden or mysterious, just a lot of settings if you’re new to these tools. </p>\n\n<p>Features</p>\n\n<ol>\n<li><p>Fingerprint management It supports: Canvas, WebGL, AudioContext, timezone, language, font lists, geolocation and hardware info. You can either generate fingerprints automatically or import your own. </p></li>\n<li><p>Profile isolation Each profile has its own separate cookie jar and storage. AdsPower explicitly says profiles act like independent devices. </p></li>\n<li><p>Proxy integration The app supports multiple proxy types - HTTP, SOCKS5, SSH - exactly as stated on the website. </p></li>\n<li><p>Automation / RPA AdsPower includes an official “Robotic Process Automation” tool with a visual editor and support for recording actions. Their docs mention that workflows can be repeated across profiles. </p></li>\n<li><p>Team collaboration Teams can share profiles, assign roles, and set permissions. This is a documented feature.</p></li>\n<li><p>Extension support </p></li>\n</ol>\n\n<p>AdsPower supports extensions for both Chromium-based profiles and Firefox-kernel profiles. I’ve tested Chrome extensions in Chromium profiles and Firefox add-ons in the Firefox ones, both worked as expected. </p>\n\n<p><strong>Pros</strong> </p>\n\n<p>- Fingerprint control is detailed and adjustable </p>\n\n<p>- Profile isolation works as advertised </p>\n\n<p>- Built-in automation saves time for repetitive tasks </p>\n\n<p>- Chrome/Firefox extension support </p>\n\n<p>- Centralized dashboard for proxies and profiles </p>\n\n<p>- Team-friendly workflow system </p>\n\n<p><strong>Cons</strong> </p>\n\n<p>- Because each profile is a Chromium-based browser core, opening many at once consumes a lot of system resources </p>\n\n<p>- The amount of fingerprint settings can feel overwhelming for beginners, and there’s a learning curve before everything makes sense</p>\n\n<p>- Not meant for casual browsing. This is a work tool, not a replacement for your main browser</p>\n\n<p><strong>Overall</strong></p>\n\n<p>If you actually need an antidetect browser for things like multi-account workflows, AdsPower does what its documentation promises: isolated environments, fingerprint customization, automation, and team sharing. It’s not buggy or shady, just has a lot of features and settings because that’s what this kind of browser is for.</p>\n\n<p>If you’re just trying to avoid tracking in your normal daily browsing, this isn’t the right tool for that. It’s definitely more of a “professional/operations” type product.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Samsung Internet Browser vs Firefox - thoughts on privacy?",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pczu97/samsung_internet_browser_vs_firefox_thoughts_on/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pczu97/samsung_internet_browser_vs_firefox_thoughts_on/",
      "pubDate": "Wed, 3 Dec 2025 09:33:33 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pczu97/samsung_internet_browser_vs_firefox_thoughts_on/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m using Firefox on my S23, but honestly I&#39;m not loving the UI. The native Samsung Internet Browser just looks and feels better to me.</p>\n\n<p>I&#39;ve been reading up on it and apparently with an ad-blocker plus a few privacy tweaks, it can be pretty decent on the privacy front. I ran both browsers through sites like Cover Your Tracks and Browser Leaks, and Samsung Internet isn&#39;t actually that far behind Firefox in terms of fingerprinting resistance and tracking protection.</p>\n\n<p>What are your thoughts on using Samsung Internet vs sticking with Firefox for privacy? Is Firefox still significantly better even if the Samsung browser is tweaked, or is the gap smaller than people think?</p>\n\n<p>I saw this article but it is from 2021, unsure how much it changed - <a href=\"https://versusbattle.medium.com/battle-of-android-browsers-chrome-vs-firefox-vs-edge-vs-samsung-vs-opera-vs-brave-b5aa3ad6bacf\">https://versusbattle.medium.com/battle-of-android-browsers-chrome-vs-firefox-vs-edge-vs-samsung-vs-opera-vs-brave-b5aa3ad6bacf</a></p>\n\n<p>Would appreciate any insights from people who&#39;ve compared the two or made the switch either way.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Why do I need to constantly clear my full history in Firefox?",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pcyu0a/why_do_i_need_to_constantly_clear_my_full_history/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pcyu0a/why_do_i_need_to_constantly_clear_my_full_history/",
      "pubDate": "Wed, 3 Dec 2025 08:27:57 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pcyu0a/why_do_i_need_to_constantly_clear_my_full_history/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>If I don&#39;t regularly clear my full history, Firefox crashes for me. This isn&#39;t true of any other browser I use, and I&#39;ve used pretty much every other popular browser. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Flakes: I'm building a keyboard-first browser",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pcoxqk/flakes_im_building_a_keyboardfirst_browser/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pcoxqk/flakes_im_building_a_keyboardfirst_browser/",
      "pubDate": "Wed, 3 Dec 2025 00:03:10 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pcoxqk/flakes_im_building_a_keyboardfirst_browser/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been using Vim-style extension years for browsing. As a KISS believer, I’m inspired by simplicity design from Vim, tmux and all classic &amp; modern browsers.</p>\n\n<p>Flakes is built on Webkit and only works on macOS now. Below are the current features and cores I stick to.</p>\n\n<p>- No tracking or registration(Only auto-upgrade check).</p>\n\n<p>- Ad blocking by default using uBOL rules.</p>\n\n<p>- Command palette to do everything.</p>\n\n<p>- Vim shortcuts to work with Insert / View / Bypass modes.</p>\n\n<p>- Distraction free focus mode.</p>\n\n<p>- AI feature is disabled by default.  </p>\n\n<p><em>Processing video plhx962kmv4g1...</em></p>\n\n<p>In this 30 seconds demo, I used Vim shortcuts to perform web browsing, and use Command Center(<code>⌘ K</code>) for manage everything else. Flakes is opionated, fast, native and privacy focused. Not everyone would like it, but if you do, let me know.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Net Surfer",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pcwxa4/net_surfer/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pcwxa4/net_surfer/",
      "pubDate": "Wed, 3 Dec 2025 06:29:49 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pcwxa4/net_surfer/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Great browser, very impressive, small workstation at one place</p>\n\n<p><a href=\"https://www.ssuiteoffice.com/software/netsurferwebbrowser.htm\">https://www.ssuiteoffice.com/software/netsurferwebbrowser.htm </a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Mobile browser that's fast and supports extension that allows easy private browsing option",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pcvost/mobile_browser_thats_fast_and_supports_extension/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pcvost/mobile_browser_thats_fast_and_supports_extension/",
      "pubDate": "Wed, 3 Dec 2025 05:20:53 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pcvost/mobile_browser_thats_fast_and_supports_extension/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been using iceraven for a long time now and while it&#39;s usually fine, there are many instances where links simply do not load. and there are other cases when it&#39;s just slow and doesn&#39;t support some links. the latter I assume is part of it being more secure and private, but sometimes it is frustrating when you&#39;re left wondering whether the internet is acting up or not. another issue I&#39;ve noticed is that its share screen is slow and odd to use.</p>\n\n<p>I&#39;ve used : Cromite, quetta, brave, vivaldi. I don&#39;t mind chrome or firefox based as long as its fast and supports ad block/ublock and some extensions. prefer moderate privacy too.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Has anyone else noticed browsers slowly drifting in different directions",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pcucrj/has_anyone_else_noticed_browsers_slowly_drifting/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pcucrj/has_anyone_else_noticed_browsers_slowly_drifting/",
      "pubDate": "Wed, 3 Dec 2025 04:11:57 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pcucrj/has_anyone_else_noticed_browsers_slowly_drifting/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I have been testing a few browsers lately and Neo ended up being the one I stuck with because the layout felt calmer. It made me realize how different browsers prioritize totally different things now. Some push features, some push speed, some push minimalism. What direction do you think browsers should be moving toward.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Recommendations for Browser with extensions support for iOS",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pcrjig/recommendations_for_browser_with_extensions/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pcrjig/recommendations_for_browser_with_extensions/",
      "pubDate": "Wed, 3 Dec 2025 01:59:43 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pcrjig/recommendations_for_browser_with_extensions/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Someone knows a good one ? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "I need browser that has practically no features, for the purpose of consuming as little ram as possible",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pcr6vm/i_need_browser_that_has_practically_no_features/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pcr6vm/i_need_browser_that_has_practically_no_features/",
      "pubDate": "Wed, 3 Dec 2025 01:43:59 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pcr6vm/i_need_browser_that_has_practically_no_features/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>You know why.</p>\n\n<p>I know of the big ones edge is surprisingly the most lightweight, but is any more lightweight that even that? This is only for use while I&#39;m gaming so I don&#39;t give a shit about features, just need it to have a search function</p>\n\n<p>bonus points if it has tab groups but I don&#39;t really care</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Audible Web Player is not working on the main Brave browser.",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pctgy2/audible_web_player_is_not_working_on_the_main/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pctgy2/audible_web_player_is_not_working_on_the_main/",
      "pubDate": "Wed, 3 Dec 2025 03:29:18 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pctgy2/audible_web_player_is_not_working_on_the_main/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Has any Brave user managed to figure out why the Audible website does not work in the Brave browser? It works in the Brave Nightly version, but it will not work in the main version. Do you happen to have an idea on how to fix it?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What’s the best minimal setup for private browsing in 2025?",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pce069/whats_the_best_minimal_setup_for_private_browsing/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pce069/whats_the_best_minimal_setup_for_private_browsing/",
      "pubDate": "Tue, 2 Dec 2025 17:07:31 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pce069/whats_the_best_minimal_setup_for_private_browsing/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Been watching Watchman Privacy lately and trying to simplify. If you could only pick one browser, one search engine, and one VPN for private use, what combo are you using right now?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Multilogin proxies not working for Google accounts loging – support unhelpful",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pcld6n/multilogin_proxies_not_working_for_google/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pcld6n/multilogin_proxies_not_working_for_google/",
      "pubDate": "Tue, 2 Dec 2025 21:38:13 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pcld6n/multilogin_proxies_not_working_for_google/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone,</p>\n\n<p>I’ve been trying to use Multilogin to create and log into Google accounts. According to their advertising, their proxies and profiles should allow you to manage multiple Google accounts without verification issues.</p>\n\n<p>However, in my experience:</p>\n\n<ul>\n<li>Creating a new Google account using Multilogin proxies <strong>requires scanning a QR code with a real device</strong>, whereas normally it only asks for phone verification.</li>\n<li>Logging into existing Google accounts also triggers <strong>phone verification or QR scanning</strong>, even after entering the correct password.</li>\n<li>When I use my <strong>default browser with my real IP</strong>, Google only asks for a <strong>simple reCAPTCHA</strong>, never phone or QR verification.</li>\n</ul>\n\n<p>I contacted Multilogin support, and their response was basically:</p>\n\n<blockquote>\n<p>“This also happens in standard browsers, it’s just a recent update to Google’s security and privacy policy. We currently don’t have a workaround.”</p>\n</blockquote>\n\n<p>So basically, <strong>the online support was not helpful at all</strong>, and the product is not functioning as advertised for Google accounts.</p>\n\n<p>Has anyone else experienced this? Are there any workarounds or settings that actually allow you to use Multilogin proxies with Google?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How do you change your website from www. to http.?",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pct368/how_do_you_change_your_website_from_www_to_http/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pct368/how_do_you_change_your_website_from_www_to_http/",
      "pubDate": "Wed, 3 Dec 2025 03:11:04 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pct368/how_do_you_change_your_website_from_www_to_http/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I created a business website using squarespace. We’ll say the website is called Camaro.com. If I type “Camaro.com” into the search engine it brings up the wrong website. If I type “www.Camaro.com” into the search engine, the correct website comes up. </p>\n\n<p>How do I make it so that when someone types in “Camaro.com”, it comes up with the correct website?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How do I get this functionality?",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1pci182/how_do_i_get_this_functionality/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1pci182/how_do_i_get_this_functionality/",
      "pubDate": "Tue, 2 Dec 2025 19:32:46 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/browsers/comments/1pci182/how_do_i_get_this_functionality/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>In Firefox I&#39;m able to use Ctrl+B to open the bookmarks sidebar, and all my bookmarks are listed, I can even being typing immediately to search bookmarks. I don&#39;t use the bookmarks top bar.</p>\n\n<p>I exported my Firefox bookmarks to an HTML file, imported that into Brave, used the built-in bookmarks manager to move them from All Bookmarks &gt; Imported to All Bookmarks &gt; Bookmarks folder. </p>\n\n<p>So I have to use Ctrl+B to open the sidebar, click into Bookmarks, and then if I want to search I have to click into the search bar. Doesn&#39;t sound like much but I do this a lot and it adds up over time.</p>\n\n<p>How can I manage Brave bookmarks so I can, at minimum use Ctrl+B to open the side bar displaying all my bookmarks, and ideally with the ability to immediately type to search bookmarks?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    }
  ],
  "group": "tech",
  "url": "https://redlib.perennialte.ch/r/browsers.rss",
  "lastFetched": "2025-12-03T15:46:55.668Z"
}