{
  "title": "Microsoft Edge",
  "description": "Microsoft Edge, making the web better through more open source collaboration.",
  "link": "",
  "items": [
    {
      "title": "Edge won't stop opening on windows startup (even after I disabled the setting)",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9qpoc/edge_wont_stop_opening_on_windows_startup_even/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9qpoc/edge_wont_stop_opening_on_windows_startup_even/",
      "pubDate": "Sat, 29 Nov 2025 14:47:58 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9qpoc/edge_wont_stop_opening_on_windows_startup_even/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Every time I re-start (windows 11) Microsoft Edge opens automatically.<br/>\nI do not want this.</p>\n\n<p><strong>Things I have tried that did not work:</strong><br/>\n1) Disabled it under Startup Apps in Task Manager</p>\n\n<p>2) Confirmed that it is disabled under Widows Settings &gt; Startup<br/>\n- Disabled &quot;Automatically Save restartable Apps when I sign out</p>\n\n<p>3) Opened Edge Settings &gt; System &amp; Performance &gt;<br/>\n   - Disabled Startup Boost<br/>\n   - Disabled &quot;Continue Running Background Extensions when Edge is Closed&quot;</p>\n\n<p>4) Changed the Edge autostart settings in the registry  regedit.exe<br/>\n  (removed  Data:[address of Edge] from AutoRunOnLogon)</p>\n\n<p>5) Re-started (more than once) after these attempts.</p>\n\n<p>It&#39;s STILL popping up every time I start.<br/>\nDoes anyone have other suggestions?    </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Clearing Cookies on Exit - Exceptions List",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9vsqy/clearing_cookies_on_exit_exceptions_list/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9vsqy/clearing_cookies_on_exit_exceptions_list/",
      "pubDate": "Sat, 29 Nov 2025 18:19:04 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9vsqy/clearing_cookies_on_exit_exceptions_list/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Just noticed that Edge is back to clearing most cookies on exit including those for the sites on the exceptions list. </p>\n\n<p>Any reason for this, and is there a fix that I missed </p>\n\n<p>FYI The exceptions I added were under settings at <strong>Privacy, search, and services/Clear browsing data/Clear browsing data on close.</strong> </p>\n\n<p>i have the buttons for <strong>browsing history</strong> and <strong>cookies and other site data selected.</strong> </p>\n\n<p>The exceptions I added were at  <strong>Don&#39;t clear</strong></p>\n\n<p>Is there a particular format to use when adding to the don&#39;t clear list?   </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Edge Dev crashes on the third press of the F11 key",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9tp3s/edge_dev_crashes_on_the_third_press_of_the_f11_key/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9tp3s/edge_dev_crashes_on_the_third_press_of_the_f11_key/",
      "pubDate": "Sat, 29 Nov 2025 16:53:10 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9tp3s/edge_dev_crashes_on_the_third_press_of_the_f11_key/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m hoping some developers working on Edge read this and fix this bug. I like using Wikipedia and Reddit (and other sites too) on full-screen mode and I don&#39;t really like how attempting to do that causes the browser to crash.</p>\n\n<p>This bug is reproducible. Edge Dev crashes exactly on the third press of the <code>F11</code> key. The interval between the presses seems to be indefinite, i.e., be it half a second or 15 minutes between presses, the browser will still crash on the third press of the <code>F11</code> key. I tried it on two different PCs, and they exhibit the same bug. The action of opening the window in full-screen mode doesn&#39;t seem to cause this because interacting with some on-page component to turn on full-screen — such as a button — doesn&#39;t seem to be the cause. I tried repeatedly turning full-screen on and off on YouTube and also using my JavaScript script several times, and the browser does not crash due to those actions. </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Copilot button and features missing",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9tjk5/copilot_button_and_features_missing/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9tjk5/copilot_button_and_features_missing/",
      "pubDate": "Sat, 29 Nov 2025 16:46:47 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9tjk5/copilot_button_and_features_missing/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>For a few weeks, the copilot button has been missing, and I have tried my best to fix it, but I couldn&#39;t  </p>\n\n<p>Clue that might help:<br/>\n1. The AI innovations section and Ask Copilot (when reading a pdf) are also missing from the Edge settings<br/>\n2. When I installed Edge Beta, the button and AI innovations section were there at first launch, then they were gone after the second launch ( I did not log in to the same Microsoft account )<br/>\n3. Same thing as the second one, but for another pc user account<br/>\n4. Same thing as the second one, but when the edge was updated<br/>\n5. The Copilot website works completely fine, even when logged in<br/>\n6. Copilot Vision works completely fine  </p>\n\n<p>things I have tried:<br/>\n1. resetting edge settings<br/>\n2. logging out and in<br/>\n3. Turning the copilot off and on<br/>\n4. Reinstalling Edge from settings<br/>\n5. Turning everything on related to Copilot in edge://flags<br/>\n6. Forcefully deleting Edge and reinstalling it from the official webpage<br/>\n7. Removing sync data and turning sync completely off<br/>\n8. Switching Microsoft account</p>\n\n<p>Related information:<br/>\nWindows 11 Pro latest update (10.0.26200 Build 26200)<br/>\nMicrosoft Edge is updated (Version 142.0.3595.94 (Official build) (64-bit))  </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Hong Kong",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9t37s/hong_kong/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9t37s/hong_kong/",
      "pubDate": "Sat, 29 Nov 2025 16:28:29 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9t37s/hong_kong/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>When I start up m computer Microsoft edge opens a tab about traveling to Hong Kong or about Hong Kong SAR. I never looked these up. I don&#39;t even use Microsoft edge. Does it just do this or do I have a virus???</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Removed my Microsoft account and lost my favorites and history. Can they be recovered?",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9ptkx/removed_my_microsoft_account_and_lost_my/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9ptkx/removed_my_microsoft_account_and_lost_my/",
      "pubDate": "Sat, 29 Nov 2025 14:08:19 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9ptkx/removed_my_microsoft_account_and_lost_my/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>|| || ||</p>\n\n<p>TLDR: Removed my Microsoft account from Edge, lost my list of favorite websites and browsing history. When I logged back in, they didn&#39;t come back. Any help?</p>\n\n<p>|| || ||</p>\n\n<p>Yesterday I opened my laptop, opened Edge, all my favorites (bookmarked websites) were there, I assume my browsing history was there too.</p>\n\n<p>Before I started doing anything, the account icon in the top right corner immediately caught my eye.</p>\n\n<p>It was highlighted in red, or yellow, I don&#39;t remember (using Dark Mode if that matters), and if I&#39;m remembering correctly, it was a login error and it was asking me to login manually into my Microsoft account.</p>\n\n<p>I don&#39;t know why it happened. It was showing the picture of my account, not a blank general account icon, so it was still somehow connected to Edge, it just had an issue.</p>\n\n<p>Now here&#39;s the thing. I generally don&#39;t like to log in with my account into Microsoft products I use. I prefer to use them while being &quot;off grid&quot; as much as possible. So if you asked me before yesterday&#39;s incident &quot;Are you logged in with your account in Edge?&quot; I would&#39;ve told you &quot;No&quot;.</p>\n\n<p>Given that principle, I assumed that I was never logged in, and Microsoft was just trying to rear its head into my user experience, so instead of re-logging in as it was asking me to do, I chose to remove the account completely.</p>\n\n<p>It warned me that I would be losing my browsing data, but I assumed that was just procedural warning they&#39;re obligated to give me regardless of my situation.</p>\n\n<p>I thought my browsing data was safely and locally stored on my device, independent of my account, and when I was gonna remove the account, I would still retain them on my machine.</p>\n\n<p>I was wrong. The moment I logged out, Edge restarted and everything was gone.</p>\n\n<p>I thought &quot;Well okay, maybe I was wrong, maybe I was logged in all this time and I just forgot about it. Let me log in again and restore my data&quot;.</p>\n\n<p>If it matters, I tried to log in yesterday and I kept getting &quot;You&#39;ve tried to sign in too many times with an incorrect account or password... Help us make sure you&#39;re not a robot.&quot;</p>\n\n<p>My credentials were correct, so I waited 24 hours before trying to log in again given the advice I found online when I googled the issue.</p>\n\n<p>And here I am after trying again 24 hours later. I was able to log in successfully.</p>\n\n<p>My old browsing history didn&#39;t return, and the favorites list that I got back was severely not up to date.</p>\n\n<p>I&#39;m guessing this has something to do with syncing, perhaps I had it turned off. But if it wasn&#39;t syncing my new favorited websites, why did it also remove them when I removed the account?</p>\n\n<p>Is there any chance that they are still locally stored on my laptop? Is there a chance that a system restore could undo the issue? Is there any other solution?</p>\n\n<p>Please let me know, I really need those favorited websites back.</p>\n\n<p>EDIT: I don&#39;t know if it matters, but when I logged out of my Microsoft account yesterday, it was replaced with an offline profile called &quot;Profile 2&quot; in the top right corner once Edge restarted. There were no bookmarks. I didn&#39;t like that it had a &quot;2&quot; there so I deleted it and it was replaced with &quot;Profile 1&quot;</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Unable to set Gmail as my default EMAIL handler in Microsoft Edge",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9i1hf/unable_to_set_gmail_as_my_default_email_handler/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9i1hf/unable_to_set_gmail_as_my_default_email_handler/",
      "pubDate": "Sat, 29 Nov 2025 06:40:15 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9i1hf/unable_to_set_gmail_as_my_default_email_handler/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>It all began with opening mailto links. When I was trying to open a mailto link in Microsoft Edge it was not opening anything. </p>\n\n<p>So, I went to GMAIL for setting it as my default EMAIL HANDLER. The icon for the handler was appearing at first, I clicked at the wrong button (to navigate to settings instead of allowing). Now the icon has disappeared and is not appearing.</p>\n\n<p>I have tried to remove all site permissions and cookies also. I have not found any settings related to EMAIL HANDLER (or Protocol Handler) as AI suggested. Then, I have even tried the registry editor to add a string value (RegisteredProtocolHandlers) but all in vain. I am still unable to open mailto links. Please help 😥 </p>\n\n<p><a href=\"/preview/pre/qqksovjv554g1.png?width=1071&amp;format=png&amp;auto=webp&amp;s=8cd54ebfe39124270c985600a9c077946063833d\">EMAIL HANDLER icon disappeared</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Control P captures small portion of Facebook post instead of all of it",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9cmyd/control_p_captures_small_portion_of_facebook_post/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9cmyd/control_p_captures_small_portion_of_facebook_post/",
      "pubDate": "Sat, 29 Nov 2025 01:58:08 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9cmyd/control_p_captures_small_portion_of_facebook_post/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I hope this is a good community to post this question in. I&#39;m trying to print a Facebook post with all of the comments. I know how to navigate to it and open up all the comments. Every time I try to look up the answer, the answer is do a right click and select print (or control P) and print to PDF. But that doesn&#39;t work because I end up with what is functionally the first page of what should be a 20 page document</p>\n\n<p>Is there a way to change the setting somehow so that I capture all of the post and comments instead of just what&#39;s visible on the screen at that moment? </p>\n\n<p>Thank you in advance! </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Can not verify i am human.....",
      "link": "https://redlib.perennialte.ch//r/CloudFlare/comments/1p9fprz/can_not_verify_i_am_human/",
      "guid": "https://redlib.perennialte.ch//r/CloudFlare/comments/1p9fprz/can_not_verify_i_am_human/",
      "pubDate": "Sat, 29 Nov 2025 04:32:42 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9fq38/can_not_verify_i_am_human/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9fq38/can_not_verify_i_am_human/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "There's weird freezing/stutter/lag sometimes with how the browser responds. How do I fix it?",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9afj0/theres_weird_freezingstutterlag_sometimes_with/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9afj0/theres_weird_freezingstutterlag_sometimes_with/",
      "pubDate": "Sat, 29 Nov 2025 00:13:19 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p9afj0/theres_weird_freezingstutterlag_sometimes_with/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Like, physically, it isn&#39;t frozen. But visually, it is. My computer is beefy enough, so I don&#39;t know what the issue is. The browser just takes a moment to catch up. Even on my shitty laptop this wasn&#39;t a problem. Is there any fix?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Where does Microsoft Edge get these accounts in the profile dropdown menu, and how can I remove them?",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p97rea/where_does_microsoft_edge_get_these_accounts_in/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p97rea/where_does_microsoft_edge_get_these_accounts_in/",
      "pubDate": "Fri, 28 Nov 2025 22:14:16 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p97rea/where_does_microsoft_edge_get_these_accounts_in/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Since the last update, Microsoft Edge has been displaying my accounts in this drop-down menu. None of these accounts are listed in the Windows settings under “My accounts.”</p>\n\n<p>I logged into Teams once with these accounts, and now I&#39;m wondering how I can remove these accounts from there, and above all, where do they come from if they don&#39;t even appear in the Windows settings?</p>\n\n<p><a href=\"/preview/pre/47k8d1h0o24g1.jpg?width=294&amp;format=pjpg&amp;auto=webp&amp;s=a6586c1d45db6b3dc470310ab36478257bf2f1b7\">/preview/pre/47k8d1h0o24g1.jpg?width=294&amp;format=pjpg&amp;auto=webp&amp;s=a6586c1d45db6b3dc470310ab36478257bf2f1b7</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Edge keeps freezing every few seconds then jumps to where its supposed to be (1.5 year later repost)",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8xf1e/edge_keeps_freezing_every_few_seconds_then_jumps/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8xf1e/edge_keeps_freezing_every_few_seconds_then_jumps/",
      "pubDate": "Fri, 28 Nov 2025 15:19:40 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8xf1e/edge_keeps_freezing_every_few_seconds_then_jumps/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I am reposting because its been almost A YEAR AND A HALF since my first post and STILL waiting for a fix. And on one post someone said they fixed it in a newer version but im on latest and it still occurs.</p>\n\n<p>Only happens during certain times of day, half the time I can use Edge for hours without this. Does not affect if the laptop (HP Victus 15) is on charge or not. I am on latest nvidia drivers but unsure if this is the cause. I havent been able to check task manager as I only have 1 screen and edge must be kept still for me to use the task manager without it dissapearing, but I think I did catch it once and there was no spike in usage.</p>\n\n<p>Even YouTube videos (audio is fine and 0 dropped frames reported) and even OTHER applications hovering (but not full screen) over Edge have the freezing too (e.g. if i hover over the calculator buttons, after the freeze those buttons all light up at the same time like it tries to catch up to where my cursor currently is)</p>\n\n<p>Title explanation: especially when scrolling, edge will lag for 1 second then &quot;jumps&quot; to where i would of scrolled to, youtube videos also pause then skip, and also effects hovering over buttons too (including other apps as long as edge is behind them), Basically unusable</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Freeze when watching YouTube on Edge",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8rk7f/freeze_when_watching_youtube_on_edge/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8rk7f/freeze_when_watching_youtube_on_edge/",
      "pubDate": "Fri, 28 Nov 2025 10:25:25 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8rk7f/freeze_when_watching_youtube_on_edge/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I have an AMD laptop, and lately my laptop sometimes freeze, not BSOD, the screen freeze, I cannot do anything except hold the power button to shutdown and turn it back on. The only common detail is that it&#39;s always happen when I watch YouTube on Edge?. This has happen before, and then don&#39;t happen for awhile, after 25H2 update (and some drivers auto update, some Edge updates too, honestly I have no idea what is the cause), it happen again, really frustrated. My laptop is Ideapad 5 Pro ryzen 7 6800HS, no dgpu, not open too much thing, just the browser.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Should this be fixed?",
      "link": "/img/bz89pmsox04g1.jpeg",
      "guid": "/img/bz89pmsox04g1.jpeg",
      "pubDate": "Fri, 28 Nov 2025 16:32:56 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8z93z/should_this_be_fixed/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hello, I’m experiencing an issue when trying to open a new tab in Microsoft Edge. Error codes appear and the tab doesn’t load properly. Could you please let me know how I might resolve this problem, and if there is an expected timeline for a fix? Thank you for your help.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "HELP - half the screen is BLANK when typing",
      "link": "/img/4irskdffvu3g1.jpeg",
      "guid": "/img/4irskdffvu3g1.jpeg",
      "pubDate": "Thu, 27 Nov 2025 20:01:11 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8blz0/help_half_the_screen_is_blank_when_typing/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>This is annoying as fuck. Anybody else experiencing the same issue on IOS recently? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Password manager primary password is not being recognized",
      "link": "/img/44482m61nv3g1.png",
      "guid": "/img/44482m61nv3g1.png",
      "pubDate": "Thu, 27 Nov 2025 22:56:50 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8fdol/password_manager_primary_password_is_not_being/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hopefully this isn&#39;t just happening to me. My set password for my browser to access password manager is giving me an authentication failed error. I have not changed the password and it was working fine as of yesterday. I am wondering if this is just a bug or my system is somehow not recognizing the password. I saw there was an article stating this issue as of November 3, 2025 with version 142.0.3595.53</p>\n\n<p>The suggestion is to backup my passwords and other stuff and delete the profile from my browser. I am just unsure if it will resolve the issue and give me more problems of losing potential data.</p>\n\n<p>I am on version 142.0.3595.94 (Official build) (64-bit). I have also already sent a help and feedback in.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Microsoft Edge Crashing AMD Drivers",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p89kwz/microsoft_edge_crashing_amd_drivers/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p89kwz/microsoft_edge_crashing_amd_drivers/",
      "pubDate": "Thu, 27 Nov 2025 18:35:10 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p89kwz/microsoft_edge_crashing_amd_drivers/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>So let me explain</p>\n\n<p>About a month ago, my AMD Drivers started to crash, so after much wasted time i uninstalled Microsoft Edge, and the Crashing of the Driver stopped ,</p>\n\n<p>For about 3 weeks ive had NO ISSUES whatsoever,  2 days i decided let&#39;s try it again i do enjoy Edge i prefer it over other web browsers yes i know i shouldn&#39;t be using it for the keyboard logging activity edge captures  and all the spying, and APIs that&#39;s hidden within the Browser but they all have that </p>\n\n<p>However, how is this even possible its a web browser i don&#39;t even need Edge opened and it does it because of the Edge services running quietly in the background </p>\n\n<p>i don&#39;t have any riser cable</p>\n\n<p>my system specs</p>\n\n<p>Asus x670e Crosshair Hero AMD 9900X , RADON 7900XTX 16GB of kingbank memory, and 3 NVMe drives </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "ME AJUDEM POR FAVOR meu histórico só estava mostrando de 16/11 depois de um tempo começou a aparecer até dia 30/10 não sei o que eu fiz, será que é possível que apareça o restante?tem algo que eu possa fazer? Olá, meu histórico só estava mostrando de 16/11 depois de um tempo começou a aparece",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8dnmj/me_ajudem_por_favor_meu_histórico_só_estava/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8dnmj/me_ajudem_por_favor_meu_histórico_só_estava/",
      "pubDate": "Thu, 27 Nov 2025 21:33:50 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8dnmj/me_ajudem_por_favor_meu_histórico_só_estava/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Olá, meu histórico só estava mostrando de 16/11 depois de um tempo começou a aparecer até dia 30/10 não sei o que eu fiz, será que é possível que apareça o restante?tem algo que eu possa fazer?</p>\n\n<p>Olá, meu histórico só estava mostrando de 16/11 depois de um tempo começou a aparecer até dia 30/10 não sei o que eu fiz, será que é possível que apareça o restante? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Scroll behaviour on touchscreens",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8digw/scroll_behaviour_on_touchscreens/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8digw/scroll_behaviour_on_touchscreens/",
      "pubDate": "Thu, 27 Nov 2025 21:27:05 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8digw/scroll_behaviour_on_touchscreens/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Since i was gifted a new Microsoft Surface 11 i am trying to use configure this machine as tablet-friendly as possible. Looking through various subs and threads i couldn&#39;t find any solution for the bad scrolling behavior in Microsoft Edge even though i set the correct smooth scroll options in edge://flags</p>\n\n<p>Any of you got an idea for a setting or extension which might help to adapt the scrolling behavior (inertia) in Microsoft Edge?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Olá, meu histórico só estava mostrando de 16/11 depois de um tempo começou a aparecer até dia 30/10 não sei o que eu fiz, será que é possível que apareça o restante?tem algo que eu possa fazer? Olá, meu histórico só estava mostrando de 16/11 depois de um tempo começou a aparecer até dia 30/10 não",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8bugk/olá_meu_histórico_só_estava_mostrando_de_1611/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8bugk/olá_meu_histórico_só_estava_mostrando_de_1611/",
      "pubDate": "Thu, 27 Nov 2025 20:11:14 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8bugk/olá_meu_histórico_só_estava_mostrando_de_1611/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Olá, meu histórico só estava mostrando de 16/11 depois de um tempo começou a aparecer até dia 30/10 não sei o que eu fiz, será que é possível que apareça o restante?tem algo que eu possa fazer?</p>\n\n<p>Olá, meu histórico só estava mostrando de 16/11 depois de um tempo começou a aparecer até dia 30/10 não sei o que eu fiz, será que é possível que apareça o restante? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Need help running legacy IE VBA macro on modern Windows / Edge",
      "link": "https://redlib.perennialte.ch//r/browsers/comments/1p8br7y/need_help_running_legacy_ie_vba_macro_on_modern/",
      "guid": "https://redlib.perennialte.ch//r/browsers/comments/1p8br7y/need_help_running_legacy_ie_vba_macro_on_modern/",
      "pubDate": "Thu, 27 Nov 2025 20:10:11 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8btjv/need_help_running_legacy_ie_vba_macro_on_modern/'>Comments</a>",
      "content": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8btjv/need_help_running_legacy_ie_vba_macro_on_modern/'>Comments</a>",
      "thumbnail": null
    },
    {
      "title": "Screenshot Tool not working on big webpage",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8a8yr/screenshot_tool_not_working_on_big_webpage/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8a8yr/screenshot_tool_not_working_on_big_webpage/",
      "pubDate": "Thu, 27 Nov 2025 19:03:00 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8a8yr/screenshot_tool_not_working_on_big_webpage/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hey there, I&#39;ve got an issue here. I want to to screenshots from a webpage, the thing is it&#39;s a really long one. My screenshot tool can take screenshots on normal webpages, but it&#39;s not working on this one. I want to zoom in and scroll down for long screenshots. This is why I want to use this edge screenshot tool and not snipping tool or any others.</p>\n\n<p>Anyone know how to work around that?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Olá, meu histórico só estava mostrando de 16/11 depois de um tempo começou a aparecer até dia 30/10 não sei o que eu fiz, será que é possível que apareça o restante?tem algo que eu possa fazer?",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p88twp/olá_meu_histórico_só_estava_mostrando_de_1611/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p88twp/olá_meu_histórico_só_estava_mostrando_de_1611/",
      "pubDate": "Thu, 27 Nov 2025 18:04:06 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p88twp/olá_meu_histórico_só_estava_mostrando_de_1611/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Olá, meu histórico só estava mostrando de 16/11 depois de um tempo começou a aparecer até dia 30/10 não sei o que eu fiz, será que é possível que apareça o restante? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Cached images?",
      "link": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8873j/cached_images/",
      "guid": "https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8873j/cached_images/",
      "pubDate": "Thu, 27 Nov 2025 17:38:37 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p8873j/cached_images/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hi folks - couldn&#39;t see anything obvious in a search of prior threads so forgive me if this has been answered before...</p>\n\n<p>Trying to obtain copies of images that I looked at in an Edge tab ~48h ago (car advert which has now been pulled off <a href=\"http://autotrader.co.uk\">autotrader.co.uk</a>, in case you&#39;re wondering), but this seems to be surprisingly difficult. How could I find these, or are they likely have gone from the cache by now? Or is this not at all possible?</p>\n\n<p>Thanks! 🙏🏻</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Home page looks like the chrome home page",
      "link": "/img/x3u3k36ket3g1.png",
      "guid": "/img/x3u3k36ket3g1.png",
      "pubDate": "Thu, 27 Nov 2025 15:05:31 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/MicrosoftEdge/comments/1p84etv/home_page_looks_like_the_chrome_home_page/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I have no idea how to change this or why it&#39;s even like this in the first place, any suggestions would help</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    }
  ],
  "group": "tech",
  "url": "https://redlib.perennialte.ch/r/MicrosoftEdge.rss",
  "lastFetched": "2025-11-29T19:27:13.692Z"
}