{
  "title": "Software - Anything software-related",
  "description": "Anything software-related. Please follow our rules to avoid getting punished.",
  "link": "",
  "items": [
    {
      "title": "Weekly Discovery Thread - November 28, 2025",
      "link": "https://redlib.perennialte.ch//r/software/comments/1p8t51q/weekly_discovery_thread_november_28_2025/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1p8t51q/weekly_discovery_thread_november_28_2025/",
      "pubDate": "Fri, 28 Nov 2025 12:01:11 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1p8t51q/weekly_discovery_thread_november_28_2025/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><h1>Share what’s new, useful, or just interesting</h1>\n\n<p>Welcome to the Weekly Discovery Thread, where you can share software-related finds that caught your attention this week - especially the stuff that’s cool, helpful, or thought-provoking but might not be thread-worthy on its own.</p>\n\n<p>This thread is your space for:</p>\n\n<ul>\n<li>Neat tools, libraries, or packages</li>\n<li>Articles, blog posts, or talks worth reading</li>\n<li>Experiments or side projects you’re working on</li>\n<li>Tips, workflows, or obscure features you discovered</li>\n<li>Questions or ideas you&#39;re chewing on</li>\n</ul>\n\n<p>If it relates to software and sparked your curiosity, drop it in.</p>\n\n<hr/>\n\n<h1>A few quick guidelines</h1>\n\n<ul>\n<li>Keep it civil and constructive - this is for learning and discovery.</li>\n<li>Self-promotion? Totally fine if it’s relevant and adds value. Just be transparent.</li>\n<li>No link spam or AI-generated content dumps. We’ll remove low-effort submissions.</li>\n<li>Upvote what’s useful so others see it!</li>\n</ul>\n\n<hr/>\n\n<p>This thread will be posted weekly and stickied. If you want to suggest a change or addition to this format, feel free to comment or <a href=\"/message/compose?to=/r/software\">message the mods</a>.</p>\n\n<p>Now, what did you find this week?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Why is Google still the dominant search engine in 2025 despite it getting worse and the rise of AI?",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pcoacy/why_is_google_still_the_dominant_search_engine_in/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pcoacy/why_is_google_still_the_dominant_search_engine_in/",
      "pubDate": "Tue, 2 Dec 2025 23:35:29 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pcoacy/why_is_google_still_the_dominant_search_engine_in/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Seems like everyone complains about Google Search, yet people still use it and don&#39;t switch search engines.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How to convert MP4 to DVD video without running into outdated tools?",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pcu4v8/how_to_convert_mp4_to_dvd_video_without_running/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pcu4v8/how_to_convert_mp4_to_dvd_video_without_running/",
      "pubDate": "Wed, 3 Dec 2025 04:01:05 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pcu4v8/how_to_convert_mp4_to_dvd_video_without_running/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve searched around here and most of the threads are a few years old. A lot of the recommended tools are outdated, barely maintained, or don&#39;t run well on current systems anymore.</p>\n\n<p>I still need to make proper DVD-Video discs for a couple of situations—mainly sending family videos to older relatives who only have a basic DVD player. So I&#39;m trying to figure out a current workflow.</p>\n\n<p>What I&#39;m aiming for:</p>\n\n<p>A DVD-Video disc that boots in a standard DVD player (not just a data disc with an MP4 on it).</p>\n\n<p>A tool that&#39;s still maintained, installs cleanly, and works on modern macOS.</p>\n\n<p>Ability to test the ISO before burning, plus any tips on media/burn speed that actually matters.</p>\n\n<p>If you&#39;ve done this recently, I&#39;d really appreciate your workflow. And if there are any tools you&#39;d avoid (old installers or constant crashes), I&#39;d love to know that too. Thanks in advance!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Uninstalr 3.0 Release Candidate",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pcxvgv/uninstalr_30_release_candidate/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pcxvgv/uninstalr_30_release_candidate/",
      "pubDate": "Wed, 3 Dec 2025 07:26:48 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pcxvgv/uninstalr_30_release_candidate/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>You can download Uninstalr 3.0 second public Release Candidate from this link: <a href=\"https://uninstalr.com/private/Uninstalr_Portable_v3_RC2b.exe\">https://uninstalr.com/private/Uninstalr_Portable_v3_RC2b.exe</a></p>\n\n<p>Uninstalr is an advanced software uninstaller that can automate the uninstallation of almost all software and also uses its own custom uninstallation engine to remove any leftovers. It also supports detecting leftovers from previously uninstalled software, and a lot of other powerful features. The full list of features is available at <a href=\"https://uninstalr.com/\">https://uninstalr.com/</a></p>\n\n<p>Here are some key improvements compared to the current official version (Uninstalr 2.8):</p>\n\n<ul>\n<li>The installed apps list now shows the country of origin for all known installed apps.</li>\n<li>The listing of paths before uninstallation starts now displays checkboxes, allowing users to uncheck any paths the user doesn’t want to be removed.</li>\n<li>The program now uses less RAM and performs the scan for installed software on average 40% faster.</li>\n<li>The main window bar now includes Settings and About buttons.</li>\n</ul>\n\n<p>Please note that this is <em>not the final version</em>. It may still contain bugs, so testing it on a virtual machine is recommended. Also, please don’t share this build publicly or upload it to download sites.</p>\n\n<p>If you find any issues, please let me know so I can fix them before the official release. If you are reporting any issues relating to uninstalling any specific software, please tell me which software you were trying to uninstall when the issue occurred so I can try to reproduce the issue and fix it.</p>\n\n<p>I&#39;m the developer of Uninstalr, so you can send any feedback here as a comment or directly to me via a private message.</p>\n\n<p>Thank you!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "I'm building a tool that auto-generates cable management solutions for your setup",
      "link": "/gallery/1pd31nh",
      "guid": "/gallery/1pd31nh",
      "pubDate": "Wed, 3 Dec 2025 12:38:52 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pd31nh/im_building_a_tool_that_autogenerates_cable/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hey everyone! 👋</p>\n\n<p>I’m working on a tool to help simplify cable management. The goal is to eliminate the guesswork around cable lengths, product choices, and routing methods. Instead of trial and error, users get a personalized, auto-generated solution based on their desk setup and specific needs.</p>\n\n<p>The tool is currently available online at: <a href=\"https://cabletoolkit.com/\">https://cabletoolkit.com/</a></p>\n\n<p>The idea is simple:</p>\n\n<ol>\n<li>You enter info about your desk, devices, and preferences</li>\n<li>The tool generates a custom cable management solution</li>\n<li>It shows it all in a 3D model of your workspace</li>\n<li>It also gives you a list of products you can use to execute the plan</li>\n</ol>\n\n<p>For anyone who&#39;s interested, I&#39;d love it if you tried it out. This is still an early version of the tool. Any input is super appreciated!</p>\n\n<p>I&#39;m also looking for alternative use cases for this software (facility mangement for example). If anyone has any ideas, I&#39;d really like to hear it!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Best open-source software that everyone needs to know about?",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pc6atl/best_opensource_software_that_everyone_needs_to/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pc6atl/best_opensource_software_that_everyone_needs_to/",
      "pubDate": "Tue, 2 Dec 2025 11:40:31 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pc6atl/best_opensource_software_that_everyone_needs_to/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>What&#39;s one piece of open-source software that everyone should use and know about?</p>\n\n<p>Vote on the best one in the comments.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "In Case You Missed It - Microsoft PC Manager is your free replacement/alternative to CCleaner",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pcsi57/in_case_you_missed_it_microsoft_pc_manager_is/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pcsi57/in_case_you_missed_it_microsoft_pc_manager_is/",
      "pubDate": "Wed, 3 Dec 2025 02:44:09 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pcsi57/in_case_you_missed_it_microsoft_pc_manager_is/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"/preview/pre/xlnoxrvxiw4g1.png?width=960&amp;format=png&amp;auto=webp&amp;s=5d4f988ba82d6610f179ee51d21529bd573774ef\">Screenshot of PC Manager doing a Health Check</a></p>\n\n<p>It&#39;s been 6+ months since i&#39;ve overhauled my PC from Win10 to Win11. PC Manager was just a blind background install as a backup to CCleaner. I left it running in &quot;background&quot; because it has an auto clean cache feature. FIrst time running a full &quot;Health Check&quot;. I have to say; the updated graphics is quite an improvement over CCleaner. Also i like that &quot;health check&quot; is something like an adhoc basic HWINFO screen of your PC innards.</p>\n\n<p>*(Though i still keep CCleaner around for harsher things like full Chrome/EDGE/Browser and registry cleanups).</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "What small changes improved your daily workflow",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pcxqpe/what_small_changes_improved_your_daily_workflow/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pcxqpe/what_small_changes_improved_your_daily_workflow/",
      "pubDate": "Wed, 3 Dec 2025 07:18:45 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pcxqpe/what_small_changes_improved_your_daily_workflow/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Sometimes tiny changes make differences. I tried Neo out of curiosity and did not expect the layout to reduce the\nmess in my work sessions, but it did.\nWhat software choices have changed your routine in a subtle but meaningful way?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Accidentally saved a client ~$30k a year just by watching how they actually worked",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pbtkf2/accidentally_saved_a_client_30k_a_year_just_by/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pbtkf2/accidentally_saved_a_client_30k_a_year_just_by/",
      "pubDate": "Tue, 2 Dec 2025 00:15:57 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pbtkf2/accidentally_saved_a_client_30k_a_year_just_by/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Earlier this year I was helping a small clinic that complained about “too much paperwork” and how it was slowing everything down.<br/>\nThey thought they needed some fancy AI system.<br/>\nThey didn’t.</p>\n\n<p>So instead of jumping straight into code, I hopped on a call with them for a few hours and watched what they actually did every day.<br/>\nTurned out half their “data entry” was literally just copy-pasting the same info between forms, spreadsheets, and emails.</p>\n\n<p>I built a simple workflow that:</p>\n\n<ul>\n<li>reads their intake forms</li>\n<li>fills out their spreadsheet automatically</li>\n<li>sends a summary email to the right staff</li>\n<li>stores a copy in their shared folder</li>\n</ul>\n\n<p>No fancy dashboards or complicated software to learn.<br/>\nJust connected what they were already using.</p>\n\n<p>Two weeks later, they told me it cut 10–12 hours of admin work a week.<br/>\nThat’s roughly ~$30k a year in saved time (i believe).</p>\n\n<p>The lesson for me: most businesses don’t need complicated systems, they just need less friction.<br/>\nIf you want to build automations that people actually use, start by watching what they already do instead of what they say they do.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Tasket++ — simple Windows tool to automate user actions, free and open source",
      "link": "/gallery/1pcykpz",
      "guid": "/gallery/1pcykpz",
      "pubDate": "Wed, 3 Dec 2025 08:10:46 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pcykpz/tasket_simple_windows_tool_to_automate_user/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Why you’ll actually use it<br/>\n- Silent, scheduled screenshots to monitor activity or create time-lapse logs.<br/>\n- Send messages from any app at a set time for reminders or coordinated notifications.<br/>\n- Replay exact mouse clicks and typed input for testing, demos, or repetitive workflows.<br/>\n- Prevent AFK detection with realistic simulated activity that looks natural.<br/>\n- Fade music and shut down the PC on a schedule to automate sleep or end-of-day routines.<br/>\n- Save automation presets and run them manually, at boot, or on a schedule.</p>\n\n<p>No scripting required. All actions run locally on your PC, can loop, trigger at startup, or follow a timetable.</p>\n\n<p>Download on Microsoft Store: <a href=\"https://apps.microsoft.com/detail/xp9cjlhwvxs49p\">https://apps.microsoft.com/detail/xp9cjlhwvxs49p</a><br/>\nSource code and issues: <a href=\"https://github.com/AmirHammouteneEI/ScheduledPasteAndKeys\">https://github.com/AmirHammouteneEI/ScheduledPasteAndKeys</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "The \"Storage Full\" panic: How to deal with thousands of duplicates.",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pd1zaf/the_storage_full_panic_how_to_deal_with_thousands/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pd1zaf/the_storage_full_panic_how_to_deal_with_thousands/",
      "pubDate": "Wed, 3 Dec 2025 11:42:54 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pd1zaf/the_storage_full_panic_how_to_deal_with_thousands/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>We all have this habit: You see something beautiful (a sunset, your pet, a group of friends), and you don&#39;t just take one photo. <strong>You take ten.</strong> Just to be safe. &quot;One of them has to be sharp,&quot; right?</p>\n\n<p>This behavior is smart in the moment - but it is a disaster for our phone storage later.</p>\n\n<p>Weeks go by, and suddenly that dreaded <strong>&quot;Storage Full&quot;</strong> notification pops up right when you want to take a video.</p>\n\n<p>The reality is: <strong>90% of your gallery consists of &quot;Safety Shots&quot; that you will never look at again.</strong> They are technically identical to the &quot;Good Shot,&quot; but they clog up your phone and force you to buy expensive cloud upgrades.</p>\n\n<p><strong>The Solution (The &quot;One Winner&quot; Rule):</strong> The only way to fix this without going crazy is to change how you view your camera roll. Treat it like a competition. For every cluster of 10 photos, there can only be <strong>one winner</strong>. The runner-ups don&#39;t get a participation trophy; they get deleted.</p>\n\n<p><strong>The Tool to make it bearable:</strong> Sorting through these duplicates manually is tedious and boring. That’s why my friends and I (we are three students) built <strong>Gallery Sort</strong>. It’s designed specifically for this &quot;Duplicate Problem.&quot;</p>\n\n<ul>\n<li><strong>Swipe Left:</strong> Delete the 9 bad &quot;safety shots.&quot;</li>\n<li><strong>Swipe Right:</strong> Keep the 1 perfect &quot;winner.&quot;</li>\n</ul>\n\n<p>It helps you clear out the junk in minutes instead of hours, saving you from that &quot;Storage Full&quot; panic without needing to upgrade your iCloud/Google Drive plan.</p>\n\n<p>We built this with 0€ budget as a passion project, so the basic cleaning features are completely free. Give it a try if your duplicates are getting out of hand!</p>\n\n<p>What are your thoughts on that? Do you also have to many photos in your gallery?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "I built a Windows tool that hides chosen windows from screen sharing by working at the composition layer",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pd0us9/i_built_a_windows_tool_that_hides_chosen_windows/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pd0us9/i_built_a_windows_tool_that_hides_chosen_windows/",
      "pubDate": "Wed, 3 Dec 2025 10:37:44 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pd0us9/i_built_a_windows_tool_that_hides_chosen_windows/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I have been experimenting with how Windows captures and composites windows for tools like Zoom, Teams, Google Meet and Discord. Most people assume a screen share shows everything on the monitor, but Windows actually gives apps a filtered version of the desktop via the composition layer.</p>\n\n<p>I wanted to see if it was possible to exclude a specific window from that capture. That turned into a little project called <em>Cloakly</em>. It creates an overlay window that only the user can see, while the screen sharing APIs receive a cleaned version with selected windows removed from the composition.</p>\n\n<p>I learned a lot digging through how Windows handles window surfaces, capture permissions and DWM behavior. If anyone is interested in the technical side, I’m happy to share what I found, how I avoided injecting anything into processes, and how I kept it lightweight so it works on Teams, Meet, Zoom and Discord.</p>\n\n<p>Link: <a href=\"https://www.getcloakly.com/\">https://www.getcloakly.com/</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Best identity and access management (IAM) systems for mid-size companies?",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pcaakt/best_identity_and_access_management_iam_systems/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pcaakt/best_identity_and_access_management_iam_systems/",
      "pubDate": "Tue, 2 Dec 2025 14:46:41 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pcaakt/best_identity_and_access_management_iam_systems/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Seeking help finding a solid identity and access management (IAM) tool for our mid-sized US based company. I’m getting worried that my team isn’t as organized as we need to be – our account logins are being stored manually, we have a semi-configured Azure AD tenant, and we keep realizing that our manual tracking is out of date, especially when folks are offboarding, but we lack the bandwidth to manage this more diligently by hand.😏</p>\n\n<p>I finally got budget approval this quarter to standardize via an IAM platform and I’m trying to quickly make a list of IAM tools that would serve us well and solve our organization problems. We only want to have one software though, so please don’t recommend a combo of tools. </p>\n\n<p>Primary goals are straightforward: SSO and MFA across roughly 80 SaaS apps, usable audit trails and access reviews for SOC 2, automated provisioning and deprovisioning tied to updates in our HR software. </p>\n\n<p>Questions for folks in this sub: for a mid-size org, do you recommend getting IT-specific software? Any specific recommendations for an IAM? Any options that integrate well with your HR software?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "I don't like the sidebar in windows file explorer, so I made a better version",
      "link": "/gallery/1pczd13",
      "guid": "/gallery/1pczd13",
      "pubDate": "Wed, 3 Dec 2025 09:02:34 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pczd13/i_dont_like_the_sidebar_in_windows_file_explorer/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Hello everybody,</p>\n\n<p>I&#39;ve been working on Dora, a custom file explorer, for a while now and there was something that was in need of an upgrade: The sidebar. So I looked at what windows offered and collected everything I didn&#39;t like about it. My list ended up being way longer than I thought, for such an essential feature.</p>\n\n<ul>\n<li>The sidebar is always there, there&#39;s no option to minimize. But since there&#39;s no splitting or complex operations anyway you don&#39;t really feel it. But since Dora offers a couple more options, that was a very important addition</li>\n<li>Pinned folders and system folders are treated the same and grouped together with other random folders, even though they&#39;re all very different</li>\n<li>Network drives are separated, probably because Microsoft wants to make OneDrive seem better or more important</li>\n<li>Sections can&#39;t be minimized, toggled on or off or changed in any meaningful way</li>\n</ul>\n\n<p>I tried adressing all pain points and came up with the new update 0.5.3. I am really happy how it turned out!</p>\n\n<p><a href=\"https://dora.achodev.me/\">https://dora.achodev.me</a></p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Looking for a SAFE video downloader—please help!",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pcrboe/looking_for_a_safe_video_downloaderplease_help/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pcrboe/looking_for_a_safe_video_downloaderplease_help/",
      "pubDate": "Wed, 3 Dec 2025 01:49:52 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pcrboe/looking_for_a_safe_video_downloaderplease_help/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve tried a few random tools I found online, but half of them asked for weird permissions or bombarded me with ads. I just want to download videos from social media (TikTok, Reels, YouTube Shorts) and maybe some movies—nothing fancy.</p>\n\n<p>But</p>\n\n<p>Bonus points if it lets me choose the video quality (1080p is a must!) and doesn’t make me install sketchy software (browser-based or a simple app would be ideal). Does anyone have a go-to tool that’s trustworthy and actually works? I’m tired of wasting time on duds! </p>\n\n<p>By the way, I&#39;ve found this one</p>\n\n<p><a href=\"/preview/pre/snrabio4aw4g1.png?width=748&amp;format=png&amp;auto=webp&amp;s=a17daf052edff5af2e1be03eb6ea840a59da8f52\">/preview/pre/snrabio4aw4g1.png?width=748&amp;format=png&amp;auto=webp&amp;s=a17daf052edff5af2e1be03eb6ea840a59da8f52</a></p>\n\n<p>but I’m not sure if it’s legally compliant—does anyone have insights on this or know of a fully legitimate alternative?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "idm alternatives",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pcxlqy/idm_alternatives/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pcxlqy/idm_alternatives/",
      "pubDate": "Wed, 3 Dec 2025 07:10:20 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pcxlqy/idm_alternatives/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>pretty much title. my life got amazingly easy with idm but now the 30 day trial is over. given ima brokeass college student, i cant even think about buying the lifetime supscription</p>\n\n<p>all i use it for is media downloads from many websites and grabbin whole ass videos from them somehow</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "FOSS alternative to Windows Voice Recorder (Win10) - simple interface, autosaving as compressed audio (mp3, m4a, ogg etc)",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pctph9/foss_alternative_to_windows_voice_recorder_win10/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pctph9/foss_alternative_to_windows_voice_recorder_win10/",
      "pubDate": "Wed, 3 Dec 2025 03:40:36 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pctph9/foss_alternative_to_windows_voice_recorder_win10/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Most of the recommendations I&#39;ve found via search engine are centered around stuff like Audacity, OBS, Reaper, etc</p>\n\n<p><strong>I don&#39;t want those options.</strong> I use them for other things and want to preserve their configurations for those tasks.</p>\n\n<p>There are two reasons why I want an alternative to Windows Voice Recorder:</p>\n\n<ol>\n<li>It struggles sometimes when saving longer recordings (1+ hour)</li>\n<li>There is no easy way to make it Always on Top</li>\n</ol>\n\n<p>I found Moo0 Audio Recorder and it seems OK. But it also crashes from time to time.</p>\n\n<p>I am looking for:</p>\n\n<ol>\n<li>Simple interface</li>\n<li>Saves as compressed audio automatically after recording ends</li>\n<li>Puts date and time info in filename</li>\n<li>Always on top function OR plays nice with MenuTools for always on top functionality (something about Win Voice Recorder doesn&#39;t use the older File Menu functionality, so MenuTools doesn&#39;t work for alway on top)</li>\n</ol>\n\n<p>Nice to have:</p>\n\n<ol>\n<li>Configure file saving directory</li>\n<li>Configure which microphone to use</li>\n<li>Custom file naming format</li>\n</ol>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Thinking about release pacing after an idea I saw mentioned on FaceSeek",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pc9cq8/thinking_about_release_pacing_after_an_idea_i_saw/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pc9cq8/thinking_about_release_pacing_after_an_idea_i_saw/",
      "pubDate": "Tue, 2 Dec 2025 14:07:55 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pc9cq8/thinking_about_release_pacing_after_an_idea_i_saw/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>While reviewing a small update cycle for one of my projects, I remembered a passing comment on FaceSeek about how people appreciate predictable rhythms more than fast bursts of changes. It made me rethink how frequently features should roll out, especially when users prefer stability over excitement. Adjusting pacing felt like a quiet but meaningful improvement. It reminded me that software isn’t just about adding features but about respecting how people use what already exists. These small considerations often shift the entire experience in subtle but important ways.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Software to quickly view and manage video files",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pclr7l/software_to_quickly_view_and_manage_video_files/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pclr7l/software_to_quickly_view_and_manage_video_files/",
      "pubDate": "Tue, 2 Dec 2025 21:53:14 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pclr7l/software_to_quickly_view_and_manage_video_files/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>All - My family has some forested property some hours away from where I live.  I have several trail cams that I use to track wildlife on the property.  I&#39;ve had 3 - 4 out for many years.  Since the property is remote I typically visit the cameras, swap out the SD cards, and bring them back home to watch them.  I normally load them all up in VLC player and just let them play.</p>\n\n<p>Well, I have accumulated many gigs of video files.  Most of them are not very exciting and I do not want to keep them.  However, I have not done a good job of organizing them.  They are all just in folders that is labeled with the date I collected the cards.</p>\n\n<p>So, my question is what is a free software package that I can use to quickly view and mange these files?  I would prefer a package that lets me load entire directories or folders to a play list, navigate that playlist via keyboard shortcuts (i.e. fast forward, rewind, next video), and also delete the file I am watching.</p>\n\n<p>Any ideas?  Thanks in advance!</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Can I watch the same movie with a friend with Syncplay using a different file?",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pcpya9/can_i_watch_the_same_movie_with_a_friend_with/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pcpya9/can_i_watch_the_same_movie_with_a_friend_with/",
      "pubDate": "Wed, 3 Dec 2025 00:47:42 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pcpya9/can_i_watch_the_same_movie_with_a_friend_with/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I now bought an OLED HDR Monitor and have been watching movies in HDR, HDR looks bad if you don&#39;t have an HDR monitor like my friend, can we watch the same movie but I use an HDR file and he doesn&#39;t? Both 4K.</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How do I upload a file to be check for malware?",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pcp67c/how_do_i_upload_a_file_to_be_check_for_malware/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pcp67c/how_do_i_upload_a_file_to_be_check_for_malware/",
      "pubDate": "Wed, 3 Dec 2025 00:13:25 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pcp67c/how_do_i_upload_a_file_to_be_check_for_malware/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve already tried VirusTotal, but they say that they won&#39;t go above 650MB, and my file is about 2.6GB. ANy help would be appreciated</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "37signals just open-sourced a new kanban tool (Fizzy)",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pcjhr6/37signals_just_opensourced_a_new_kanban_tool_fizzy/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pcjhr6/37signals_just_opensourced_a_new_kanban_tool_fizzy/",
      "pubDate": "Tue, 2 Dec 2025 20:27:20 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pcjhr6/37signals_just_opensourced_a_new_kanban_tool_fizzy/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><pre><code>37signals (the team behind Basecamp and HEY) just released Fizzy - an open source kanban tool. You can run it yourself for free or pay $20/month for hosted.\n\nI&#39;ve used Basecamp for years and took Fizzy for a spin today. What stood out wasn&#39;t just the fresh take, it&#39;s the attention to detail throughout. For anyone building software, it&#39;s worth poking around just to see how they handle the small stuff.\n\nSource code: https://github.com/basecamp/fizzy\n\nSite: https://fizzy.do\n\nAnyone else check it out? Curious what this community thinks.\n</code></pre>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Is there a free software or tool with which I can merge huge pictures together?",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pcjbg9/is_there_a_free_software_or_tool_with_which_i_can/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pcjbg9/is_there_a_free_software_or_tool_with_which_i_can/",
      "pubDate": "Tue, 2 Dec 2025 20:20:54 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pcjbg9/is_there_a_free_software_or_tool_with_which_i_can/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I merged many pictures together so I&#39;ve got 12x~120 MB pictures. Now I have to merge all of these 12 pictures to one picture. I&#39;ve used Batch Image Merger from Github but it cant merge all together using that tool because it gives out an error. Now I am looking for another tool or software with which I could merge all 12 pictures together. Do you have any suggestions?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "How to look for freelancing opportunities?",
      "link": "https://redlib.perennialte.ch//r/software/comments/1pcn3ff/how_to_look_for_freelancing_opportunities/",
      "guid": "https://redlib.perennialte.ch//r/software/comments/1pcn3ff/how_to_look_for_freelancing_opportunities/",
      "pubDate": "Tue, 2 Dec 2025 22:45:56 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pcn3ff/how_to_look_for_freelancing_opportunities/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>I have around 4 years of experience in backend development, my tech stack is java with spring, mySql and MongoDb and GCP for servers. </p>\n\n<p>I’m on notice period right now and Won’t be receiving my salary for the next 1.5 months and I have bills to pay. So i am thinking of freelancing a few projects during this time to earn a few extra bucks. </p>\n\n<p>My questions are: \n1. Which platforms are best for finding such opportunities? \n2. How much money can i earn in a month, and will it be exhausting? \n3. Is freelancing and working for another company at the same time illegal? </p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    },
    {
      "title": "Applied Systems sues Comulate for Fraud and IP Theft",
      "link": "https://www.insurancebusinessmag.com/us/news/technology/applied-systems-sues-comulate-for-alleged-ip-theft-via-fake-agency-front-557615.aspx",
      "guid": "https://www.insurancebusinessmag.com/us/news/technology/applied-systems-sues-comulate-for-alleged-ip-theft-via-fake-agency-front-557615.aspx",
      "pubDate": "Tue, 2 Dec 2025 22:27:00 +0000",
      "description": "<a href='https://redlib.perennialte.ch//r/software/comments/1pcmm5q/applied_systems_sues_comulate_for_fraud_and_ip/'>Comments</a>",
      "content": "<!-- SC_OFF --><div class=\"md\"><p>Has anyone else heard Applied Systems is suing Comulate? According to the Applied, Comulate basically trojan horsed Applied to steal their proprietary data. Meanwhile, Comulate alleges this is just a ploy by Applied because they&#39;re butt-hurt they can&#39;t buy Comulate and because Comulate is better than them(?). </p>\n\n<p>To me, it doesn&#39;t seem possible that Comulate could source all this data through publicly accessible data. Can someone explain it to me?</p>\n</div><!-- SC_ON -->",
      "thumbnail": null
    }
  ],
  "group": "tech",
  "url": "https://redlib.perennialte.ch/r/software.rss",
  "lastFetched": "2025-12-03T13:51:37.242Z"
}